#pragma once

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Pal_structs.hpp"


namespace PalServer::Params
{

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.AttachToOwner
// 0x0178 (0x0178 - 0x0000)
struct BP_ActionUniqueAttackBase_C_AttachToOwner final
{
public:
	class APalSkillEffectBase*                    Effect;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0078(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_161[0x7];                                      // 0x0161(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_2;         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue_1;                // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_AttachToOwner) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_AttachToOwner");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_AttachToOwner) == 0x000178, "Wrong size on BP_ActionUniqueAttackBase_C_AttachToOwner");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, Effect) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::Effect' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, Offset) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::Offset' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, SocketName) == 0x000020, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::SocketName' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_GetActionCharacter_ReturnValue) == 0x000028, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_GetMainMesh_ReturnValue) == 0x000030, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_GetMainMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000038, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000040, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_NotEqual_NameName_ReturnValue) == 0x000058, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000060, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000078, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000160, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_GetActionCharacter_ReturnValue_2) == 0x000168, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_GetActionCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_AttachToOwner, CallFunc_GetMainMesh_ReturnValue_1) == 0x000170, "Member 'BP_ActionUniqueAttackBase_C_AttachToOwner::CallFunc_GetMainMesh_ReturnValue_1' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.CalculateTeleportDestination
// 0x0A00 (0x0A00 - 0x0000)
struct BP_ActionUniqueAttackBase_C_CalculateTeleportDestination final
{
public:
	bool                                          IsCharacter;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        SearchDegree;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TeleportCheckDistance;                             // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Destination;                                       // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               FaceRotate;                                        // 0x0030(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActionTarget_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D4[0x4];                                       // 0x00D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTargetLocation_ReturnValue;            // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_2;                // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_GetUniqueActionTarget_TargetActor;        // 0x0170(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetUniqueActionTarget_TargetActor_1;      // 0x01F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    K2Node_DynamicCast_AsPal_Player_Character;         // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0200(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_201[0xF];                                      // 0x0201(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMinimalViewInfo                       CallFunc_GetCameraView_DesiredView;                // 0x0210(0x07C0)()
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x09D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x09D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x09D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9DC[0x4];                                      // 0x09DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_3;                // 0x09E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast;             // 0x09F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeRotator_Yaw_ImplicitCast_1;           // 0x09FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination) == 0x000010, "Wrong alignment on BP_ActionUniqueAttackBase_C_CalculateTeleportDestination");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination) == 0x000A00, "Wrong size on BP_ActionUniqueAttackBase_C_CalculateTeleportDestination");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, IsCharacter) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::IsCharacter' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, SearchDegree) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::SearchDegree' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, TeleportCheckDistance) == 0x000010, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::TeleportCheckDistance' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, Destination) == 0x000018, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::Destination' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, FaceRotate) == 0x000030, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::FaceRotate' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000048, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000060, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_GetActionTarget_ReturnValue) == 0x000078, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_GetActionTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000080, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_RandomFloatInRange_ReturnValue) == 0x000090, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_MakeRotator_ReturnValue) == 0x000098, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_K2_GetActorRotation_ReturnValue) == 0x0000B0, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_BreakRotator_Roll) == 0x0000C8, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_BreakRotator_Pitch) == 0x0000CC, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_BreakRotator_Yaw) == 0x0000D0, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_ComposeRotators_ReturnValue) == 0x0000D8, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_MakeRotator_ReturnValue_1) == 0x0000F0, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_GetForwardVector_ReturnValue) == 0x000108, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000120, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000138, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_GetTargetLocation_ReturnValue) == 0x000140, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_GetTargetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_MakeRotator_ReturnValue_2) == 0x000158, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_MakeRotator_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_GetUniqueActionTarget_TargetActor) == 0x000170, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_GetUniqueActionTarget_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_GetForwardVector_ReturnValue_1) == 0x000178, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000190, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x0001A8, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_Add_VectorVector_ReturnValue) == 0x0001C0, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001D8, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_GetUniqueActionTarget_TargetActor_1) == 0x0001F0, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_GetUniqueActionTarget_TargetActor_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, K2Node_DynamicCast_AsPal_Player_Character) == 0x0001F8, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::K2Node_DynamicCast_AsPal_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, K2Node_DynamicCast_bSuccess) == 0x000200, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_GetCameraView_DesiredView) == 0x000210, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_GetCameraView_DesiredView' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_BreakRotator_Roll_1) == 0x0009D0, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_BreakRotator_Pitch_1) == 0x0009D4, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_BreakRotator_Yaw_1) == 0x0009D8, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_MakeRotator_ReturnValue_3) == 0x0009E0, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_MakeRotator_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_MakeRotator_Yaw_ImplicitCast) == 0x0009F8, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_MakeRotator_Yaw_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CalculateTeleportDestination, CallFunc_MakeRotator_Yaw_ImplicitCast_1) == 0x0009FC, "Member 'BP_ActionUniqueAttackBase_C_CalculateTeleportDestination::CallFunc_MakeRotator_Yaw_ImplicitCast_1' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.CreateSkillActionModule
// 0x0058 (0x0058 - 0x0000)
struct BP_ActionUniqueAttackBase_C_CreateSkillActionModule final
{
public:
	class UClass*                                 UniqueSkillModuleClass;                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UniqueSkillModule_Tackle_C*         Module;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidClass_ReturnValue;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalUniqueSkillModule*                  CallFunc_SpawnObject_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_UniqueSkillModule_Tackle_C*         K2Node_DynamicCast_AsBP_Unique_Skill_Module_Tackle; // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_CreateSkillActionModule");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule) == 0x000058, "Wrong size on BP_ActionUniqueAttackBase_C_CreateSkillActionModule");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, UniqueSkillModuleClass) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::UniqueSkillModuleClass' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, Module) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::Module' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, CallFunc_IsValidClass_ReturnValue) == 0x000010, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::CallFunc_IsValidClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, CallFunc_Conv_NameToString_ReturnValue) == 0x000018, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, CallFunc_Concat_StrStr_ReturnValue) == 0x000028, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, CallFunc_GetActionCharacter_ReturnValue) == 0x000038, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, CallFunc_SpawnObject_ReturnValue) == 0x000040, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, K2Node_DynamicCast_AsBP_Unique_Skill_Module_Tackle) == 0x000048, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::K2Node_DynamicCast_AsBP_Unique_Skill_Module_Tackle' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_CreateSkillActionModule, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_ActionUniqueAttackBase_C_CreateSkillActionModule::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.ExecuteUbergraph_BP_ActionUniqueAttackBase
// 0x0150 (0x0150 - 0x0000)
struct BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_EffectKey;                      // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_NameToString_ReturnValue;            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FSkillEffectSpawnParameter             CallFunc_Map_Find_Value;                           // 0x0048(0x0038)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRandomStream                          CallFunc_GetRandomStream_ReturnValue;              // 0x0084(0x0008)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0090(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetUniqueActionTarget_TargetActor;        // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalSkillEffectBase*                    CallFunc_FinishSpawningActor_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class APalSkillEffectBase>     CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0110(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase) == 0x000010, "Wrong alignment on BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase) == 0x000150, "Wrong size on BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, EntryPoint) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_GetActionCharacter_ReturnValue) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000010, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, K2Node_CustomEvent_EffectKey) == 0x000018, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::K2Node_CustomEvent_EffectKey' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, K2Node_Event_DeltaTime) == 0x000020, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_Conv_NameToString_ReturnValue) == 0x000028, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_Conv_NameToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_Concat_StrStr_ReturnValue) == 0x000038, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_Map_Find_Value) == 0x000048, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_Map_Find_ReturnValue) == 0x000080, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_GetRandomStream_ReturnValue) == 0x000084, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_GetRandomStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_MakeTransform_ReturnValue) == 0x000090, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_GetUniqueActionTarget_TargetActor) == 0x0000F0, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_GetUniqueActionTarget_TargetActor' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000F8, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_FinishSpawningActor_ReturnValue) == 0x000100, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_IsValid_ReturnValue) == 0x000108, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000110, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase, CallFunc_Array_Add_ReturnValue) == 0x000140, "Member 'BP_ActionUniqueAttackBase_C_ExecuteUbergraph_BP_ActionUniqueAttackBase::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.FindActionTarget
// 0x0090 (0x0090 - 0x0000)
struct BP_ActionUniqueAttackBase_C_FindActionTarget final
{
public:
	class AActor*                                 CallFunc_GetActionTarget_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalActionDummyTargetActor*             K2Node_DynamicCast_AsPal_Action_Dummy_Target_Actor; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetActionTarget_ReturnValue_1;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetRiderPlayer_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetRiderPlayer_ReturnValue_1;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActionTarget_ReturnValue_2;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsApplicableDamage_ReturnValue;           // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_2;         // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_ReturnValue; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x3];                                       // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InHeight_ImplicitCast; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InDistance_ImplicitCast; // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InDegree_ImplicitCast; // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_FindActionTarget) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_FindActionTarget");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_FindActionTarget) == 0x000090, "Wrong size on BP_ActionUniqueAttackBase_C_FindActionTarget");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetActionTarget_ReturnValue) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetActionTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, K2Node_DynamicCast_AsPal_Action_Dummy_Target_Actor) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::K2Node_DynamicCast_AsPal_Action_Dummy_Target_Actor' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetActionTarget_ReturnValue_1) == 0x000018, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetActionTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetRiderPlayer_ReturnValue) == 0x000020, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetRiderPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetRiderPlayer_ReturnValue_1) == 0x000028, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetRiderPlayer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetActionCharacter_ReturnValue) == 0x000030, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_IsPlayerControlled_ReturnValue) == 0x000039, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000040, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetActionTarget_ReturnValue_2) == 0x000048, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetActionTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_IsApplicableDamage_ReturnValue) == 0x000050, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_IsApplicableDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_IsValid_ReturnValue_1) == 0x000051, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetActionCharacter_ReturnValue_2) == 0x000058, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetActionCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_ReturnValue) == 0x000078, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_IsValid_ReturnValue_2) == 0x000080, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InHeight_ImplicitCast) == 0x000084, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InHeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InDistance_ImplicitCast) == 0x000088, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InDistance_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindActionTarget, CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InDegree_ImplicitCast) == 0x00008C, "Member 'BP_ActionUniqueAttackBase_C_FindActionTarget::CallFunc_GetNearestEnemyByLocation_FrontPlayerCamera_InDegree_ImplicitCast' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.FindEffectByClass
// 0x0080 (0x0080 - 0x0000)
struct BP_ActionUniqueAttackBase_C_FindEffectByClass final
{
public:
	class UClass*                                 EffectClass;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalSkillEffectBase*                    Effect;                                            // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class APalSkillEffectBase>     CallFunc_Array_Get_Item;                           // 0x0020(0x0030)(HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalSkillEffectBase*                    K2Node_DynamicCast_AsPal_Skill_Effect_Base;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_FindEffectByClass) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_FindEffectByClass");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_FindEffectByClass) == 0x000080, "Wrong size on BP_ActionUniqueAttackBase_C_FindEffectByClass");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, EffectClass) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::EffectClass' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, Effect) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::Effect' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, Temp_int_Loop_Counter_Variable) == 0x000014, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_Add_IntInt_ReturnValue) == 0x000018, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_Array_Length_ReturnValue) == 0x00001C, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000058, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, K2Node_DynamicCast_AsPal_Skill_Effect_Base) == 0x000060, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::K2Node_DynamicCast_AsPal_Skill_Effect_Base' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_GetObjectClass_ReturnValue) == 0x000070, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000078, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_FindEffectByClass, CallFunc_IsValid_ReturnValue) == 0x000079, "Member 'BP_ActionUniqueAttackBase_C_FindEffectByClass::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ActionUniqueAttackBase.BP_ActionUniqueAttackBase_C.GetAttackTargetLocation
// 0x00F0 (0x00F0 - 0x0000)
struct BP_ActionUniqueAttackBase_C_GetAttackTargetLocation final
{
public:
	bool                                          IsFrontLocation;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        FrontDistance;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Location;                                          // 0x0010(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTargetLocation_ReturnValue;            // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetUniqueActionTarget_TargetActor;        // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetAttackTargetLocation_ReturnValue;      // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation) == 0x000008, "Wrong alignment on BP_ActionUniqueAttackBase_C_GetAttackTargetLocation");
static_assert(sizeof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation) == 0x0000F0, "Wrong size on BP_ActionUniqueAttackBase_C_GetAttackTargetLocation");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, IsFrontLocation) == 0x000000, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::IsFrontLocation' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, FrontDistance) == 0x000008, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::FrontDistance' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, Location) == 0x000010, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::Location' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000028, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_GetTargetLocation_ReturnValue) == 0x000040, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_GetTargetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_GetActionCharacter_ReturnValue) == 0x000058, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionUniqueAttackBase_C_GetAttackTargetLocation, CallFunc_GetActorForwardVector_ReturnValue) == 0x000078, "Member 'BP_ActionUniqueAttackBase_C_GetAttackTargetLocation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
