#pragma once

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "Pal_structs.hpp"


namespace PalServer::Params
{

// Function BP_Action_Grappling.BP_Action_Grappling_C.DisableShooter
// 0x0028 (0x0028 - 0x0000)
struct BP_Action_Grappling_C_DisableShooter final
{
public:
	bool                                          Disable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalShooterFlagContainerPriority              Priority;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalShooterComponent*                   Shooter;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalShooterComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Grappling_C_DisableShooter) == 0x000008, "Wrong alignment on BP_Action_Grappling_C_DisableShooter");
static_assert(sizeof(BP_Action_Grappling_C_DisableShooter) == 0x000028, "Wrong size on BP_Action_Grappling_C_DisableShooter");
static_assert(offsetof(BP_Action_Grappling_C_DisableShooter, Disable) == 0x000000, "Member 'BP_Action_Grappling_C_DisableShooter::Disable' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_DisableShooter, Priority) == 0x000001, "Member 'BP_Action_Grappling_C_DisableShooter::Priority' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_DisableShooter, Shooter) == 0x000008, "Member 'BP_Action_Grappling_C_DisableShooter::Shooter' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_DisableShooter, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_Action_Grappling_C_DisableShooter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_DisableShooter, CallFunc_GetActionCharacter_ReturnValue) == 0x000018, "Member 'BP_Action_Grappling_C_DisableShooter::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_DisableShooter, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_Action_Grappling_C_DisableShooter::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_Action_Grappling.BP_Action_Grappling_C.ExecuteUbergraph_BP_Action_Grappling
// 0x0380 (0x0380 - 0x0000)
struct BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x004C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0054(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPalNetArchive                         CallFunc_GetBlackboard_ReturnValue;                // 0x0070(0x0010)(ConstParm)
	struct FVector                                CallFunc_ReadPlayerGrappling_HitLocatoin;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ReadPlayerGrappling_Speed;                // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9C[0x4];                                       // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_ReadPlayerGrappling_HitNormal;            // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ReadPlayerGrappling_CoolTimeRate;         // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindMontange_bExist;                      // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_FindMontange_ReturnValue;                 // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00F8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_2;         // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_3;         // 0x0118(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterMovementComponent*         CallFunc_GetPalCharacterMovementComponent_ReturnValue; // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue;                  // 0x0128(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  CallFunc_Conv_RotatorToQuaternion_ReturnValue;     // 0x0130(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFalling_ReturnValue;                    // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_4;         // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterMovementComponent*         CallFunc_GetPalCharacterMovementComponent_ReturnValue_1; // 0x0160(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_5;         // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGrappling_ReturnValue;                  // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue_1;                // 0x0178(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClimbing_ReturnValue;                   // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_181[0x7];                                      // 0x0181(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_Quat_Rotator_ReturnValue;                 // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_Quat_Rotator_ReturnValue_1;               // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x01B8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_6;         // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_7;         // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x02B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterMovementComponent*         CallFunc_GetPalCharacterMovementComponent_ReturnValue_2; // 0x02C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x02D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x02E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsGrappling_ReturnValue_1;                // 0x02E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x02E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalControlActor_ReturnValue;          // 0x02EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x02EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2ED[0x3];                                      // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_8;         // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_9;         // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue_2;                // 0x0300(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_10;        // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_FindMontange_bExist_1;                    // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_311[0x7];                                      // 0x0311(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_FindMontange_ReturnValue_1;               // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterMovementComponent*         CallFunc_GetPalCharacterMovementComponent_ReturnValue_3; // 0x0320(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGrapplingMoveEndLocation_ReturnValue;  // 0x0330(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAtLocation_ReturnValue;        // 0x0348(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0350(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_PlayAkEventSoundByActor_ReturnValue;      // 0x0351(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_352[0x2];                                      // 0x0352(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0354(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x035C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36C[0x4];                                      // 0x036C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_NotifyStartToWeapon_CoolTImeRate_ImplicitCast; // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling) == 0x000010, "Wrong alignment on BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling");
static_assert(sizeof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling) == 0x000380, "Wrong size on BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, EntryPoint) == 0x000000, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, K2Node_CustomEvent_NotifyName_3) == 0x000004, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, K2Node_CustomEvent_NotifyName_2) == 0x00001C, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, K2Node_CreateDelegate_OutputDelegate_1) == 0x000024, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, K2Node_CustomEvent_NotifyName_1) == 0x000034, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, K2Node_CreateDelegate_OutputDelegate_2) == 0x00003C, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, K2Node_CustomEvent_NotifyName) == 0x00004C, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, K2Node_CreateDelegate_OutputDelegate_3) == 0x000054, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, Temp_name_Variable) == 0x000064, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, K2Node_Event_DeltaTime) == 0x00006C, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetBlackboard_ReturnValue) == 0x000070, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetBlackboard_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_ReadPlayerGrappling_HitLocatoin) == 0x000080, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_ReadPlayerGrappling_HitLocatoin' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_ReadPlayerGrappling_Speed) == 0x000098, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_ReadPlayerGrappling_Speed' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_ReadPlayerGrappling_HitNormal) == 0x0000A0, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_ReadPlayerGrappling_HitNormal' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_ReadPlayerGrappling_CoolTimeRate) == 0x0000B8, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_ReadPlayerGrappling_CoolTimeRate' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_BreakVector_X) == 0x0000C0, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_BreakVector_Y) == 0x0000C8, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_BreakVector_Z) == 0x0000D0, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetActionCharacter_ReturnValue) == 0x0000D8, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetActionCharacter_ReturnValue_1) == 0x0000E0, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_FindMontange_bExist) == 0x0000E8, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_FindMontange_bExist' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_FindMontange_ReturnValue) == 0x0000F0, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_FindMontange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_MakeVector_ReturnValue) == 0x0000F8, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetActionCharacter_ReturnValue_2) == 0x000110, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetActionCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetActionCharacter_ReturnValue_3) == 0x000118, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetActionCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetPalCharacterMovementComponent_ReturnValue) == 0x000120, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetPalCharacterMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetMainMesh_ReturnValue) == 0x000128, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetMainMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_Conv_RotatorToQuaternion_ReturnValue) == 0x000130, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_Conv_RotatorToQuaternion_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_IsFalling_ReturnValue) == 0x000150, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_IsFalling_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetActionCharacter_ReturnValue_4) == 0x000158, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetActionCharacter_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetPalCharacterMovementComponent_ReturnValue_1) == 0x000160, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetPalCharacterMovementComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetActionCharacter_ReturnValue_5) == 0x000168, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetActionCharacter_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_IsGrappling_ReturnValue) == 0x000170, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_IsGrappling_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetMainMesh_ReturnValue_1) == 0x000178, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetMainMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_IsClimbing_ReturnValue) == 0x000180, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_IsClimbing_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_Quat_Rotator_ReturnValue) == 0x000188, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_Quat_Rotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_Quat_Rotator_ReturnValue_1) == 0x0001A0, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_Quat_Rotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x0001B8, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetActionCharacter_ReturnValue_6) == 0x0002A0, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetActionCharacter_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetActionCharacter_ReturnValue_7) == 0x0002A8, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetActionCharacter_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0002B0, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetPalCharacterMovementComponent_ReturnValue_2) == 0x0002C8, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetPalCharacterMovementComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_BreakVector_X_1) == 0x0002D0, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_BreakVector_Y_1) == 0x0002D8, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_BreakVector_Z_1) == 0x0002E0, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_IsGrappling_ReturnValue_1) == 0x0002E8, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_IsGrappling_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0002E9, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_IsLocalControlActor_ReturnValue) == 0x0002EA, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_IsLocalControlActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_HasAuthority_ReturnValue) == 0x0002EB, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_BooleanOR_ReturnValue) == 0x0002EC, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetActionCharacter_ReturnValue_8) == 0x0002F0, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetActionCharacter_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetActionCharacter_ReturnValue_9) == 0x0002F8, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetActionCharacter_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetMainMesh_ReturnValue_2) == 0x000300, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetMainMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetActionCharacter_ReturnValue_10) == 0x000308, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetActionCharacter_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_FindMontange_bExist_1) == 0x000310, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_FindMontange_bExist_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_FindMontange_ReturnValue_1) == 0x000318, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_FindMontange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetPalCharacterMovementComponent_ReturnValue_3) == 0x000320, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetPalCharacterMovementComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000328, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_GetGrapplingMoveEndLocation_ReturnValue) == 0x000330, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_GetGrapplingMoveEndLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_SpawnSystemAtLocation_ReturnValue) == 0x000348, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_SpawnSystemAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_IsValid_ReturnValue) == 0x000350, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_PlayAkEventSoundByActor_ReturnValue) == 0x000351, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_PlayAkEventSoundByActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, K2Node_CustomEvent_NotifyName_4) == 0x000354, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, K2Node_CreateDelegate_OutputDelegate_4) == 0x00035C, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling, CallFunc_NotifyStartToWeapon_CoolTImeRate_ImplicitCast) == 0x000370, "Member 'BP_Action_Grappling_C_ExecuteUbergraph_BP_Action_Grappling::CallFunc_NotifyStartToWeapon_CoolTImeRate_ImplicitCast' has a wrong offset!");

// Function BP_Action_Grappling.BP_Action_Grappling_C.GetOffRide
// 0x0030 (0x0030 - 0x0000)
struct BP_Action_Grappling_C_GetOffRide final
{
public:
	class APalCharacter*                          CallFunc_FindOwnerPalCharacter_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_FindOwnerPalCharacter_ReturnValue_1;      // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalRiderComponent*                     CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetOffFromPal_ReturnValue;                // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRiding_ReturnValue;                     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Grappling_C_GetOffRide) == 0x000008, "Wrong alignment on BP_Action_Grappling_C_GetOffRide");
static_assert(sizeof(BP_Action_Grappling_C_GetOffRide) == 0x000030, "Wrong size on BP_Action_Grappling_C_GetOffRide");
static_assert(offsetof(BP_Action_Grappling_C_GetOffRide, CallFunc_FindOwnerPalCharacter_ReturnValue) == 0x000000, "Member 'BP_Action_Grappling_C_GetOffRide::CallFunc_FindOwnerPalCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_GetOffRide, CallFunc_FindOwnerPalCharacter_ReturnValue_1) == 0x000008, "Member 'BP_Action_Grappling_C_GetOffRide::CallFunc_FindOwnerPalCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_GetOffRide, CallFunc_GetController_ReturnValue) == 0x000010, "Member 'BP_Action_Grappling_C_GetOffRide::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_GetOffRide, CallFunc_HasAuthority_ReturnValue) == 0x000018, "Member 'BP_Action_Grappling_C_GetOffRide::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_GetOffRide, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_Action_Grappling_C_GetOffRide::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_GetOffRide, CallFunc_GetOffFromPal_ReturnValue) == 0x000028, "Member 'BP_Action_Grappling_C_GetOffRide::CallFunc_GetOffFromPal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_GetOffRide, CallFunc_IsRiding_ReturnValue) == 0x000029, "Member 'BP_Action_Grappling_C_GetOffRide::CallFunc_IsRiding_ReturnValue' has a wrong offset!");

// Function BP_Action_Grappling.BP_Action_Grappling_C.NotifyFinishToWeapon
// 0x0030 (0x0030 - 0x0000)
struct BP_Action_Grappling_C_NotifyFinishToWeapon final
{
public:
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    K2Node_DynamicCast_AsPal_Player_Character;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalWeaponBase*                         CallFunc_GetHasWeapon_ReturnValue;                 // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GrapplingGun_C*                     K2Node_DynamicCast_AsBP_Grappling_Gun;             // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Grappling_C_NotifyFinishToWeapon) == 0x000008, "Wrong alignment on BP_Action_Grappling_C_NotifyFinishToWeapon");
static_assert(sizeof(BP_Action_Grappling_C_NotifyFinishToWeapon) == 0x000030, "Wrong size on BP_Action_Grappling_C_NotifyFinishToWeapon");
static_assert(offsetof(BP_Action_Grappling_C_NotifyFinishToWeapon, CallFunc_GetActionCharacter_ReturnValue) == 0x000000, "Member 'BP_Action_Grappling_C_NotifyFinishToWeapon::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_NotifyFinishToWeapon, K2Node_DynamicCast_AsPal_Player_Character) == 0x000008, "Member 'BP_Action_Grappling_C_NotifyFinishToWeapon::K2Node_DynamicCast_AsPal_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_NotifyFinishToWeapon, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_Action_Grappling_C_NotifyFinishToWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_NotifyFinishToWeapon, CallFunc_GetHasWeapon_ReturnValue) == 0x000018, "Member 'BP_Action_Grappling_C_NotifyFinishToWeapon::CallFunc_GetHasWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_NotifyFinishToWeapon, K2Node_DynamicCast_AsBP_Grappling_Gun) == 0x000020, "Member 'BP_Action_Grappling_C_NotifyFinishToWeapon::K2Node_DynamicCast_AsBP_Grappling_Gun' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_NotifyFinishToWeapon, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'BP_Action_Grappling_C_NotifyFinishToWeapon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_Action_Grappling.BP_Action_Grappling_C.NotifyStartToWeapon
// 0x0050 (0x0050 - 0x0000)
struct BP_Action_Grappling_C_NotifyStartToWeapon final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CoolTimeRate;                                      // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    K2Node_DynamicCast_AsPal_Player_Character;         // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalWeaponBase*                         CallFunc_GetHasWeapon_ReturnValue;                 // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GrapplingGun_C*                     K2Node_DynamicCast_AsBP_Grappling_Gun;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Grappling_C_NotifyStartToWeapon) == 0x000008, "Wrong alignment on BP_Action_Grappling_C_NotifyStartToWeapon");
static_assert(sizeof(BP_Action_Grappling_C_NotifyStartToWeapon) == 0x000050, "Wrong size on BP_Action_Grappling_C_NotifyStartToWeapon");
static_assert(offsetof(BP_Action_Grappling_C_NotifyStartToWeapon, HitLocation) == 0x000000, "Member 'BP_Action_Grappling_C_NotifyStartToWeapon::HitLocation' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_NotifyStartToWeapon, CoolTimeRate) == 0x000018, "Member 'BP_Action_Grappling_C_NotifyStartToWeapon::CoolTimeRate' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_NotifyStartToWeapon, CallFunc_GetActionCharacter_ReturnValue) == 0x000020, "Member 'BP_Action_Grappling_C_NotifyStartToWeapon::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_NotifyStartToWeapon, K2Node_DynamicCast_AsPal_Player_Character) == 0x000028, "Member 'BP_Action_Grappling_C_NotifyStartToWeapon::K2Node_DynamicCast_AsPal_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_NotifyStartToWeapon, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_Action_Grappling_C_NotifyStartToWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_NotifyStartToWeapon, CallFunc_GetHasWeapon_ReturnValue) == 0x000038, "Member 'BP_Action_Grappling_C_NotifyStartToWeapon::CallFunc_GetHasWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_NotifyStartToWeapon, K2Node_DynamicCast_AsBP_Grappling_Gun) == 0x000040, "Member 'BP_Action_Grappling_C_NotifyStartToWeapon::K2Node_DynamicCast_AsBP_Grappling_Gun' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_NotifyStartToWeapon, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BP_Action_Grappling_C_NotifyStartToWeapon::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function BP_Action_Grappling.BP_Action_Grappling_C.OnBlendOut_6CB4C09840328B4E3D8F4680A0904209
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Grappling_C_OnBlendOut_6CB4C09840328B4E3D8F4680A0904209 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Grappling_C_OnBlendOut_6CB4C09840328B4E3D8F4680A0904209) == 0x000004, "Wrong alignment on BP_Action_Grappling_C_OnBlendOut_6CB4C09840328B4E3D8F4680A0904209");
static_assert(sizeof(BP_Action_Grappling_C_OnBlendOut_6CB4C09840328B4E3D8F4680A0904209) == 0x000008, "Wrong size on BP_Action_Grappling_C_OnBlendOut_6CB4C09840328B4E3D8F4680A0904209");
static_assert(offsetof(BP_Action_Grappling_C_OnBlendOut_6CB4C09840328B4E3D8F4680A0904209, NotifyName) == 0x000000, "Member 'BP_Action_Grappling_C_OnBlendOut_6CB4C09840328B4E3D8F4680A0904209::NotifyName' has a wrong offset!");

// Function BP_Action_Grappling.BP_Action_Grappling_C.OnCompleted_6CB4C09840328B4E3D8F4680A0904209
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Grappling_C_OnCompleted_6CB4C09840328B4E3D8F4680A0904209 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Grappling_C_OnCompleted_6CB4C09840328B4E3D8F4680A0904209) == 0x000004, "Wrong alignment on BP_Action_Grappling_C_OnCompleted_6CB4C09840328B4E3D8F4680A0904209");
static_assert(sizeof(BP_Action_Grappling_C_OnCompleted_6CB4C09840328B4E3D8F4680A0904209) == 0x000008, "Wrong size on BP_Action_Grappling_C_OnCompleted_6CB4C09840328B4E3D8F4680A0904209");
static_assert(offsetof(BP_Action_Grappling_C_OnCompleted_6CB4C09840328B4E3D8F4680A0904209, NotifyName) == 0x000000, "Member 'BP_Action_Grappling_C_OnCompleted_6CB4C09840328B4E3D8F4680A0904209::NotifyName' has a wrong offset!");

// Function BP_Action_Grappling.BP_Action_Grappling_C.OnInterrupted_6CB4C09840328B4E3D8F4680A0904209
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Grappling_C_OnInterrupted_6CB4C09840328B4E3D8F4680A0904209 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Grappling_C_OnInterrupted_6CB4C09840328B4E3D8F4680A0904209) == 0x000004, "Wrong alignment on BP_Action_Grappling_C_OnInterrupted_6CB4C09840328B4E3D8F4680A0904209");
static_assert(sizeof(BP_Action_Grappling_C_OnInterrupted_6CB4C09840328B4E3D8F4680A0904209) == 0x000008, "Wrong size on BP_Action_Grappling_C_OnInterrupted_6CB4C09840328B4E3D8F4680A0904209");
static_assert(offsetof(BP_Action_Grappling_C_OnInterrupted_6CB4C09840328B4E3D8F4680A0904209, NotifyName) == 0x000000, "Member 'BP_Action_Grappling_C_OnInterrupted_6CB4C09840328B4E3D8F4680A0904209::NotifyName' has a wrong offset!");

// Function BP_Action_Grappling.BP_Action_Grappling_C.OnNotifyBegin_6CB4C09840328B4E3D8F4680A0904209
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Grappling_C_OnNotifyBegin_6CB4C09840328B4E3D8F4680A0904209 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Grappling_C_OnNotifyBegin_6CB4C09840328B4E3D8F4680A0904209) == 0x000004, "Wrong alignment on BP_Action_Grappling_C_OnNotifyBegin_6CB4C09840328B4E3D8F4680A0904209");
static_assert(sizeof(BP_Action_Grappling_C_OnNotifyBegin_6CB4C09840328B4E3D8F4680A0904209) == 0x000008, "Wrong size on BP_Action_Grappling_C_OnNotifyBegin_6CB4C09840328B4E3D8F4680A0904209");
static_assert(offsetof(BP_Action_Grappling_C_OnNotifyBegin_6CB4C09840328B4E3D8F4680A0904209, NotifyName) == 0x000000, "Member 'BP_Action_Grappling_C_OnNotifyBegin_6CB4C09840328B4E3D8F4680A0904209::NotifyName' has a wrong offset!");

// Function BP_Action_Grappling.BP_Action_Grappling_C.OnNotifyEnd_6CB4C09840328B4E3D8F4680A0904209
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Grappling_C_OnNotifyEnd_6CB4C09840328B4E3D8F4680A0904209 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Grappling_C_OnNotifyEnd_6CB4C09840328B4E3D8F4680A0904209) == 0x000004, "Wrong alignment on BP_Action_Grappling_C_OnNotifyEnd_6CB4C09840328B4E3D8F4680A0904209");
static_assert(sizeof(BP_Action_Grappling_C_OnNotifyEnd_6CB4C09840328B4E3D8F4680A0904209) == 0x000008, "Wrong size on BP_Action_Grappling_C_OnNotifyEnd_6CB4C09840328B4E3D8F4680A0904209");
static_assert(offsetof(BP_Action_Grappling_C_OnNotifyEnd_6CB4C09840328B4E3D8F4680A0904209, NotifyName) == 0x000000, "Member 'BP_Action_Grappling_C_OnNotifyEnd_6CB4C09840328B4E3D8F4680A0904209::NotifyName' has a wrong offset!");

// Function BP_Action_Grappling.BP_Action_Grappling_C.SetPlayerVelocity
// 0x0020 (0x0020 - 0x0000)
struct BP_Action_Grappling_C_SetPlayerVelocity final
{
public:
	struct FVector                                Velocity;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Grappling_C_SetPlayerVelocity) == 0x000008, "Wrong alignment on BP_Action_Grappling_C_SetPlayerVelocity");
static_assert(sizeof(BP_Action_Grappling_C_SetPlayerVelocity) == 0x000020, "Wrong size on BP_Action_Grappling_C_SetPlayerVelocity");
static_assert(offsetof(BP_Action_Grappling_C_SetPlayerVelocity, Velocity) == 0x000000, "Member 'BP_Action_Grappling_C_SetPlayerVelocity::Velocity' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_SetPlayerVelocity, CallFunc_GetActionCharacter_ReturnValue) == 0x000018, "Member 'BP_Action_Grappling_C_SetPlayerVelocity::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");

// Function BP_Action_Grappling.BP_Action_Grappling_C.TickAction
// 0x0004 (0x0004 - 0x0000)
struct BP_Action_Grappling_C_TickAction final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Grappling_C_TickAction) == 0x000004, "Wrong alignment on BP_Action_Grappling_C_TickAction");
static_assert(sizeof(BP_Action_Grappling_C_TickAction) == 0x000004, "Wrong size on BP_Action_Grappling_C_TickAction");
static_assert(offsetof(BP_Action_Grappling_C_TickAction, DeltaTime) == 0x000000, "Member 'BP_Action_Grappling_C_TickAction::DeltaTime' has a wrong offset!");

// Function BP_Action_Grappling.BP_Action_Grappling_C.TryClimb
// 0x0060 (0x0060 - 0x0000)
struct BP_Action_Grappling_C_TryClimb final
{
public:
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterMovementComponent*         CallFunc_GetPalCharacterMovementComponent_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalClimbingComponent*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGrapplingMoveEndLocation_ReturnValue;  // 0x0020(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryClimbAfterGrappling_ReturnValue;       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNearTwoPoint_ReturnValue;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Grappling_C_TryClimb) == 0x000008, "Wrong alignment on BP_Action_Grappling_C_TryClimb");
static_assert(sizeof(BP_Action_Grappling_C_TryClimb) == 0x000060, "Wrong size on BP_Action_Grappling_C_TryClimb");
static_assert(offsetof(BP_Action_Grappling_C_TryClimb, CallFunc_GetActionCharacter_ReturnValue) == 0x000000, "Member 'BP_Action_Grappling_C_TryClimb::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_TryClimb, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000008, "Member 'BP_Action_Grappling_C_TryClimb::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_TryClimb, CallFunc_GetPalCharacterMovementComponent_ReturnValue) == 0x000010, "Member 'BP_Action_Grappling_C_TryClimb::CallFunc_GetPalCharacterMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_TryClimb, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_Action_Grappling_C_TryClimb::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_TryClimb, CallFunc_GetGrapplingMoveEndLocation_ReturnValue) == 0x000020, "Member 'BP_Action_Grappling_C_TryClimb::CallFunc_GetGrapplingMoveEndLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_TryClimb, CallFunc_TryClimbAfterGrappling_ReturnValue) == 0x000038, "Member 'BP_Action_Grappling_C_TryClimb::CallFunc_TryClimbAfterGrappling_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_TryClimb, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000040, "Member 'BP_Action_Grappling_C_TryClimb::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_TryClimb, CallFunc_IsNearTwoPoint_ReturnValue) == 0x000058, "Member 'BP_Action_Grappling_C_TryClimb::CallFunc_IsNearTwoPoint_ReturnValue' has a wrong offset!");

// Function BP_Action_Grappling.BP_Action_Grappling_C.UpdateMeshRotation
// 0x0210 (0x0210 - 0x0000)
struct BP_Action_Grappling_C_UpdateMeshRotation final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FQuat                                  CallFunc_Conv_RotatorToQuaternion_ReturnValue;     // 0x0030(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterMovementComponent*         CallFunc_GetPalCharacterMovementComponent_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetGrapplingMoveHitLocation_ReturnValue;  // 0x0068(0x0018)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FQuat                                  CallFunc_Conv_RotatorToQuaternion_ReturnValue_1;   // 0x00B0(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  CallFunc_Multiply_QuatQuat_ReturnValue;            // 0x00D0(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuat                                  CallFunc_Multiply_QuatQuat_ReturnValue_1;          // 0x00F0(0x0020)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_Quat_Rotator_ReturnValue;                 // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetWorldRotation_SweepHitResult;       // 0x0128(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Action_Grappling_C_UpdateMeshRotation) == 0x000010, "Wrong alignment on BP_Action_Grappling_C_UpdateMeshRotation");
static_assert(sizeof(BP_Action_Grappling_C_UpdateMeshRotation) == 0x000210, "Wrong size on BP_Action_Grappling_C_UpdateMeshRotation");
static_assert(offsetof(BP_Action_Grappling_C_UpdateMeshRotation, DeltaTime) == 0x000000, "Member 'BP_Action_Grappling_C_UpdateMeshRotation::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_UpdateMeshRotation, CallFunc_GetActionCharacter_ReturnValue) == 0x000008, "Member 'BP_Action_Grappling_C_UpdateMeshRotation::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Grappling_C_UpdateMeshRotation, CallFunc_MakeRotator_ReturnValue) == 0x000010, "Member 'BP_Action_Grappling_C_UpdateMeshRotation::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
