#pragma once

#include "Basic.hpp"


namespace PalServer::Params
{

// Function BP_BuildObject_WeaponFactoryBase.BP_BuildObject_WeaponFactoryBase_C.ExecuteUbergraph_BP_BuildObject_WeaponFactoryBase
// 0x0004 (0x0004 - 0x0000)
struct BP_BuildObject_WeaponFactoryBase_C_ExecuteUbergraph_BP_BuildObject_WeaponFactoryBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildObject_WeaponFactoryBase_C_ExecuteUbergraph_BP_BuildObject_WeaponFactoryBase) == 0x000004, "Wrong alignment on BP_BuildObject_WeaponFactoryBase_C_ExecuteUbergraph_BP_BuildObject_WeaponFactoryBase");
static_assert(sizeof(BP_BuildObject_WeaponFactoryBase_C_ExecuteUbergraph_BP_BuildObject_WeaponFactoryBase) == 0x000004, "Wrong size on BP_BuildObject_WeaponFactoryBase_C_ExecuteUbergraph_BP_BuildObject_WeaponFactoryBase");
static_assert(offsetof(BP_BuildObject_WeaponFactoryBase_C_ExecuteUbergraph_BP_BuildObject_WeaponFactoryBase, EntryPoint) == 0x000000, "Member 'BP_BuildObject_WeaponFactoryBase_C_ExecuteUbergraph_BP_BuildObject_WeaponFactoryBase::EntryPoint' has a wrong offset!");

// Function BP_BuildObject_WeaponFactoryBase.BP_BuildObject_WeaponFactoryBase_C.WeaponLoop
// 0x0008 (0x0008 - 0x0000)
struct BP_BuildObject_WeaponFactoryBase_C_WeaponLoop final
{
public:
	class USceneComponent*                        Input;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildObject_WeaponFactoryBase_C_WeaponLoop) == 0x000008, "Wrong alignment on BP_BuildObject_WeaponFactoryBase_C_WeaponLoop");
static_assert(sizeof(BP_BuildObject_WeaponFactoryBase_C_WeaponLoop) == 0x000008, "Wrong size on BP_BuildObject_WeaponFactoryBase_C_WeaponLoop");
static_assert(offsetof(BP_BuildObject_WeaponFactoryBase_C_WeaponLoop, Input) == 0x000000, "Member 'BP_BuildObject_WeaponFactoryBase_C_WeaponLoop::Input' has a wrong offset!");

}

