#pragma once

#include "Basic.hpp"


namespace PalServer::Params
{

// Function BP_Item_Anim_PalEgg_Base.BP_Item_Anim_PalEgg_Base_C.ExecuteUbergraph_BP_Item_Anim_PalEgg_Base
// 0x0004 (0x0004 - 0x0000)
struct BP_Item_Anim_PalEgg_Base_C_ExecuteUbergraph_BP_Item_Anim_PalEgg_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Anim_PalEgg_Base_C_ExecuteUbergraph_BP_Item_Anim_PalEgg_Base) == 0x000004, "Wrong alignment on BP_Item_Anim_PalEgg_Base_C_ExecuteUbergraph_BP_Item_Anim_PalEgg_Base");
static_assert(sizeof(BP_Item_Anim_PalEgg_Base_C_ExecuteUbergraph_BP_Item_Anim_PalEgg_Base) == 0x000004, "Wrong size on BP_Item_Anim_PalEgg_Base_C_ExecuteUbergraph_BP_Item_Anim_PalEgg_Base");
static_assert(offsetof(BP_Item_Anim_PalEgg_Base_C_ExecuteUbergraph_BP_Item_Anim_PalEgg_Base, EntryPoint) == 0x000000, "Member 'BP_Item_Anim_PalEgg_Base_C_ExecuteUbergraph_BP_Item_Anim_PalEgg_Base::EntryPoint' has a wrong offset!");

// Function BP_Item_Anim_PalEgg_Base.BP_Item_Anim_PalEgg_Base_C.GetHatchingTemperature
// 0x0004 (0x0004 - 0x0000)
struct BP_Item_Anim_PalEgg_Base_C_GetHatchingTemperature final
{
public:
	int32                                         Temperature;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Anim_PalEgg_Base_C_GetHatchingTemperature) == 0x000004, "Wrong alignment on BP_Item_Anim_PalEgg_Base_C_GetHatchingTemperature");
static_assert(sizeof(BP_Item_Anim_PalEgg_Base_C_GetHatchingTemperature) == 0x000004, "Wrong size on BP_Item_Anim_PalEgg_Base_C_GetHatchingTemperature");
static_assert(offsetof(BP_Item_Anim_PalEgg_Base_C_GetHatchingTemperature, Temperature) == 0x000000, "Member 'BP_Item_Anim_PalEgg_Base_C_GetHatchingTemperature::Temperature' has a wrong offset!");

// Function BP_Item_Anim_PalEgg_Base.BP_Item_Anim_PalEgg_Base_C.SetAnimPlayState
// 0x0001 (0x0001 - 0x0000)
struct BP_Item_Anim_PalEgg_Base_C_SetAnimPlayState final
{
public:
	bool                                          IsPlay;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Item_Anim_PalEgg_Base_C_SetAnimPlayState) == 0x000001, "Wrong alignment on BP_Item_Anim_PalEgg_Base_C_SetAnimPlayState");
static_assert(sizeof(BP_Item_Anim_PalEgg_Base_C_SetAnimPlayState) == 0x000001, "Wrong size on BP_Item_Anim_PalEgg_Base_C_SetAnimPlayState");
static_assert(offsetof(BP_Item_Anim_PalEgg_Base_C_SetAnimPlayState, IsPlay) == 0x000000, "Member 'BP_Item_Anim_PalEgg_Base_C_SetAnimPlayState::IsPlay' has a wrong offset!");

}

