#pragma once

#include "Basic.hpp"


namespace PalServer::Params
{

// Function BP_SkillEffect_Unique_Alpaca_Loop.BP_SkillEffect_Unique_Alpaca_Loop_C.ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop
// 0x00A0 (0x00A0 - 0x0000)
struct BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_DeltaSecond;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x3];                                       // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_1;      // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop) == 0x000008, "Wrong alignment on BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop");
static_assert(sizeof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop) == 0x0000A0, "Wrong size on BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, EntryPoint) == 0x000000, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000006, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, Temp_bool_Has_Been_Initd_Variable_1) == 0x000007, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_FClamp_ReturnValue) == 0x000018, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_GetFloatValue_ReturnValue) == 0x000020, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_SelectFloat_ReturnValue) == 0x000028, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x000038, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_FClamp_ReturnValue_1) == 0x000050, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_SelectFloat_ReturnValue_1) == 0x000058, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_GetFloatValue_ReturnValue_1) == 0x000060, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, K2Node_Event_DeltaSecond) == 0x000070, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::K2Node_Event_DeltaSecond' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, Temp_bool_IsClosed_Variable_1) == 0x000078, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x00007C, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000088, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_GetFloatValue_InTime_ImplicitCast_1) == 0x00008C, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_GetFloatValue_InTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000090, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000098, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_ExecuteUbergraph_BP_SkillEffect_Unique_Alpaca_Loop::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");

// Function BP_SkillEffect_Unique_Alpaca_Loop.BP_SkillEffect_Unique_Alpaca_Loop_C.FadeOutEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_SkillEffect_Unique_Alpaca_Loop_C_FadeOutEffect final
{
public:
	double                                        DeltaSecond;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_Alpaca_Loop_C_FadeOutEffect) == 0x000008, "Wrong alignment on BP_SkillEffect_Unique_Alpaca_Loop_C_FadeOutEffect");
static_assert(sizeof(BP_SkillEffect_Unique_Alpaca_Loop_C_FadeOutEffect) == 0x000008, "Wrong size on BP_SkillEffect_Unique_Alpaca_Loop_C_FadeOutEffect");
static_assert(offsetof(BP_SkillEffect_Unique_Alpaca_Loop_C_FadeOutEffect, DeltaSecond) == 0x000000, "Member 'BP_SkillEffect_Unique_Alpaca_Loop_C_FadeOutEffect::DeltaSecond' has a wrong offset!");

}

