#pragma once

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace PalServer::Params
{

// Function WBP_IngameMenu_RepairButton.WBP_IngameMenu_RepairButton_C.BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_IngameMenu_RepairButton.WBP_IngameMenu_RepairButton_C.BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_IngameMenu_RepairButton.WBP_IngameMenu_RepairButton_C.BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_IngameMenu_RepairButton_C_BndEvt__WBP_IngameMenu_RepairButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_IngameMenu_RepairButton.WBP_IngameMenu_RepairButton_C.ExecuteUbergraph_WBP_IngameMenu_RepairButton
// 0x0030 (0x0030 - 0x0000)
struct WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton) == 0x000008, "Wrong alignment on WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton");
static_assert(sizeof(WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton) == 0x000030, "Wrong size on WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton, EntryPoint) == 0x000000, "Member 'WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton, K2Node_ComponentBoundEvent_Button_2) == 0x000018, "Member 'WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton, K2Node_ComponentBoundEvent_Button_1) == 0x000020, "Member 'WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton, K2Node_ComponentBoundEvent_Button) == 0x000028, "Member 'WBP_IngameMenu_RepairButton_C_ExecuteUbergraph_WBP_IngameMenu_RepairButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_IngameMenu_RepairButton.WBP_IngameMenu_RepairButton_C.SetEnableButton
// 0x0018 (0x0018 - 0x0000)
struct WBP_IngameMenu_RepairButton_C_SetEnableButton final
{
public:
	bool                                          IsEnableButton;                                    // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_RepairButton_C_SetEnableButton) == 0x000008, "Wrong alignment on WBP_IngameMenu_RepairButton_C_SetEnableButton");
static_assert(sizeof(WBP_IngameMenu_RepairButton_C_SetEnableButton) == 0x000018, "Wrong size on WBP_IngameMenu_RepairButton_C_SetEnableButton");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_SetEnableButton, IsEnableButton) == 0x000000, "Member 'WBP_IngameMenu_RepairButton_C_SetEnableButton::IsEnableButton' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_SetEnableButton, Temp_bool_Variable) == 0x000001, "Member 'WBP_IngameMenu_RepairButton_C_SetEnableButton::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_SetEnableButton, Temp_byte_Variable) == 0x000002, "Member 'WBP_IngameMenu_RepairButton_C_SetEnableButton::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_SetEnableButton, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_IngameMenu_RepairButton_C_SetEnableButton::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_SetEnableButton, K2Node_Select_Default) == 0x000004, "Member 'WBP_IngameMenu_RepairButton_C_SetEnableButton::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_SetEnableButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_IngameMenu_RepairButton_C_SetEnableButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_RepairButton_C_SetEnableButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_IngameMenu_RepairButton_C_SetEnableButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");

}

