#pragma once

#include "Basic.hpp"


namespace PalServer::Params
{

// Function WBP_WorldMap_Icon_Respawn.WBP_WorldMap_Icon_Respawn_C.BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_WorldMap_Icon_Respawn.WBP_WorldMap_Icon_Respawn_C.BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_WorldMap_Icon_Respawn.WBP_WorldMap_Icon_Respawn_C.BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_WorldMap_Icon_Respawn_C_BndEvt__WBP_WorldMap_Icon_Respawn_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_WorldMap_Icon_Respawn.WBP_WorldMap_Icon_Respawn_C.ExecuteUbergraph_WBP_WorldMap_Icon_Respawn
// 0x0028 (0x0028 - 0x0000)
struct WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn) == 0x000008, "Wrong alignment on WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn");
static_assert(sizeof(WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn) == 0x000028, "Wrong size on WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn");
static_assert(offsetof(WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn, EntryPoint) == 0x000000, "Member 'WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn, K2Node_ComponentBoundEvent_Button_2) == 0x000008, "Member 'WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn, K2Node_ComponentBoundEvent_Button_1) == 0x000010, "Member 'WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn, CallFunc_PlayAnimation_ReturnValue) == 0x000020, "Member 'WBP_WorldMap_Icon_Respawn_C_ExecuteUbergraph_WBP_WorldMap_Icon_Respawn::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_WorldMap_Icon_Respawn.WBP_WorldMap_Icon_Respawn_C.Setup_Internal
// 0x0018 (0x0018 - 0x0000)
struct WBP_WorldMap_Icon_Respawn_C_Setup_Internal final
{
public:
	class UPalLocationPoint*                      LocationPoint;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalLocationPoint_Respawn*              K2Node_DynamicCast_AsPal_Location_Point_Respawn;   // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_WorldMap_Icon_Respawn_C_Setup_Internal) == 0x000008, "Wrong alignment on WBP_WorldMap_Icon_Respawn_C_Setup_Internal");
static_assert(sizeof(WBP_WorldMap_Icon_Respawn_C_Setup_Internal) == 0x000018, "Wrong size on WBP_WorldMap_Icon_Respawn_C_Setup_Internal");
static_assert(offsetof(WBP_WorldMap_Icon_Respawn_C_Setup_Internal, LocationPoint) == 0x000000, "Member 'WBP_WorldMap_Icon_Respawn_C_Setup_Internal::LocationPoint' has a wrong offset!");
static_assert(offsetof(WBP_WorldMap_Icon_Respawn_C_Setup_Internal, K2Node_DynamicCast_AsPal_Location_Point_Respawn) == 0x000008, "Member 'WBP_WorldMap_Icon_Respawn_C_Setup_Internal::K2Node_DynamicCast_AsPal_Location_Point_Respawn' has a wrong offset!");
static_assert(offsetof(WBP_WorldMap_Icon_Respawn_C_Setup_Internal, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'WBP_WorldMap_Icon_Respawn_C_Setup_Internal::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

