#pragma once

#include "Basic.hpp"

#include "EPalCaptureReticleSeqence_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "EPalSphereCaptureFailedReason_structs.hpp"
#include "Pal_structs.hpp"
#include "E_PalCaptureSphereBouncedReason_structs.hpp"
#include "SlateCore_structs.hpp"


namespace PalServer::Params
{

// Function WBP_CaptureReticle.WBP_CaptureReticle_C.CalcCaptureSuccessRate
// 0x0048 (0x0048 - 0x0000)
struct WBP_CaptureReticle_C_CalcCaptureSuccessRate final
{
public:
	TArray<double>                                RateArray;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	double                                        SuccessRate;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        TmpRate;                                           // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CaptureReticle_C_CalcCaptureSuccessRate) == 0x000008, "Wrong alignment on WBP_CaptureReticle_C_CalcCaptureSuccessRate");
static_assert(sizeof(WBP_CaptureReticle_C_CalcCaptureSuccessRate) == 0x000048, "Wrong size on WBP_CaptureReticle_C_CalcCaptureSuccessRate");
static_assert(offsetof(WBP_CaptureReticle_C_CalcCaptureSuccessRate, RateArray) == 0x000000, "Member 'WBP_CaptureReticle_C_CalcCaptureSuccessRate::RateArray' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_CalcCaptureSuccessRate, SuccessRate) == 0x000010, "Member 'WBP_CaptureReticle_C_CalcCaptureSuccessRate::SuccessRate' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_CalcCaptureSuccessRate, TmpRate) == 0x000018, "Member 'WBP_CaptureReticle_C_CalcCaptureSuccessRate::TmpRate' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_CalcCaptureSuccessRate, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'WBP_CaptureReticle_C_CalcCaptureSuccessRate::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_CalcCaptureSuccessRate, Temp_int_Array_Index_Variable) == 0x000024, "Member 'WBP_CaptureReticle_C_CalcCaptureSuccessRate::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_CalcCaptureSuccessRate, Temp_int_Loop_Counter_Variable) == 0x000028, "Member 'WBP_CaptureReticle_C_CalcCaptureSuccessRate::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_CalcCaptureSuccessRate, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_CaptureReticle_C_CalcCaptureSuccessRate::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_CalcCaptureSuccessRate, CallFunc_Less_IntInt_ReturnValue) == 0x000038, "Member 'WBP_CaptureReticle_C_CalcCaptureSuccessRate::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_CalcCaptureSuccessRate, CallFunc_Add_IntInt_ReturnValue) == 0x00003C, "Member 'WBP_CaptureReticle_C_CalcCaptureSuccessRate::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_CalcCaptureSuccessRate, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'WBP_CaptureReticle_C_CalcCaptureSuccessRate::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");

// Function WBP_CaptureReticle.WBP_CaptureReticle_C.ChangeSeqence
// 0x0005 (0x0005 - 0x0000)
struct WBP_CaptureReticle_C_ChangeSeqence final
{
public:
	EPalCaptureReticleSeqence                     NewSeqence;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CaptureReticle_C_ChangeSeqence) == 0x000001, "Wrong alignment on WBP_CaptureReticle_C_ChangeSeqence");
static_assert(sizeof(WBP_CaptureReticle_C_ChangeSeqence) == 0x000005, "Wrong size on WBP_CaptureReticle_C_ChangeSeqence");
static_assert(offsetof(WBP_CaptureReticle_C_ChangeSeqence, NewSeqence) == 0x000000, "Member 'WBP_CaptureReticle_C_ChangeSeqence::NewSeqence' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ChangeSeqence, K2Node_SwitchEnum_CmpSuccess) == 0x000001, "Member 'WBP_CaptureReticle_C_ChangeSeqence::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ChangeSeqence, K2Node_SwitchEnum_CmpSuccess_1) == 0x000002, "Member 'WBP_CaptureReticle_C_ChangeSeqence::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ChangeSeqence, K2Node_SwitchEnum_CmpSuccess_2) == 0x000003, "Member 'WBP_CaptureReticle_C_ChangeSeqence::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ChangeSeqence, K2Node_SwitchEnum_CmpSuccess_3) == 0x000004, "Member 'WBP_CaptureReticle_C_ChangeSeqence::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");

// Function WBP_CaptureReticle.WBP_CaptureReticle_C.DisplayCaptureFailedLog
// 0x0188 (0x0188 - 0x0000)
struct WBP_CaptureReticle_C_DisplayCaptureFailedLog final
{
public:
	class UPalIndividualCharacterHandle*          TargetHandle;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalTutorialManager*                    CallFunc_GetTutorialManager_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_TryGetIndividualActor_ReturnValue;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x3];                                       // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetLevel_ReturnValue;                     // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetNickName_outName;                      // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0058(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x00A8(0x0050)(HasGetValueTypeHash)
	class UPalLogManager*                         CallFunc_GetLogManager_ReturnValue;                // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0100(0x0010)(ReferenceParm)
	class FText                                   CallFunc_CreateLogText_outText;                    // 0x0110(0x0018)()
	struct FPalLogAdditionalData                  K2Node_MakeStruct_PalLogAdditionalData;            // 0x0128(0x0038)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0160(0x0018)()
	struct FGuid                                  CallFunc_AddLog_ReturnValue;                       // 0x0178(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CaptureReticle_C_DisplayCaptureFailedLog) == 0x000008, "Wrong alignment on WBP_CaptureReticle_C_DisplayCaptureFailedLog");
static_assert(sizeof(WBP_CaptureReticle_C_DisplayCaptureFailedLog) == 0x000188, "Wrong size on WBP_CaptureReticle_C_DisplayCaptureFailedLog");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, TargetHandle) == 0x000000, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::TargetHandle' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, CallFunc_GetTutorialManager_ReturnValue) == 0x000008, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::CallFunc_GetTutorialManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, CallFunc_TryGetIndividualActor_ReturnValue) == 0x000018, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::CallFunc_TryGetIndividualActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, CallFunc_IsValid_ReturnValue_1) == 0x000020, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, CallFunc_GetLevel_ReturnValue) == 0x000024, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::CallFunc_GetLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, CallFunc_GetNickName_outName) == 0x000028, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::CallFunc_GetNickName_outName' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000038, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, K2Node_MakeStruct_FormatArgumentData) == 0x000058, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, K2Node_MakeStruct_FormatArgumentData_1) == 0x0000A8, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, CallFunc_GetLogManager_ReturnValue) == 0x0000F8, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::CallFunc_GetLogManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, K2Node_MakeArray_Array) == 0x000100, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, CallFunc_CreateLogText_outText) == 0x000110, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::CallFunc_CreateLogText_outText' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, K2Node_MakeStruct_PalLogAdditionalData) == 0x000128, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::K2Node_MakeStruct_PalLogAdditionalData' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, CallFunc_Format_ReturnValue) == 0x000160, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_DisplayCaptureFailedLog, CallFunc_AddLog_ReturnValue) == 0x000178, "Member 'WBP_CaptureReticle_C_DisplayCaptureFailedLog::CallFunc_AddLog_ReturnValue' has a wrong offset!");

// Function WBP_CaptureReticle.WBP_CaptureReticle_C.ExecuteUbergraph_WBP_CaptureReticle
// 0x0138 (0x0138 - 0x0000)
struct WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalMonsterCharacter*                   K2Node_DynamicCast_AsPal_Monster_Character;        // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalMonsterCharacter*                   CallFunc_FindTargetCharacter_targetMonster;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class APalMonsterCharacter>    CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0030(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	class UPalCharacterParameterComponent*        CallFunc_GetCharacterParameterComponent_ReturnValue; // 0x0060(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalTribeID                                   CallFunc_GetTribeID_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0070(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBonusEnabled_enabled;                   // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_BoolBool_ReturnValue;            // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DA[0x6];                                       // 0x00DA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalPlayerRecordData*                   CallFunc_GetLocalRecordData_ReturnValue;           // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1; // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRecordData_TribeIdCount_ReturnValue;   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APalWeaponBase*                         K2Node_DynamicCast_AsPal_Weapon_Base;              // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue_1; // 0x0111(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_112[0x2];                                      // 0x0112(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRecordData_TribeIdCount_ReturnValue_1; // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int64                                         CallFunc_Conv_IntToInt64_ReturnValue;              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Min_ReturnValue;                          // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_Int64Int64_ReturnValue;           // 0x0124(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ContainsRecordData_TribeIdCount_ReturnValue; // 0x0125(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_126[0x2];                                      // 0x0126(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateFailedWidgets_DeltaTime_ImplicitCast; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle) == 0x000008, "Wrong alignment on WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle");
static_assert(sizeof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle) == 0x000138, "Wrong size on WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, EntryPoint) == 0x000000, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000008, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000010, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, K2Node_DynamicCast_AsPal_Monster_Character) == 0x000018, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::K2Node_DynamicCast_AsPal_Monster_Character' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_FindTargetCharacter_targetMonster) == 0x000028, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_FindTargetCharacter_targetMonster' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000030, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_GetCharacterParameterComponent_ReturnValue) == 0x000060, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_GetCharacterParameterComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000068, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_IsValid_ReturnValue) == 0x000069, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_GetTribeID_ReturnValue) == 0x00006A, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_GetTribeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_IsValid_ReturnValue_1) == 0x00006B, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, K2Node_Event_MyGeometry) == 0x000070, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, K2Node_Event_InDeltaTime) == 0x0000B0, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_GetPalmi_ReturnValue) == 0x0000B8, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000C0, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_IsBonusEnabled_enabled) == 0x0000D8, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_IsBonusEnabled_enabled' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_NotEqual_BoolBool_ReturnValue) == 0x0000D9, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_NotEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_Add_DoubleDouble_ReturnValue) == 0x0000E0, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_GetLocalRecordData_ReturnValue) == 0x0000F0, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_GetLocalRecordData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1) == 0x0000F8, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_GetRecordData_TribeIdCount_ReturnValue) == 0x000100, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_GetRecordData_TribeIdCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, K2Node_DynamicCast_AsPal_Weapon_Base) == 0x000108, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::K2Node_DynamicCast_AsPal_Weapon_Base' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, K2Node_DynamicCast_bSuccess_1) == 0x000110, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_IsValidSoftObjectReference_ReturnValue_1) == 0x000111, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_IsValidSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_GetRecordData_TribeIdCount_ReturnValue_1) == 0x000114, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_GetRecordData_TribeIdCount_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_Conv_IntToInt64_ReturnValue) == 0x000118, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_Conv_IntToInt64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_Min_ReturnValue) == 0x000120, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_Min_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_Greater_Int64Int64_ReturnValue) == 0x000124, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_Greater_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_ContainsRecordData_TribeIdCount_ReturnValue) == 0x000125, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_ContainsRecordData_TribeIdCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_UpdateFailedWidgets_DeltaTime_ImplicitCast) == 0x000128, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_UpdateFailedWidgets_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000130, "Member 'WBP_CaptureReticle_C_ExecuteUbergraph_WBP_CaptureReticle::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");

// Function WBP_CaptureReticle.WBP_CaptureReticle_C.FindTargetCharacter
// 0x0328 (0x0328 - 0x0000)
struct WBP_CaptureReticle_C_FindTargetCharacter final
{
public:
	class APalMonsterCharacter*                   TargetMonster;                                     // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         IgnoreActors;                                      // 0x0008(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldReticleDIsplay_ShouldDisplay;       // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<TSoftObjectPtr<class ABP_PalCaptureBodyBase_C>> CallFunc_Map_Keys_Keys;                            // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class ABP_PalCaptureBodyBase_C> CallFunc_Array_Get_Item;                           // 0x0040(0x0030)(HasGetValueTypeHash)
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PalCaptureBodyBase_C*               K2Node_DynamicCast_AsBP_Pal_Capture_Body_Base;     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterHandle*          CallFunc_GetTargetHandle_targetHandle;             // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9E[0x2];                                       // 0x009E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_TryGetIndividualActor_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x3];                                       // 0x00A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_144[0x4];                                      // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_CapsuleTraceSingleForObjects_OutHit;      // 0x0148(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_CapsuleTraceSingleForObjects_ReturnValue; // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_233[0x1];                                      // 0x0233(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0234(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0238(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_23C[0x4];                                      // 0x023C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0240(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0258(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0270(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0288(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x02A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x02A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x02B0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x02B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_BoneName;                  // 0x02C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x02C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_ElementIndex;              // 0x02CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D4[0x4];                                      // 0x02D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x02D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x02F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalMonsterCharacter*                   K2Node_DynamicCast_AsPal_Monster_Character;        // 0x0308(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0310(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0311(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_312[0x6];                                      // 0x0312(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue;                  // 0x0318(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsVisible_ReturnValue;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFriend_ReturnValue;                     // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_CaptureReticle_C_FindTargetCharacter) == 0x000008, "Wrong alignment on WBP_CaptureReticle_C_FindTargetCharacter");
static_assert(sizeof(WBP_CaptureReticle_C_FindTargetCharacter) == 0x000328, "Wrong size on WBP_CaptureReticle_C_FindTargetCharacter");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, TargetMonster) == 0x000000, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::TargetMonster' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, IgnoreActors) == 0x000008, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::IgnoreActors' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, Temp_int_Array_Index_Variable) == 0x000018, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_ShouldReticleDIsplay_ShouldDisplay) == 0x00001C, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_ShouldReticleDIsplay_ShouldDisplay' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, Temp_int_Loop_Counter_Variable) == 0x000020, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_Map_Keys_Keys) == 0x000028, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_Add_IntInt_ReturnValue) == 0x000038, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000070, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000078, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, K2Node_DynamicCast_AsBP_Pal_Capture_Body_Base) == 0x000080, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::K2Node_DynamicCast_AsBP_Pal_Capture_Body_Base' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_GetTargetHandle_targetHandle) == 0x000090, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_GetTargetHandle_targetHandle' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_IsValid_ReturnValue) == 0x00009C, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_Less_IntInt_ReturnValue) == 0x00009D, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_TryGetIndividualActor_ReturnValue) == 0x0000A0, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_TryGetIndividualActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_IsValid_ReturnValue_1) == 0x0000A8, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_Array_Add_ReturnValue) == 0x0000AC, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_GetPalmi_ReturnValue) == 0x0000B0, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_IsValid_ReturnValue_2) == 0x0000B8, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_GetCameraRotation_ReturnValue) == 0x0000C0, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_GetForwardVector_ReturnValue) == 0x0000D8, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_GetCameraLocation_ReturnValue) == 0x0000F0, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000108, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_K2_GetPawn_ReturnValue) == 0x000120, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_Add_VectorVector_ReturnValue) == 0x000128, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_Array_Add_ReturnValue_1) == 0x000140, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_CapsuleTraceSingleForObjects_OutHit) == 0x000148, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_CapsuleTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_CapsuleTraceSingleForObjects_ReturnValue) == 0x000230, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_CapsuleTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_bBlockingHit) == 0x000231, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_bInitialOverlap) == 0x000232, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_Time) == 0x000234, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_Distance) == 0x000238, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_Location) == 0x000240, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_ImpactPoint) == 0x000258, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_Normal) == 0x000270, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_ImpactNormal) == 0x000288, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_PhysMat) == 0x0002A0, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_HitActor) == 0x0002A8, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_HitComponent) == 0x0002B0, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_HitBoneName) == 0x0002B8, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_BoneName) == 0x0002C0, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_BoneName' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_HitItem) == 0x0002C8, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_ElementIndex) == 0x0002CC, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_ElementIndex' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_FaceIndex) == 0x0002D0, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_TraceStart) == 0x0002D8, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_BreakHitResult_TraceEnd) == 0x0002F0, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, K2Node_DynamicCast_AsPal_Monster_Character) == 0x000308, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::K2Node_DynamicCast_AsPal_Monster_Character' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, K2Node_DynamicCast_bSuccess_1) == 0x000310, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_IsDead_ReturnValue) == 0x000311, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_GetMainMesh_ReturnValue) == 0x000318, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_GetMainMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_IsVisible_ReturnValue) == 0x000320, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_IsVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_CaptureReticle_C_FindTargetCharacter, CallFunc_IsFriend_ReturnValue) == 0x000321, "Member 'WBP_CaptureReticle_C_FindTargetCharacter::CallFunc_IsFriend_ReturnValue' has a wrong offset!");

// Function WBP_CaptureReticle.WBP_CaptureReticle_C.Get Display Rate
// 0x01A8 (0x01A8 - 0x0000)
struct WBP_CaptureReticle_C_Get_Display_Rate final
{
public:
	class APalWeaponBase*                         CaptureItemActor;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalMonsterCharacter*                   TargetMonster;                                     // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        Rate;                                              // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSneakBonus;                                      // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalWeaponBase*                         TempWeaponBase;                                    // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterParameterComponent*        CallFunc_GetCharacterParameterComponent_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class ABP_CapturePrism_C*                     K2Node_DynamicCast_AsBP_Capture_Prism;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetCaptureLevel_level;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HomingSphereLauncher_C*             K2Node_DynamicCast_AsBP_Homing_Sphere_Launcher;    // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x3];                                       // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SphereLauncher_C*                   K2Node_DynamicCast_AsBP_Sphere_Launcher;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue_1;                   // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalInstanceID                         CallFunc_GetIndividualIDByActor_ReturnValue;       // 0x0070(0x0030)(HasGetValueTypeHash)
	TMap<class FName, class APalWeaponBase*>      CallFunc_GetPalSphereActorMap_ReturnValue;         // 0x00A0(0x0050)()
