#pragma once

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace PalServer::Params
{

// Function WBP_MapMarker_Content.WBP_MapMarker_Content_C.BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MapMarker_Content.WBP_MapMarker_Content_C.BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MapMarker_Content.WBP_MapMarker_Content_C.BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MapMarker_Content_C_BndEvt__WBP_MapMarker_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MapMarker_Content.WBP_MapMarker_Content_C.ExecuteUbergraph_WBP_MapMarker_Content
// 0x0048 (0x0048 - 0x0000)
struct WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_index;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_CustomEvent_Texture;                        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsSelected;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content) == 0x000008, "Wrong alignment on WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content");
static_assert(sizeof(WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content) == 0x000048, "Wrong size on WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content");
static_assert(offsetof(WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content, EntryPoint) == 0x000000, "Member 'WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content, Temp_bool_Variable) == 0x000004, "Member 'WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content, Temp_byte_Variable) == 0x000005, "Member 'WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content, K2Node_ComponentBoundEvent_Button_2) == 0x000008, "Member 'WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content, K2Node_ComponentBoundEvent_Button_1) == 0x000010, "Member 'WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content, K2Node_CustomEvent_index) == 0x000020, "Member 'WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content::K2Node_CustomEvent_index' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content, K2Node_CustomEvent_Texture) == 0x000028, "Member 'WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content::K2Node_CustomEvent_Texture' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content, K2Node_CustomEvent_IsSelected) == 0x000030, "Member 'WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content::K2Node_CustomEvent_IsSelected' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000038, "Member 'WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content, K2Node_Select_Default) == 0x000040, "Member 'WBP_MapMarker_Content_C_ExecuteUbergraph_WBP_MapMarker_Content::K2Node_Select_Default' has a wrong offset!");

// Function WBP_MapMarker_Content.WBP_MapMarker_Content_C.OnClicked__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_MapMarker_Content_C_OnClicked__DelegateSignature final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Content_C_OnClicked__DelegateSignature) == 0x000004, "Wrong alignment on WBP_MapMarker_Content_C_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_MapMarker_Content_C_OnClicked__DelegateSignature) == 0x000004, "Wrong size on WBP_MapMarker_Content_C_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_MapMarker_Content_C_OnClicked__DelegateSignature, Index_0) == 0x000000, "Member 'WBP_MapMarker_Content_C_OnClicked__DelegateSignature::Index_0' has a wrong offset!");

// Function WBP_MapMarker_Content.WBP_MapMarker_Content_C.SetIndex
// 0x0010 (0x0010 - 0x0000)
struct WBP_MapMarker_Content_C_SetIndex final
{
public:
	int32                                         Index_0;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Texture;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Content_C_SetIndex) == 0x000008, "Wrong alignment on WBP_MapMarker_Content_C_SetIndex");
static_assert(sizeof(WBP_MapMarker_Content_C_SetIndex) == 0x000010, "Wrong size on WBP_MapMarker_Content_C_SetIndex");
static_assert(offsetof(WBP_MapMarker_Content_C_SetIndex, Index_0) == 0x000000, "Member 'WBP_MapMarker_Content_C_SetIndex::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_MapMarker_Content_C_SetIndex, Texture) == 0x000008, "Member 'WBP_MapMarker_Content_C_SetIndex::Texture' has a wrong offset!");

// Function WBP_MapMarker_Content.WBP_MapMarker_Content_C.SetSelected
// 0x0001 (0x0001 - 0x0000)
struct WBP_MapMarker_Content_C_SetSelected final
{
public:
	bool                                          IsSelected;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapMarker_Content_C_SetSelected) == 0x000001, "Wrong alignment on WBP_MapMarker_Content_C_SetSelected");
static_assert(sizeof(WBP_MapMarker_Content_C_SetSelected) == 0x000001, "Wrong size on WBP_MapMarker_Content_C_SetSelected");
static_assert(offsetof(WBP_MapMarker_Content_C_SetSelected, IsSelected) == 0x000000, "Member 'WBP_MapMarker_Content_C_SetSelected::IsSelected' has a wrong offset!");

}

