#pragma once

#include "Basic.hpp"


namespace PalServer::Params
{

// Function BP_BuildObject_CharacterSkinChange.BP_BuildObject_CharacterSkinChange_C.ExecuteUbergraph_BP_BuildObject_CharacterSkinChange
// 0x0004 (0x0004 - 0x0000)
struct BP_BuildObject_CharacterSkinChange_C_ExecuteUbergraph_BP_BuildObject_CharacterSkinChange final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildObject_CharacterSkinChange_C_ExecuteUbergraph_BP_BuildObject_CharacterSkinChange) == 0x000004, "Wrong alignment on BP_BuildObject_CharacterSkinChange_C_ExecuteUbergraph_BP_BuildObject_CharacterSkinChange");
static_assert(sizeof(BP_BuildObject_CharacterSkinChange_C_ExecuteUbergraph_BP_BuildObject_CharacterSkinChange) == 0x000004, "Wrong size on BP_BuildObject_CharacterSkinChange_C_ExecuteUbergraph_BP_BuildObject_CharacterSkinChange");
static_assert(offsetof(BP_BuildObject_CharacterSkinChange_C_ExecuteUbergraph_BP_BuildObject_CharacterSkinChange, EntryPoint) == 0x000000, "Member 'BP_BuildObject_CharacterSkinChange_C_ExecuteUbergraph_BP_BuildObject_CharacterSkinChange::EntryPoint' has a wrong offset!");

// Function BP_BuildObject_CharacterSkinChange.BP_BuildObject_CharacterSkinChange_C.SetActiveInternal
// 0x0001 (0x0001 - 0x0000)
struct BP_BuildObject_CharacterSkinChange_C_SetActiveInternal final
{
public:
	bool                                          On;                                                // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildObject_CharacterSkinChange_C_SetActiveInternal) == 0x000001, "Wrong alignment on BP_BuildObject_CharacterSkinChange_C_SetActiveInternal");
static_assert(sizeof(BP_BuildObject_CharacterSkinChange_C_SetActiveInternal) == 0x000001, "Wrong size on BP_BuildObject_CharacterSkinChange_C_SetActiveInternal");
static_assert(offsetof(BP_BuildObject_CharacterSkinChange_C_SetActiveInternal, On) == 0x000000, "Member 'BP_BuildObject_CharacterSkinChange_C_SetActiveInternal::On' has a wrong offset!");

}

