#pragma once

#include "Basic.hpp"

#include "BP_SquadNPCSpawner_ForCampBase_classes.hpp"


namespace PalServer
{

// BlueprintGeneratedClass BP_SquadNPCSpawner_ForCamp_Hunter_Grass.BP_SquadNPCSpawner_ForCamp_Hunter_Grass_C
// 0x0050 (0x04D0 - 0x0480)
class ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C final : public ABP_SquadNPCSpawner_ForCampBase_C
{
public:
	class UBP_NPCPathWalkPointComponent_1_C*      BP_NPCPathWalkPointComponent_1;                    // 0x0480(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCPathWalkPointComponent_1_C*      BP_NPCPathWalkPointComponent_6;                    // 0x0488(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCPathWalkPointComponent_1_C*      BP_NPCPathWalkPointComponent_5;                    // 0x0490(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCPathWalkPointComponent_1_C*      BP_NPCPathWalkPointComponent_4;                    // 0x0498(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCPathWalkPointComponent_1_C*      BP_NPCPathWalkPointComponent_3;                    // 0x04A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCPathWalkPointComponent_1_C*      BP_NPCPathWalkPointComponent_2;                    // 0x04A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCSpawnPointComponent_C*           BP_NPCSpawnPointComponent3;                        // 0x04B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCSpawnPointComponent_C*           BP_NPCSpawnPointComponent2;                        // 0x04B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCSpawnPointComponent_C*           BP_NPCSpawnPointComponent1;                        // 0x04C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_NPCSpawnPointComponent_C*           BP_NPCSpawnPointComponent;                         // 0x04C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SquadNPCSpawner_ForCamp_Hunter_Grass_C">();
	}
	static class ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C>();
	}
};
static_assert(alignof(ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C) == 0x000008, "Wrong alignment on ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C");
static_assert(sizeof(ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C) == 0x0004D0, "Wrong size on ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C");
static_assert(offsetof(ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C, BP_NPCPathWalkPointComponent_1) == 0x000480, "Member 'ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C::BP_NPCPathWalkPointComponent_1' has a wrong offset!");
static_assert(offsetof(ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C, BP_NPCPathWalkPointComponent_6) == 0x000488, "Member 'ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C::BP_NPCPathWalkPointComponent_6' has a wrong offset!");
static_assert(offsetof(ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C, BP_NPCPathWalkPointComponent_5) == 0x000490, "Member 'ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C::BP_NPCPathWalkPointComponent_5' has a wrong offset!");
static_assert(offsetof(ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C, BP_NPCPathWalkPointComponent_4) == 0x000498, "Member 'ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C::BP_NPCPathWalkPointComponent_4' has a wrong offset!");
static_assert(offsetof(ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C, BP_NPCPathWalkPointComponent_3) == 0x0004A0, "Member 'ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C::BP_NPCPathWalkPointComponent_3' has a wrong offset!");
static_assert(offsetof(ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C, BP_NPCPathWalkPointComponent_2) == 0x0004A8, "Member 'ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C::BP_NPCPathWalkPointComponent_2' has a wrong offset!");
static_assert(offsetof(ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C, BP_NPCSpawnPointComponent3) == 0x0004B0, "Member 'ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C::BP_NPCSpawnPointComponent3' has a wrong offset!");
static_assert(offsetof(ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C, BP_NPCSpawnPointComponent2) == 0x0004B8, "Member 'ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C::BP_NPCSpawnPointComponent2' has a wrong offset!");
static_assert(offsetof(ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C, BP_NPCSpawnPointComponent1) == 0x0004C0, "Member 'ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C::BP_NPCSpawnPointComponent1' has a wrong offset!");
static_assert(offsetof(ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C, BP_NPCSpawnPointComponent) == 0x0004C8, "Member 'ABP_SquadNPCSpawner_ForCamp_Hunter_Grass_C::BP_NPCSpawnPointComponent' has a wrong offset!");

}

