#pragma once

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace PalServer::Params
{

// Function BP_SkillEffect_IceBlade.BP_SkillEffect_IceBlade_C.BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature
// 0x0118 (0x0118 - 0x0000)
struct BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    HitComponent;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NormalImpulse;                                     // 0x0018(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             Hit;                                               // 0x0030(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(sizeof(BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature) == 0x000118, "Wrong size on BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, HitComponent) == 0x000000, "Member 'BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::HitComponent' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, NormalImpulse) == 0x000018, "Member 'BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature, Hit) == 0x000030, "Member 'BP_SkillEffect_IceBlade_C_BndEvt__BP_SkillEffect_WindCutter_MovementSphereRoot_K2Node_ComponentBoundEvent_0_ComponentHitSignature__DelegateSignature::Hit' has a wrong offset!");

// Function BP_SkillEffect_IceBlade.BP_SkillEffect_IceBlade_C.ExecuteUbergraph_BP_SkillEffect_IceBlade
// 0x0218 (0x0218 - 0x0000)
struct BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_52[0x6];                                       // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_HitComponent;           // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_ComponentBoundEvent_NormalImpulse;          // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_ComponentBoundEvent_Hit;                    // 0x00C0(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class USphereComponent*                       CallFunc_Array_Get_Item;                           // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x01B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x01B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B5[0x3];                                      // 0x01B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x01B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x01C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_DeltaSecond;                          // 0x01D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CallFunc_Array_Get_Item_1;                         // 0x01D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x01E5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1E6[0x2];                                      // 0x01E6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1EC[0x4];                                      // 0x01EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x01F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x01F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_1;      // 0x01FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0208(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x020C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_2;  // 0x0214(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade) == 0x000008, "Wrong alignment on BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade");
static_assert(sizeof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade) == 0x000218, "Wrong size on BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, EntryPoint) == 0x000000, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, Temp_int_Array_Index_Variable) == 0x00000C, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000010, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, Temp_int_Loop_Counter_Variable_1) == 0x000014, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Add_IntInt_ReturnValue_1) == 0x000018, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, Temp_int_Array_Index_Variable_1) == 0x00001C, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000020, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_SelectFloat_ReturnValue) == 0x000030, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_FClamp_ReturnValue) == 0x000038, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, Temp_bool_Has_Been_Initd_Variable) == 0x000040, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_GetFloatValue_ReturnValue) == 0x000044, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, Temp_bool_IsClosed_Variable) == 0x000050, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, Temp_bool_Has_Been_Initd_Variable_1) == 0x000051, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000058, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x000060, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000068, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_FClamp_ReturnValue_1) == 0x000070, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_GetFloatValue_ReturnValue_1) == 0x000078, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_SelectFloat_ReturnValue_1) == 0x000080, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000088, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, K2Node_ComponentBoundEvent_HitComponent) == 0x000090, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::K2Node_ComponentBoundEvent_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, K2Node_ComponentBoundEvent_OtherActor) == 0x000098, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, K2Node_ComponentBoundEvent_OtherComp) == 0x0000A0, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, K2Node_ComponentBoundEvent_NormalImpulse) == 0x0000A8, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::K2Node_ComponentBoundEvent_NormalImpulse' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, K2Node_ComponentBoundEvent_Hit) == 0x0000C0, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::K2Node_ComponentBoundEvent_Hit' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Array_Get_Item) == 0x0001A8, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Array_Length_ReturnValue) == 0x0001B0, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Less_IntInt_ReturnValue) == 0x0001B4, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, K2Node_CreateDelegate_OutputDelegate) == 0x0001B8, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0001C8, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, K2Node_Event_DeltaSecond) == 0x0001D0, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::K2Node_Event_DeltaSecond' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Array_Get_Item_1) == 0x0001D8, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Array_Length_ReturnValue_1) == 0x0001E0, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Less_IntInt_ReturnValue_1) == 0x0001E4, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, Temp_bool_IsClosed_Variable_1) == 0x0001E5, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x0001E8, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0001F0, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x0001F8, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_GetFloatValue_InTime_ImplicitCast_1) == 0x0001FC, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_GetFloatValue_InTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000200, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000208, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x00020C, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_Delay_Duration_ImplicitCast) == 0x000210, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade, CallFunc_SetVariableFloat_InValue_ImplicitCast_2) == 0x000214, "Member 'BP_SkillEffect_IceBlade_C_ExecuteUbergraph_BP_SkillEffect_IceBlade::CallFunc_SetVariableFloat_InValue_ImplicitCast_2' has a wrong offset!");

// Function BP_SkillEffect_IceBlade.BP_SkillEffect_IceBlade_C.FadeOutEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_SkillEffect_IceBlade_C_FadeOutEffect final
{
public:
	double                                        DeltaSecond;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_IceBlade_C_FadeOutEffect) == 0x000008, "Wrong alignment on BP_SkillEffect_IceBlade_C_FadeOutEffect");
static_assert(sizeof(BP_SkillEffect_IceBlade_C_FadeOutEffect) == 0x000008, "Wrong size on BP_SkillEffect_IceBlade_C_FadeOutEffect");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_FadeOutEffect, DeltaSecond) == 0x000000, "Member 'BP_SkillEffect_IceBlade_C_FadeOutEffect::DeltaSecond' has a wrong offset!");

// Function BP_SkillEffect_IceBlade.BP_SkillEffect_IceBlade_C.UserConstructionScript
// 0x02E0 (0x02E0 - 0x0000)
struct BP_SkillEffect_IceBlade_C_UserConstructionScript final
{
public:
	double                                        Degree;                                            // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x3];                                       // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_SelectVector_ReturnValue;                 // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0xC];                                       // 0x0044(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetRelativeTransform_ReturnValue;         // 0x0050(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable;                              // 0x00B0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CallFunc_AddComponent_ReturnValue;                 // 0x0110(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformLocation_ReturnValue;            // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegAtan_ReturnValue;                      // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17C[0x4];                                      // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_FCeil_ReturnValue;                        // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Multiply_IntInt_ReturnValue;              // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_2;           // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_RotateAngleAxis_ReturnValue;              // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x01E8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast; // 0x02D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RotateAngleAxis_AngleDeg_ImplicitCast;    // 0x02D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_IceBlade_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_SkillEffect_IceBlade_C_UserConstructionScript");
static_assert(sizeof(BP_SkillEffect_IceBlade_C_UserConstructionScript) == 0x0002E0, "Wrong size on BP_SkillEffect_IceBlade_C_UserConstructionScript");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_UserConstructionScript, Degree) == 0x000000, "Member 'BP_SkillEffect_IceBlade_C_UserConstructionScript::Degree' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IceBlade_C_UserConstructionScript, Temp_int_Variable) == 0x000008, "Member 'BP_SkillEffect_IceBlade_C_UserConstructionScript::Temp_int_Variable' has a wrong offset!");
