#pragma once

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"
#include "AdditionalCascades_structs.hpp"


namespace PalServer::Params
{

// Function BP_WaterfallTool.BP_WaterfallTool_C.UserConstructionScript
// 0x0270 (0x0270 - 0x0000)
struct BP_WaterfallTool_C_UserConstructionScript final
{
public:
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0010(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAdditionalCascades                    CallFunc_Array_Get_Item;                           // 0x0060(0x0090)(HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Check_Spline_Input_Keys_Passed;           // 0x00F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5[0x3];                                       // 0x00F5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       CallFunc_AddComponent_ReturnValue;                 // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0120(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0138(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0150(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0168(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0250(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0254(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_255[0x3];                                      // 0x0255(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25C[0x4];                                      // 0x025C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Do_Waterfall_Trace_Scale_ImplicitCast;    // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Setup_Spline_Mesh_Scale_ImplicitCast;     // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterfallTool_C_UserConstructionScript) == 0x000010, "Wrong alignment on BP_WaterfallTool_C_UserConstructionScript");
static_assert(sizeof(BP_WaterfallTool_C_UserConstructionScript) == 0x000270, "Wrong size on BP_WaterfallTool_C_UserConstructionScript");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue) == 0x000000, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_Greater_IntInt_ReturnValue) == 0x000004, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_WaterfallTool_C_UserConstructionScript::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x00000C, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000010, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_BreakVector_X) == 0x000028, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_BreakVector_Y) == 0x000030, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_BreakVector_Z) == 0x000038, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_MakeVector_ReturnValue) == 0x000048, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_Array_Get_Item) == 0x000060, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_Array_Length_ReturnValue_1) == 0x0000F0, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_Check_Spline_Input_Keys_Passed) == 0x0000F4, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_Check_Spline_Input_Keys_Passed' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_AddComponent_ReturnValue) == 0x0000F8, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_Array_Add_ReturnValue) == 0x000100, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_BreakTransform_Location) == 0x000108, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_BreakTransform_Rotation) == 0x000120, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_BreakTransform_Scale) == 0x000138, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_Add_VectorVector_ReturnValue) == 0x000150, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000168, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, Temp_int_Loop_Counter_Variable) == 0x000250, "Member 'BP_WaterfallTool_C_UserConstructionScript::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_Less_IntInt_ReturnValue) == 0x000254, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_Add_IntInt_ReturnValue) == 0x000258, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_Do_Waterfall_Trace_Scale_ImplicitCast) == 0x000260, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_Do_Waterfall_Trace_Scale_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_UserConstructionScript, CallFunc_Setup_Spline_Mesh_Scale_ImplicitCast) == 0x000268, "Member 'BP_WaterfallTool_C_UserConstructionScript::CallFunc_Setup_Spline_Mesh_Scale_ImplicitCast' has a wrong offset!");

// Function BP_WaterfallTool.BP_WaterfallTool_C.Setup Waterfall Particles
// 0x0318 (0x0318 - 0x0000)
struct BP_WaterfallTool_C_Setup_Waterfall_Particles final
{
public:
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult;    // 0x0038(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x0120(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_1;  // 0x0130(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetVectorArrayAverage_ReturnValue;        // 0x0218(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetRelativeLocation_SweepHitResult_2;  // 0x0230(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_WaterfallTool_C_Setup_Waterfall_Particles) == 0x000008, "Wrong alignment on BP_WaterfallTool_C_Setup_Waterfall_Particles");
static_assert(sizeof(BP_WaterfallTool_C_Setup_Waterfall_Particles) == 0x000318, "Wrong size on BP_WaterfallTool_C_Setup_Waterfall_Particles");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Waterfall_Particles, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000000, "Member 'BP_WaterfallTool_C_Setup_Waterfall_Particles::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Waterfall_Particles, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000008, "Member 'BP_WaterfallTool_C_Setup_Waterfall_Particles::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Waterfall_Particles, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x000020, "Member 'BP_WaterfallTool_C_Setup_Waterfall_Particles::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Waterfall_Particles, CallFunc_K2_SetRelativeLocation_SweepHitResult) == 0x000038, "Member 'BP_WaterfallTool_C_Setup_Waterfall_Particles::CallFunc_K2_SetRelativeLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Waterfall_Particles, K2Node_MakeArray_Array) == 0x000120, "Member 'BP_WaterfallTool_C_Setup_Waterfall_Particles::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Waterfall_Particles, CallFunc_K2_SetRelativeLocation_SweepHitResult_1) == 0x000130, "Member 'BP_WaterfallTool_C_Setup_Waterfall_Particles::CallFunc_K2_SetRelativeLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Waterfall_Particles, CallFunc_GetVectorArrayAverage_ReturnValue) == 0x000218, "Member 'BP_WaterfallTool_C_Setup_Waterfall_Particles::CallFunc_GetVectorArrayAverage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Waterfall_Particles, CallFunc_K2_SetRelativeLocation_SweepHitResult_2) == 0x000230, "Member 'BP_WaterfallTool_C_Setup_Waterfall_Particles::CallFunc_K2_SetRelativeLocation_SweepHitResult_2' has a wrong offset!");

// Function BP_WaterfallTool.BP_WaterfallTool_C.Setup Waterfall Particle Parameters
// 0x0018 (0x0018 - 0x0000)
struct BP_WaterfallTool_C_Setup_Waterfall_Particle_Parameters final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast;     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_1;   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetFloatParameter_Param_ImplicitCast_2;   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterfallTool_C_Setup_Waterfall_Particle_Parameters) == 0x000008, "Wrong alignment on BP_WaterfallTool_C_Setup_Waterfall_Particle_Parameters");
static_assert(sizeof(BP_WaterfallTool_C_Setup_Waterfall_Particle_Parameters) == 0x000018, "Wrong size on BP_WaterfallTool_C_Setup_Waterfall_Particle_Parameters");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Waterfall_Particle_Parameters, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_WaterfallTool_C_Setup_Waterfall_Particle_Parameters::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Waterfall_Particle_Parameters, CallFunc_SetFloatParameter_Param_ImplicitCast) == 0x000008, "Member 'BP_WaterfallTool_C_Setup_Waterfall_Particle_Parameters::CallFunc_SetFloatParameter_Param_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Waterfall_Particle_Parameters, CallFunc_SetFloatParameter_Param_ImplicitCast_1) == 0x00000C, "Member 'BP_WaterfallTool_C_Setup_Waterfall_Particle_Parameters::CallFunc_SetFloatParameter_Param_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Waterfall_Particle_Parameters, CallFunc_SetFloatParameter_Param_ImplicitCast_2) == 0x000010, "Member 'BP_WaterfallTool_C_Setup_Waterfall_Particle_Parameters::CallFunc_SetFloatParameter_Param_ImplicitCast_2' has a wrong offset!");

// Function BP_WaterfallTool.BP_WaterfallTool_C.Setup Spline Mesh
// 0x01F0 (0x01F0 - 0x0000)
struct BP_WaterfallTool_C_Setup_Spline_Mesh final
{
public:
	class USplineComponent*                       Spline_Comp;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        Scale;                                             // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location; // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent; // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Location_1; // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1; // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRollAtSplinePoint_ReturnValue;         // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRollAtSplinePoint_ReturnValue_1;       // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_94[0x4];                                       // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetScaleAtSplinePoint_ReturnValue;        // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetScaleAtSplinePoint_ReturnValue_1;      // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_5;      // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0xC];                                      // 0x0154(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0160(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x01C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x01D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D1[0x7];                                      // 0x01D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x01D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x01E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetStartRoll_StartRoll_ImplicitCast;      // 0x01E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetEndRoll_EndRoll_ImplicitCast;          // 0x01EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterfallTool_C_Setup_Spline_Mesh) == 0x000010, "Wrong alignment on BP_WaterfallTool_C_Setup_Spline_Mesh");
static_assert(sizeof(BP_WaterfallTool_C_Setup_Spline_Mesh) == 0x0001F0, "Wrong size on BP_WaterfallTool_C_Setup_Spline_Mesh");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, Spline_Comp) == 0x000000, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::Spline_Comp' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, Scale) == 0x000008, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::Scale' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000010, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, Temp_int_Variable) == 0x000014, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_Subtract_IntInt_ReturnValue) == 0x000018, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_GetLocationAndTangentAtSplinePoint_Location) == 0x000020, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_GetLocationAndTangentAtSplinePoint_Location' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent) == 0x000038, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000050, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_Add_IntInt_ReturnValue) == 0x000054, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_GetLocationAndTangentAtSplinePoint_Location_1) == 0x000058, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_GetLocationAndTangentAtSplinePoint_Location_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1) == 0x000070, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_GetLocationAndTangentAtSplinePoint_Tangent_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_Add_IntInt_ReturnValue_1) == 0x000088, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_GetRollAtSplinePoint_ReturnValue) == 0x00008C, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_GetRollAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_GetRollAtSplinePoint_ReturnValue_1) == 0x000090, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_GetRollAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000098, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000A0, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000A8, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_GetScaleAtSplinePoint_ReturnValue) == 0x0000B0, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_GetScaleAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_GetScaleAtSplinePoint_ReturnValue_1) == 0x0000C8, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_GetScaleAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_BreakVector_X) == 0x0000E0, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_BreakVector_Y) == 0x0000E8, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_BreakVector_Z) == 0x0000F0, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_BreakVector_X_1) == 0x0000F8, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_BreakVector_Y_1) == 0x000100, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_BreakVector_Z_1) == 0x000108, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000110, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x000118, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000120, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_Multiply_DoubleDouble_ReturnValue_5) == 0x000128, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_Multiply_DoubleDouble_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_MakeVector2D_ReturnValue) == 0x000130, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_MakeVector2D_ReturnValue_1) == 0x000140, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_Add_IntInt_ReturnValue_3) == 0x000150, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, Temp_struct_Variable) == 0x000160, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_AddComponent_ReturnValue) == 0x0001C0, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x0001C8, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0001D0, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0001D8, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x0001E0, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_SetStartRoll_StartRoll_ImplicitCast) == 0x0001E8, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_SetStartRoll_StartRoll_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Spline_Mesh, CallFunc_SetEndRoll_EndRoll_ImplicitCast) == 0x0001EC, "Member 'BP_WaterfallTool_C_Setup_Spline_Mesh::CallFunc_SetEndRoll_EndRoll_ImplicitCast' has a wrong offset!");

// Function BP_WaterfallTool.BP_WaterfallTool_C.Setup Material Parameters
// 0x0088 (0x0088 - 0x0000)
struct BP_WaterfallTool_C_Setup_Material_Parameters final
{
public:
	class UMaterialInstanceDynamic*               Material;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Current_Index;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineComponent*                       Spline;                                            // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast; // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_1; // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_2; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_3; // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_4; // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_5; // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_6; // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_7; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_8; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_9; // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_Value_ImplicitCast_10; // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterfallTool_C_Setup_Material_Parameters) == 0x000008, "Wrong alignment on BP_WaterfallTool_C_Setup_Material_Parameters");
static_assert(sizeof(BP_WaterfallTool_C_Setup_Material_Parameters) == 0x000088, "Wrong size on BP_WaterfallTool_C_Setup_Material_Parameters");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, Material) == 0x000000, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::Material' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, Current_Index) == 0x000008, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::Current_Index' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, Spline) == 0x000010, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::Spline' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000018, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_BreakRotator_Roll) == 0x000030, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_BreakRotator_Pitch) == 0x000034, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_BreakRotator_Yaw) == 0x000038, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x00003C, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_Subtract_IntInt_ReturnValue) == 0x000048, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x00004C, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_IsValid_ReturnValue) == 0x00004D, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x00004E, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_IsValid_ReturnValue_1) == 0x00004F, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000050, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast) == 0x000054, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000058, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_1) == 0x000060, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_2) == 0x000064, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_3) == 0x000068, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_4) == 0x00006C, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_5) == 0x000070, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_6) == 0x000074, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_7) == 0x000078, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_8) == 0x00007C, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_8' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_9) == 0x000080, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_9' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Material_Parameters, CallFunc_SetScalarParameterValue_Value_ImplicitCast_10) == 0x000084, "Member 'BP_WaterfallTool_C_Setup_Material_Parameters::CallFunc_SetScalarParameterValue_Value_ImplicitCast_10' has a wrong offset!");

// Function BP_WaterfallTool.BP_WaterfallTool_C.Setup Adds Waterfall Particles
// 0x04A0 (0x04A0 - 0x0000)
struct BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x0010(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_1;                            // 0x0070(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_AddComponent_ReturnValue;                 // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_AddComponent_ReturnValue_1;               // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Temp_struct_Variable_2;                            // 0x00E0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                       CallFunc_Array_Get_Item;                           // 0x0140(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_AddComponent_ReturnValue_2;               // 0x0148(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetNumberOfSplinePoints_ReturnValue;      // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_154[0x4];                                      // 0x0154(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue_1;   // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TArray<struct FVector>                        K2Node_MakeArray_Array;                            // 0x01A0(0x0010)(ConstParm, ReferenceParm)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult; // 0x01B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetVectorArrayAverage_ReturnValue;        // 0x0298(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult_1; // 0x02B0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult_2; // 0x0398(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0480(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0484(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_485[0x3];                                      // 0x0485(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x048C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x0490(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles) == 0x000010, "Wrong alignment on BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles");
static_assert(sizeof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles) == 0x0004A0, "Wrong size on BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, Temp_int_Array_Index_Variable) == 0x000004, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, Temp_struct_Variable) == 0x000010, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, Temp_struct_Variable_1) == 0x000070, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::Temp_struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_AddComponent_ReturnValue) == 0x0000D0, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_AddComponent_ReturnValue_1) == 0x0000D8, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_AddComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, Temp_struct_Variable_2) == 0x0000E0, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::Temp_struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_Array_Get_Item) == 0x000140, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_AddComponent_ReturnValue_2) == 0x000148, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_AddComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_GetNumberOfSplinePoints_ReturnValue) == 0x000150, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_GetNumberOfSplinePoints_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x000158, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_GetLocationAtSplinePoint_ReturnValue_1) == 0x000170, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_GetLocationAtSplinePoint_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000188, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, K2Node_MakeArray_Array) == 0x0001A0, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult) == 0x0001B0, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_GetVectorArrayAverage_ReturnValue) == 0x000298, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_GetVectorArrayAverage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult_1) == 0x0002B0, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult_2) == 0x000398, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_K2_SetWorldLocationAndRotation_SweepHitResult_2' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_Array_Length_ReturnValue) == 0x000480, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_Less_IntInt_ReturnValue) == 0x000484, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_Array_Add_ReturnValue) == 0x000488, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_Array_Add_ReturnValue_1) == 0x00048C, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles, CallFunc_Array_Add_ReturnValue_2) == 0x000490, "Member 'BP_WaterfallTool_C_Setup_Adds_Waterfall_Particles::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");

// Function BP_WaterfallTool.BP_WaterfallTool_C.Setup Adds Waterfall Particle Parameters
// 0x0130 (0x0130 - 0x0000)
struct BP_WaterfallTool_C_Setup_Adds_Waterfall_Particle_Parameters final
{
public:
	int32                                         Temp_int_Variable;                                 // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable_1;                               // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
