#pragma once

#include "Basic.hpp"


namespace PalServer::Params
{

// Function WBP_Notice.WBP_Notice_C.ExecuteUbergraph_WBP_Notice
// 0x00A8 (0x00A8 - 0x0000)
struct WBP_Notice_C_ExecuteUbergraph_WBP_Notice final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0064(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_2; // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_2; // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_3; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_3; // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice) == 0x000008, "Wrong alignment on WBP_Notice_C_ExecuteUbergraph_WBP_Notice");
static_assert(sizeof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice) == 0x0000A8, "Wrong size on WBP_Notice_C_ExecuteUbergraph_WBP_Notice");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, EntryPoint) == 0x000000, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result) == 0x000038, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue) == 0x000040, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1) == 0x000050, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_1' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1) == 0x000058, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, K2Node_CreateDelegate_OutputDelegate_3) == 0x000064, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_2) == 0x000078, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_2' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_2) == 0x000080, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, CallFunc_IsValid_ReturnValue_2) == 0x000088, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_3) == 0x000090, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::CallFunc_CreatePlayAnimationTimeRangeProxyObject_Result_3' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_3) == 0x000098, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::CallFunc_CreatePlayAnimationTimeRangeProxyObject_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Notice_C_ExecuteUbergraph_WBP_Notice, CallFunc_IsValid_ReturnValue_3) == 0x0000A0, "Member 'WBP_Notice_C_ExecuteUbergraph_WBP_Notice::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function WBP_Notice.WBP_Notice_C.SetIconTexture
// 0x0008 (0x0008 - 0x0000)
struct WBP_Notice_C_SetIconTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Notice_C_SetIconTexture) == 0x000008, "Wrong alignment on WBP_Notice_C_SetIconTexture");
static_assert(sizeof(WBP_Notice_C_SetIconTexture) == 0x000008, "Wrong size on WBP_Notice_C_SetIconTexture");
static_assert(offsetof(WBP_Notice_C_SetIconTexture, Texture) == 0x000000, "Member 'WBP_Notice_C_SetIconTexture::Texture' has a wrong offset!");

// Function WBP_Notice.WBP_Notice_C.SetText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Notice_C_SetText final
{
public:
	class FText                                   Text;                                              // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Notice_C_SetText) == 0x000008, "Wrong alignment on WBP_Notice_C_SetText");
static_assert(sizeof(WBP_Notice_C_SetText) == 0x000018, "Wrong size on WBP_Notice_C_SetText");
static_assert(offsetof(WBP_Notice_C_SetText, Text) == 0x000000, "Member 'WBP_Notice_C_SetText::Text' has a wrong offset!");

}

