#pragma once

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"


namespace PalServer::Params
{

// Function WBP_PalStorageSortWorkSuitabilityFilterCheckBox.WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C.BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PalStorageSortWorkSuitabilityFilterCheckBox.WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C.ExecuteUbergraph_WBP_PalStorageSortWorkSuitabilityFilterCheckBox
// 0x0018 (0x0018 - 0x0000)
struct WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortWorkSuitabilityFilterCheckBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortWorkSuitabilityFilterCheckBox) == 0x000008, "Wrong alignment on WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortWorkSuitabilityFilterCheckBox");
static_assert(sizeof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortWorkSuitabilityFilterCheckBox) == 0x000018, "Wrong size on WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortWorkSuitabilityFilterCheckBox");
static_assert(offsetof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortWorkSuitabilityFilterCheckBox, EntryPoint) == 0x000000, "Member 'WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortWorkSuitabilityFilterCheckBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortWorkSuitabilityFilterCheckBox, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortWorkSuitabilityFilterCheckBox::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortWorkSuitabilityFilterCheckBox, CallFunc_IsChecked_ReturnValue) == 0x000010, "Member 'WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortWorkSuitabilityFilterCheckBox::CallFunc_IsChecked_ReturnValue' has a wrong offset!");

// Function WBP_PalStorageSortWorkSuitabilityFilterCheckBox.WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C.OnChangedStateInternal
// 0x0001 (0x0001 - 0x0000)
struct WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnChangedStateInternal final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnChangedStateInternal) == 0x000001, "Wrong alignment on WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnChangedStateInternal");
static_assert(sizeof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnChangedStateInternal) == 0x000001, "Wrong size on WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnChangedStateInternal");
static_assert(offsetof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnChangedStateInternal, IsChecked) == 0x000000, "Member 'WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnChangedStateInternal::IsChecked' has a wrong offset!");

// Function WBP_PalStorageSortWorkSuitabilityFilterCheckBox.WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C.OnClicked__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnClicked__DelegateSignature final
{
public:
	bool                                          bChecked;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalWorkSuitability                           WorkSuitbility;                                    // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnClicked__DelegateSignature) == 0x000001, "Wrong alignment on WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnClicked__DelegateSignature) == 0x000002, "Wrong size on WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnClicked__DelegateSignature, bChecked) == 0x000000, "Member 'WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnClicked__DelegateSignature::bChecked' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnClicked__DelegateSignature, WorkSuitbility) == 0x000001, "Member 'WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_OnClicked__DelegateSignature::WorkSuitbility' has a wrong offset!");

// Function WBP_PalStorageSortWorkSuitabilityFilterCheckBox.WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C.SetCheckedState
// 0x0005 (0x0005 - 0x0000)
struct WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState final
{
public:
	bool                                          bChecked;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState) == 0x000001, "Wrong alignment on WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState");
static_assert(sizeof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState) == 0x000005, "Wrong size on WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState");
static_assert(offsetof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState, bChecked) == 0x000000, "Member 'WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState::bChecked' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState, Temp_bool_Variable) == 0x000001, "Member 'WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState, Temp_byte_Variable) == 0x000002, "Member 'WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState, K2Node_Select_Default) == 0x000004, "Member 'WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetCheckedState::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PalStorageSortWorkSuitabilityFilterCheckBox.WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C.SetWorkSuitability
// 0x0020 (0x0020 - 0x0000)
struct WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetWorkSuitability final
{
public:
	EPalWorkSuitability                           WorkSuitability;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetWorkSuitabilityName_outName;           // 0x0008(0x0018)()
};
static_assert(alignof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetWorkSuitability) == 0x000008, "Wrong alignment on WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetWorkSuitability");
static_assert(sizeof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetWorkSuitability) == 0x000020, "Wrong size on WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetWorkSuitability");
static_assert(offsetof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetWorkSuitability, WorkSuitability) == 0x000000, "Member 'WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetWorkSuitability::WorkSuitability' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetWorkSuitability, CallFunc_GetWorkSuitabilityName_outName) == 0x000008, "Member 'WBP_PalStorageSortWorkSuitabilityFilterCheckBox_C_SetWorkSuitability::CallFunc_GetWorkSuitabilityName_outName' has a wrong offset!");

}

