#pragma once

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Pal_structs.hpp"
#include "SlateCore_structs.hpp"
#include "Engine_structs.hpp"


namespace PalServer::Params
{

// Function WBP_PlayerUI.WBP_PlayerUI_C.CalcCompassRotation
// 0x0020 (0x0020 - 0x0000)
struct WBP_PlayerUI_C_CalcCompassRotation final
{
public:
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  CallFunc_K2_GetPawn_ReturnValue;                   // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_CalcCompassRotation) == 0x000008, "Wrong alignment on WBP_PlayerUI_C_CalcCompassRotation");
static_assert(sizeof(WBP_PlayerUI_C_CalcCompassRotation) == 0x000020, "Wrong size on WBP_PlayerUI_C_CalcCompassRotation");
static_assert(offsetof(WBP_PlayerUI_C_CalcCompassRotation, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000000, "Member 'WBP_PlayerUI_C_CalcCompassRotation::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CalcCompassRotation, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_PlayerUI_C_CalcCompassRotation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CalcCompassRotation, CallFunc_K2_GetPawn_ReturnValue) == 0x000010, "Member 'WBP_PlayerUI_C_CalcCompassRotation::CallFunc_K2_GetPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CalcCompassRotation, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'WBP_PlayerUI_C_CalcCompassRotation::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function WBP_PlayerUI.WBP_PlayerUI_C.CheckArmorDurability
// 0x0088 (0x0088 - 0x0000)
struct WBP_PlayerUI_C_CheckArmorDurability final
{
public:
	bool                                          IsAnyArmorBreak;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x1];                                        // 0x0003(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Variable;                                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalPlayerInventoryData*                CallFunc_GetLocalInventoryData_ReturnValue;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalItemContainer*                      CallFunc_TryGetContainerFromInventoryType_OutContainer; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetContainerFromInventoryType_ReturnValue; // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalItemSlot*                           CallFunc_Get_ReturnValue;                          // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Num_ReturnValue;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalDynamicItemDataBase*                CallFunc_TryGetDynamicItemData_OutDynamicItemData; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetDynamicItemData_ReturnValue;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPalObjectDurabilityInterface> K2Node_DynamicCast_AsPal_Object_Durability_Interface; // 0x0050(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x2];                                       // 0x0062(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDurability_ReturnValue;                // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x3];                                       // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxDurability_ReturnValue;             // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_CheckArmorDurability) == 0x000008, "Wrong alignment on WBP_PlayerUI_C_CheckArmorDurability");
static_assert(sizeof(WBP_PlayerUI_C_CheckArmorDurability) == 0x000088, "Wrong size on WBP_PlayerUI_C_CheckArmorDurability");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, IsAnyArmorBreak) == 0x000000, "Member 'WBP_PlayerUI_C_CheckArmorDurability::IsAnyArmorBreak' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, Temp_bool_Variable) == 0x000001, "Member 'WBP_PlayerUI_C_CheckArmorDurability::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_Not_PreBool_ReturnValue) == 0x000002, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, Temp_int_Variable) == 0x000004, "Member 'WBP_PlayerUI_C_CheckArmorDurability::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_GetLocalInventoryData_ReturnValue) == 0x000010, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_GetLocalInventoryData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_TryGetContainerFromInventoryType_OutContainer) == 0x000018, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_TryGetContainerFromInventoryType_OutContainer' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_TryGetContainerFromInventoryType_ReturnValue) == 0x000020, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_TryGetContainerFromInventoryType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_IsValid_ReturnValue) == 0x000021, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_Get_ReturnValue) == 0x000028, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_Get_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_Num_ReturnValue) == 0x000030, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_Num_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_TryGetDynamicItemData_OutDynamicItemData) == 0x000038, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_TryGetDynamicItemData_OutDynamicItemData' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_TryGetDynamicItemData_ReturnValue) == 0x000040, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_TryGetDynamicItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_Subtract_IntInt_ReturnValue) == 0x000044, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000048, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, K2Node_DynamicCast_AsPal_Object_Durability_Interface) == 0x000050, "Member 'WBP_PlayerUI_C_CheckArmorDurability::K2Node_DynamicCast_AsPal_Object_Durability_Interface' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'WBP_PlayerUI_C_CheckArmorDurability::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_BooleanAND_ReturnValue) == 0x000061, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_GetDurability_ReturnValue) == 0x000064, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_GetDurability_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000068, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_GetMaxDurability_ReturnValue) == 0x00006C, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_GetMaxDurability_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000070, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckArmorDurability, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000080, "Member 'WBP_PlayerUI_C_CheckArmorDurability::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_PlayerUI.WBP_PlayerUI_C.CheckAutoUIHide
// 0x0038 (0x0038 - 0x0000)
struct WBP_PlayerUI_C_CheckAutoUIHide final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBattleMode_ReturnValue;                // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerWeaponInfoShouldShow_isShow;      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Is_Player_Gauge_Should_Show_isShow;       // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0023(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue_1;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Should_Check_UIAuto_Hide_shouldCheck;     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_CheckAutoUIHide) == 0x000008, "Wrong alignment on WBP_PlayerUI_C_CheckAutoUIHide");
static_assert(sizeof(WBP_PlayerUI_C_CheckAutoUIHide) == 0x000038, "Wrong size on WBP_PlayerUI_C_CheckAutoUIHide");
static_assert(offsetof(WBP_PlayerUI_C_CheckAutoUIHide, DeltaTime) == 0x000000, "Member 'WBP_PlayerUI_C_CheckAutoUIHide::DeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckAutoUIHide, CallFunc_GetPalmi_ReturnValue) == 0x000008, "Member 'WBP_PlayerUI_C_CheckAutoUIHide::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckAutoUIHide, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_PlayerUI_C_CheckAutoUIHide::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckAutoUIHide, CallFunc_GetBattleMode_ReturnValue) == 0x000011, "Member 'WBP_PlayerUI_C_CheckAutoUIHide::CallFunc_GetBattleMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckAutoUIHide, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000018, "Member 'WBP_PlayerUI_C_CheckAutoUIHide::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckAutoUIHide, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000020, "Member 'WBP_PlayerUI_C_CheckAutoUIHide::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckAutoUIHide, CallFunc_IsPlayerWeaponInfoShouldShow_isShow) == 0x000021, "Member 'WBP_PlayerUI_C_CheckAutoUIHide::CallFunc_IsPlayerWeaponInfoShouldShow_isShow' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckAutoUIHide, CallFunc_Is_Player_Gauge_Should_Show_isShow) == 0x000022, "Member 'WBP_PlayerUI_C_CheckAutoUIHide::CallFunc_Is_Player_Gauge_Should_Show_isShow' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckAutoUIHide, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000023, "Member 'WBP_PlayerUI_C_CheckAutoUIHide::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckAutoUIHide, CallFunc_Add_DoubleDouble_ReturnValue_1) == 0x000028, "Member 'WBP_PlayerUI_C_CheckAutoUIHide::CallFunc_Add_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckAutoUIHide, CallFunc_Should_Check_UIAuto_Hide_shouldCheck) == 0x000030, "Member 'WBP_PlayerUI_C_CheckAutoUIHide::CallFunc_Should_Check_UIAuto_Hide_shouldCheck' has a wrong offset!");

// Function WBP_PlayerUI.WBP_PlayerUI_C.CheckWeaponDurability
// 0x0058 (0x0058 - 0x0000)
struct WBP_PlayerUI_C_CheckWeaponDurability final
{
public:
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APalWeaponBase*                         CallFunc_GetHasWeapon_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalDynamicWeaponItemDataBase*          CallFunc_TryGetDynamicWeaponData_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPalObjectDurabilityInterface> K2Node_DynamicCast_AsPal_Object_Durability_Interface; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x3];                                       // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxDurability_ReturnValue;             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDurability_ReturnValue;                // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_47[0x1];                                       // 0x0047(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_LessEqual_DoubleDouble_A_ImplicitCast;    // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_CheckWeaponDurability) == 0x000008, "Wrong alignment on WBP_PlayerUI_C_CheckWeaponDurability");
static_assert(sizeof(WBP_PlayerUI_C_CheckWeaponDurability) == 0x000058, "Wrong size on WBP_PlayerUI_C_CheckWeaponDurability");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, CallFunc_GetPalmi_ReturnValue) == 0x000000, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, CallFunc_IsValid_ReturnValue_1) == 0x000009, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, CallFunc_GetHasWeapon_ReturnValue) == 0x000010, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::CallFunc_GetHasWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, CallFunc_TryGetDynamicWeaponData_ReturnValue) == 0x000018, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::CallFunc_TryGetDynamicWeaponData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, CallFunc_IsValid_ReturnValue_2) == 0x000020, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, CallFunc_IsValid_ReturnValue_3) == 0x000021, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, K2Node_DynamicCast_AsPal_Object_Durability_Interface) == 0x000028, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::K2Node_DynamicCast_AsPal_Object_Durability_Interface' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, CallFunc_GetMaxDurability_ReturnValue) == 0x00003C, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::CallFunc_GetMaxDurability_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, CallFunc_GetDurability_ReturnValue) == 0x000040, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::CallFunc_GetDurability_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000044, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000045, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, CallFunc_BooleanAND_ReturnValue) == 0x000046, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000048, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_CheckWeaponDurability, CallFunc_LessEqual_DoubleDouble_A_ImplicitCast) == 0x000050, "Member 'WBP_PlayerUI_C_CheckWeaponDurability::CallFunc_LessEqual_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_PlayerUI.WBP_PlayerUI_C.ExecuteUbergraph_WBP_PlayerUI
// 0x0178 (0x0178 - 0x0000)
struct WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F[0x1];                                        // 0x000F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x003C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_CreatePlayAnimationProxyObject_Result;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimationPlayCallbackProxy*      CallFunc_CreatePlayAnimationProxyObject_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalTechnologyData*                     CallFunc_GetLocalTechnologyData_ReturnValue;       // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalPlayerLocalRecordData*              CallFunc_GetLocalRecordData_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0098(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x00E0(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNewUnlockedBuild_Radial_ReturnValue;    // 0x00FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00FD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x00FE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalPlayerInventoryType                       K2Node_CustomEvent_NewParam2;                      // 0x00FF(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_NewParam;                       // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue;               // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalDebugSetting*                       CallFunc_GetPalDebugSetting_ReturnValue;           // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x3];                                      // 0x0119(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  K2Node_CustomEvent_CrimeInstance_1;                // 0x011C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  K2Node_CustomEvent_CrimeInstance;                  // 0x012C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterHandle*          K2Node_CustomEvent_CriminalHandle_1;               // 0x0140(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                           K2Node_CustomEvent_CrimeIds;                       // 0x0148(0x0010)(ConstParm, ReferenceParm)
	class UPalIndividualCharacterHandle*          K2Node_CustomEvent_CriminalHandle;                 // 0x0158(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          K2Node_CustomEvent_TargetCharacter;                // 0x0160(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CheckAutoUIHide_deltaTime_ImplicitCast;   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_hideUITime_ImplicitCast;        // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI) == 0x000008, "Wrong alignment on WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI");
static_assert(sizeof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI) == 0x000178, "Wrong size on WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, EntryPoint) == 0x000000, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_bool_IsClosed_Variable) == 0x00000D, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_bool_Has_Been_Initd_Variable) == 0x00000E, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_PlayAnimation_ReturnValue_3) == 0x000028, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_PlayAnimation_ReturnValue_4) == 0x000030, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, Temp_int_Loop_Counter_Variable) == 0x000038, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_CreateDelegate_OutputDelegate) == 0x00003C, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_Add_IntInt_ReturnValue) == 0x00004C, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_CreatePlayAnimationProxyObject_Result) == 0x000050, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_CreatePlayAnimationProxyObject_Result' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_CreatePlayAnimationProxyObject_ReturnValue) == 0x000058, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_CreatePlayAnimationProxyObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_GetLocalTechnologyData_ReturnValue) == 0x000068, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_GetLocalTechnologyData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_PlayAnimation_ReturnValue_5) == 0x000070, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000078, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_GetLocalRecordData_ReturnValue) == 0x000088, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_GetLocalRecordData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_IsValid_ReturnValue_2) == 0x000090, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_Event_MyGeometry) == 0x000098, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_Event_InDeltaTime) == 0x0000D8, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_Map_Keys_Keys) == 0x0000E0, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_Array_Get_Item) == 0x0000F0, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_Array_Length_ReturnValue) == 0x0000F8, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_IsNewUnlockedBuild_Radial_ReturnValue) == 0x0000FC, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_IsNewUnlockedBuild_Radial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_Less_IntInt_ReturnValue) == 0x0000FD, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_BooleanAND_ReturnValue) == 0x0000FE, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_CustomEvent_NewParam2) == 0x0000FF, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_CustomEvent_NewParam2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_CustomEvent_NewParam) == 0x000100, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_CustomEvent_NewParam' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_GetGameSetting_ReturnValue) == 0x000108, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_GetPalDebugSetting_ReturnValue) == 0x000110, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_GetPalDebugSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_IsValid_ReturnValue_3) == 0x000118, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_CustomEvent_CrimeInstance_1) == 0x00011C, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_CustomEvent_CrimeInstance_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_CustomEvent_CrimeInstance) == 0x00012C, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_CustomEvent_CrimeInstance' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_CustomEvent_CriminalHandle_1) == 0x000140, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_CustomEvent_CriminalHandle_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_CustomEvent_CrimeIds) == 0x000148, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_CustomEvent_CrimeIds' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_CustomEvent_CriminalHandle) == 0x000158, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_CustomEvent_CriminalHandle' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_CustomEvent_TargetCharacter) == 0x000160, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_CustomEvent_TargetCharacter' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, CallFunc_CheckAutoUIHide_deltaTime_ImplicitCast) == 0x000168, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::CallFunc_CheckAutoUIHide_deltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI, K2Node_VariableSet_hideUITime_ImplicitCast) == 0x000170, "Member 'WBP_PlayerUI_C_ExecuteUbergraph_WBP_PlayerUI::K2Node_VariableSet_hideUITime_ImplicitCast' has a wrong offset!");

// Function WBP_PlayerUI.WBP_PlayerUI_C.InitializeWorldMapTexture
// 0x0040 (0x0040 - 0x0000)
struct WBP_PlayerUI_C_InitializeWorldMapTexture final
{
public:
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalWorldMapUIData*                     CallFunc_GetLocalWorldMapData_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0030(0x0008)(NoDestructor)
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue;               // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_InitializeWorldMapTexture) == 0x000008, "Wrong alignment on WBP_PlayerUI_C_InitializeWorldMapTexture");
static_assert(sizeof(WBP_PlayerUI_C_InitializeWorldMapTexture) == 0x000040, "Wrong size on WBP_PlayerUI_C_InitializeWorldMapTexture");
static_assert(offsetof(WBP_PlayerUI_C_InitializeWorldMapTexture, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000000, "Member 'WBP_PlayerUI_C_InitializeWorldMapTexture::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_InitializeWorldMapTexture, CallFunc_GetLocalWorldMapData_ReturnValue) == 0x000008, "Member 'WBP_PlayerUI_C_InitializeWorldMapTexture::CallFunc_GetLocalWorldMapData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_InitializeWorldMapTexture, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_PlayerUI_C_InitializeWorldMapTexture::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_InitializeWorldMapTexture, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'WBP_PlayerUI_C_InitializeWorldMapTexture::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_InitializeWorldMapTexture, CallFunc_BeginDrawCanvasToRenderTarget_Canvas) == 0x000018, "Member 'WBP_PlayerUI_C_InitializeWorldMapTexture::CallFunc_BeginDrawCanvasToRenderTarget_Canvas' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_InitializeWorldMapTexture, CallFunc_BeginDrawCanvasToRenderTarget_Size) == 0x000020, "Member 'WBP_PlayerUI_C_InitializeWorldMapTexture::CallFunc_BeginDrawCanvasToRenderTarget_Size' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_InitializeWorldMapTexture, CallFunc_BeginDrawCanvasToRenderTarget_Context) == 0x000030, "Member 'WBP_PlayerUI_C_InitializeWorldMapTexture::CallFunc_BeginDrawCanvasToRenderTarget_Context' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_InitializeWorldMapTexture, CallFunc_GetGameSetting_ReturnValue) == 0x000038, "Member 'WBP_PlayerUI_C_InitializeWorldMapTexture::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");

// Function WBP_PlayerUI.WBP_PlayerUI_C.Is Player Gauge Should Show
// 0x0018 (0x0018 - 0x0000)
struct WBP_PlayerUI_C_Is_Player_Gauge_Should_Show final
{
public:
	bool                                          IsShow;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_Is_Player_Gauge_Should_Show) == 0x000008, "Wrong alignment on WBP_PlayerUI_C_Is_Player_Gauge_Should_Show");
static_assert(sizeof(WBP_PlayerUI_C_Is_Player_Gauge_Should_Show) == 0x000018, "Wrong size on WBP_PlayerUI_C_Is_Player_Gauge_Should_Show");
static_assert(offsetof(WBP_PlayerUI_C_Is_Player_Gauge_Should_Show, IsShow) == 0x000000, "Member 'WBP_PlayerUI_C_Is_Player_Gauge_Should_Show::IsShow' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_Is_Player_Gauge_Should_Show, CallFunc_Not_PreBool_ReturnValue) == 0x000001, "Member 'WBP_PlayerUI_C_Is_Player_Gauge_Should_Show::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_Is_Player_Gauge_Should_Show, CallFunc_Not_PreBool_ReturnValue_1) == 0x000002, "Member 'WBP_PlayerUI_C_Is_Player_Gauge_Should_Show::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_Is_Player_Gauge_Should_Show, CallFunc_Not_PreBool_ReturnValue_2) == 0x000003, "Member 'WBP_PlayerUI_C_Is_Player_Gauge_Should_Show::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_Is_Player_Gauge_Should_Show, CallFunc_GetPalmi_ReturnValue) == 0x000008, "Member 'WBP_PlayerUI_C_Is_Player_Gauge_Should_Show::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_Is_Player_Gauge_Should_Show, CallFunc_BooleanOR_ReturnValue) == 0x000010, "Member 'WBP_PlayerUI_C_Is_Player_Gauge_Should_Show::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_Is_Player_Gauge_Should_Show, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_PlayerUI_C_Is_Player_Gauge_Should_Show::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WBP_PlayerUI.WBP_PlayerUI_C.IsPalGaugeShouldShow
// 0x0058 (0x0058 - 0x0000)
struct WBP_PlayerUI_C_IsPalGaugeShouldShow final
{
public:
	bool                                          IsShow;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalOtomoHolderComponentBase*           CallFunc_GetOtomoHolderComponent_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_OtomoPalHolderComponent_C*          K2Node_DynamicCast_AsBP_Otomo_Pal_Holder_Component; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPalIndividualCharacterHandle*>  CallFunc_GetAllIndividualHandle_OutArray;          // 0x0020(0x0010)(ReferenceParm)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterHandle*          CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsHPFullRecovered_ReturnValue;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PlayerUI_C_IsPalGaugeShouldShow) == 0x000008, "Wrong alignment on WBP_PlayerUI_C_IsPalGaugeShouldShow");
static_assert(sizeof(WBP_PlayerUI_C_IsPalGaugeShouldShow) == 0x000058, "Wrong size on WBP_PlayerUI_C_IsPalGaugeShouldShow");
static_assert(offsetof(WBP_PlayerUI_C_IsPalGaugeShouldShow, IsShow) == 0x000000, "Member 'WBP_PlayerUI_C_IsPalGaugeShouldShow::IsShow' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_IsPalGaugeShouldShow, CallFunc_GetOtomoHolderComponent_ReturnValue) == 0x000008, "Member 'WBP_PlayerUI_C_IsPalGaugeShouldShow::CallFunc_GetOtomoHolderComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_IsPalGaugeShouldShow, K2Node_DynamicCast_AsBP_Otomo_Pal_Holder_Component) == 0x000010, "Member 'WBP_PlayerUI_C_IsPalGaugeShouldShow::K2Node_DynamicCast_AsBP_Otomo_Pal_Holder_Component' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_IsPalGaugeShouldShow, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_PlayerUI_C_IsPalGaugeShouldShow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_IsPalGaugeShouldShow, CallFunc_IsValid_ReturnValue) == 0x000019, "Member 'WBP_PlayerUI_C_IsPalGaugeShouldShow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_IsPalGaugeShouldShow, CallFunc_GetAllIndividualHandle_OutArray) == 0x000020, "Member 'WBP_PlayerUI_C_IsPalGaugeShouldShow::CallFunc_GetAllIndividualHandle_OutArray' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_IsPalGaugeShouldShow, CallFunc_Less_IntInt_ReturnValue) == 0x000030, "Member 'WBP_PlayerUI_C_IsPalGaugeShouldShow::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_IsPalGaugeShouldShow, CallFunc_Array_Get_Item) == 0x000038, "Member 'WBP_PlayerUI_C_IsPalGaugeShouldShow::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_IsPalGaugeShouldShow, CallFunc_IsValid_ReturnValue_1) == 0x000040, "Member 'WBP_PlayerUI_C_IsPalGaugeShouldShow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_IsPalGaugeShouldShow, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000048, "Member 'WBP_PlayerUI_C_IsPalGaugeShouldShow::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_IsPalGaugeShouldShow, CallFunc_IsValid_ReturnValue_2) == 0x000050, "Member 'WBP_PlayerUI_C_IsPalGaugeShouldShow::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_IsPalGaugeShouldShow, CallFunc_IsHPFullRecovered_ReturnValue) == 0x000051, "Member 'WBP_PlayerUI_C_IsPalGaugeShouldShow::CallFunc_IsHPFullRecovered_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PlayerUI_C_IsPalGaugeShouldShow, CallFunc_Not_PreBool_ReturnValue) == 0x000052, "Member 'WBP_PlayerUI_C_IsPalGaugeShouldShow::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_PlayerUI.WBP_PlayerUI_C.IsPlayerWeaponInfoShouldShow
// 0x0028 (0x0028 - 0x0000)
struct WBP_PlayerUI_C_IsPlayerWeaponInfoShouldShow final
{
public:
	bool                                          IsShow;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
