#pragma once

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Pal_structs.hpp"


namespace PalServer::Params
{

// Function WBP_IngameMenu_Repair.WBP_IngameMenu_Repair_C.BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_BodyArmor_K2Node_ComponentBoundEvent_7_OnClickedButton__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_BodyArmor_K2Node_ComponentBoundEvent_7_OnClickedButton__DelegateSignature final
{
public:
	class UWBP_PalItemSlotButtonBase_C*           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         PressType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_BodyArmor_K2Node_ComponentBoundEvent_7_OnClickedButton__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_BodyArmor_K2Node_ComponentBoundEvent_7_OnClickedButton__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_BodyArmor_K2Node_ComponentBoundEvent_7_OnClickedButton__DelegateSignature) == 0x000010, "Wrong size on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_BodyArmor_K2Node_ComponentBoundEvent_7_OnClickedButton__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_BodyArmor_K2Node_ComponentBoundEvent_7_OnClickedButton__DelegateSignature, Widget) == 0x000000, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_BodyArmor_K2Node_ComponentBoundEvent_7_OnClickedButton__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_BodyArmor_K2Node_ComponentBoundEvent_7_OnClickedButton__DelegateSignature, PressType) == 0x000008, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_BodyArmor_K2Node_ComponentBoundEvent_7_OnClickedButton__DelegateSignature::PressType' has a wrong offset!");

// Function WBP_IngameMenu_Repair.WBP_IngameMenu_Repair_C.BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_HeadArmor_K2Node_ComponentBoundEvent_6_OnClickedButton__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_HeadArmor_K2Node_ComponentBoundEvent_6_OnClickedButton__DelegateSignature final
{
public:
	class UWBP_PalItemSlotButtonBase_C*           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         PressType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_HeadArmor_K2Node_ComponentBoundEvent_6_OnClickedButton__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_HeadArmor_K2Node_ComponentBoundEvent_6_OnClickedButton__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_HeadArmor_K2Node_ComponentBoundEvent_6_OnClickedButton__DelegateSignature) == 0x000010, "Wrong size on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_HeadArmor_K2Node_ComponentBoundEvent_6_OnClickedButton__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_HeadArmor_K2Node_ComponentBoundEvent_6_OnClickedButton__DelegateSignature, Widget) == 0x000000, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_HeadArmor_K2Node_ComponentBoundEvent_6_OnClickedButton__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_HeadArmor_K2Node_ComponentBoundEvent_6_OnClickedButton__DelegateSignature, PressType) == 0x000008, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_HeadArmor_K2Node_ComponentBoundEvent_6_OnClickedButton__DelegateSignature::PressType' has a wrong offset!");

// Function WBP_IngameMenu_Repair.WBP_IngameMenu_Repair_C.BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Shield_K2Node_ComponentBoundEvent_8_OnClickedButton__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Shield_K2Node_ComponentBoundEvent_8_OnClickedButton__DelegateSignature final
{
public:
	class UWBP_PalItemSlotButtonBase_C*           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         PressType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Shield_K2Node_ComponentBoundEvent_8_OnClickedButton__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Shield_K2Node_ComponentBoundEvent_8_OnClickedButton__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Shield_K2Node_ComponentBoundEvent_8_OnClickedButton__DelegateSignature) == 0x000010, "Wrong size on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Shield_K2Node_ComponentBoundEvent_8_OnClickedButton__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Shield_K2Node_ComponentBoundEvent_8_OnClickedButton__DelegateSignature, Widget) == 0x000000, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Shield_K2Node_ComponentBoundEvent_8_OnClickedButton__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Shield_K2Node_ComponentBoundEvent_8_OnClickedButton__DelegateSignature, PressType) == 0x000008, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Shield_K2Node_ComponentBoundEvent_8_OnClickedButton__DelegateSignature::PressType' has a wrong offset!");

// Function WBP_IngameMenu_Repair.WBP_IngameMenu_Repair_C.BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_00_K2Node_ComponentBoundEvent_2_OnClickedButton__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_00_K2Node_ComponentBoundEvent_2_OnClickedButton__DelegateSignature final
{
public:
	class UWBP_PalItemSlotButtonBase_C*           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         PressType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_00_K2Node_ComponentBoundEvent_2_OnClickedButton__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_00_K2Node_ComponentBoundEvent_2_OnClickedButton__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_00_K2Node_ComponentBoundEvent_2_OnClickedButton__DelegateSignature) == 0x000010, "Wrong size on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_00_K2Node_ComponentBoundEvent_2_OnClickedButton__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_00_K2Node_ComponentBoundEvent_2_OnClickedButton__DelegateSignature, Widget) == 0x000000, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_00_K2Node_ComponentBoundEvent_2_OnClickedButton__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_00_K2Node_ComponentBoundEvent_2_OnClickedButton__DelegateSignature, PressType) == 0x000008, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_00_K2Node_ComponentBoundEvent_2_OnClickedButton__DelegateSignature::PressType' has a wrong offset!");

// Function WBP_IngameMenu_Repair.WBP_IngameMenu_Repair_C.BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_01_K2Node_ComponentBoundEvent_3_OnClickedButton__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_01_K2Node_ComponentBoundEvent_3_OnClickedButton__DelegateSignature final
{
public:
	class UWBP_PalItemSlotButtonBase_C*           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         PressType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_01_K2Node_ComponentBoundEvent_3_OnClickedButton__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_01_K2Node_ComponentBoundEvent_3_OnClickedButton__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_01_K2Node_ComponentBoundEvent_3_OnClickedButton__DelegateSignature) == 0x000010, "Wrong size on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_01_K2Node_ComponentBoundEvent_3_OnClickedButton__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_01_K2Node_ComponentBoundEvent_3_OnClickedButton__DelegateSignature, Widget) == 0x000000, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_01_K2Node_ComponentBoundEvent_3_OnClickedButton__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_01_K2Node_ComponentBoundEvent_3_OnClickedButton__DelegateSignature, PressType) == 0x000008, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_01_K2Node_ComponentBoundEvent_3_OnClickedButton__DelegateSignature::PressType' has a wrong offset!");

// Function WBP_IngameMenu_Repair.WBP_IngameMenu_Repair_C.BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_02_K2Node_ComponentBoundEvent_4_OnClickedButton__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_02_K2Node_ComponentBoundEvent_4_OnClickedButton__DelegateSignature final
{
public:
	class UWBP_PalItemSlotButtonBase_C*           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         PressType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_02_K2Node_ComponentBoundEvent_4_OnClickedButton__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_02_K2Node_ComponentBoundEvent_4_OnClickedButton__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_02_K2Node_ComponentBoundEvent_4_OnClickedButton__DelegateSignature) == 0x000010, "Wrong size on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_02_K2Node_ComponentBoundEvent_4_OnClickedButton__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_02_K2Node_ComponentBoundEvent_4_OnClickedButton__DelegateSignature, Widget) == 0x000000, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_02_K2Node_ComponentBoundEvent_4_OnClickedButton__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_02_K2Node_ComponentBoundEvent_4_OnClickedButton__DelegateSignature, PressType) == 0x000008, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_02_K2Node_ComponentBoundEvent_4_OnClickedButton__DelegateSignature::PressType' has a wrong offset!");

// Function WBP_IngameMenu_Repair.WBP_IngameMenu_Repair_C.BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_03_K2Node_ComponentBoundEvent_5_OnClickedButton__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_03_K2Node_ComponentBoundEvent_5_OnClickedButton__DelegateSignature final
{
public:
	class UWBP_PalItemSlotButtonBase_C*           Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         PressType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_03_K2Node_ComponentBoundEvent_5_OnClickedButton__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_03_K2Node_ComponentBoundEvent_5_OnClickedButton__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_03_K2Node_ComponentBoundEvent_5_OnClickedButton__DelegateSignature) == 0x000010, "Wrong size on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_03_K2Node_ComponentBoundEvent_5_OnClickedButton__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_03_K2Node_ComponentBoundEvent_5_OnClickedButton__DelegateSignature, Widget) == 0x000000, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_03_K2Node_ComponentBoundEvent_5_OnClickedButton__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_03_K2Node_ComponentBoundEvent_5_OnClickedButton__DelegateSignature, PressType) == 0x000008, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_ItemSlotButton_Weapon_03_K2Node_ComponentBoundEvent_5_OnClickedButton__DelegateSignature::PressType' has a wrong offset!");

// Function WBP_IngameMenu_Repair.WBP_IngameMenu_Repair_C.BndEvt__WBP_IngameMenu_Repair_WBP_PalPlayerInventoryScrollList_K2Node_ComponentBoundEvent_1_OnLeftClickedSlot__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_PalPlayerInventoryScrollList_K2Node_ComponentBoundEvent_1_OnLeftClickedSlot__DelegateSignature final
{
public:
	class UWBP_PalItemSlotButtonBase_C*           buttonBase;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         PressType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_PalPlayerInventoryScrollList_K2Node_ComponentBoundEvent_1_OnLeftClickedSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_PalPlayerInventoryScrollList_K2Node_ComponentBoundEvent_1_OnLeftClickedSlot__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_PalPlayerInventoryScrollList_K2Node_ComponentBoundEvent_1_OnLeftClickedSlot__DelegateSignature) == 0x000010, "Wrong size on WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_PalPlayerInventoryScrollList_K2Node_ComponentBoundEvent_1_OnLeftClickedSlot__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_PalPlayerInventoryScrollList_K2Node_ComponentBoundEvent_1_OnLeftClickedSlot__DelegateSignature, buttonBase) == 0x000000, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_PalPlayerInventoryScrollList_K2Node_ComponentBoundEvent_1_OnLeftClickedSlot__DelegateSignature::buttonBase' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_PalPlayerInventoryScrollList_K2Node_ComponentBoundEvent_1_OnLeftClickedSlot__DelegateSignature, PressType) == 0x000008, "Member 'WBP_IngameMenu_Repair_C_BndEvt__WBP_IngameMenu_Repair_WBP_PalPlayerInventoryScrollList_K2Node_ComponentBoundEvent_1_OnLeftClickedSlot__DelegateSignature::PressType' has a wrong offset!");

// Function WBP_IngameMenu_Repair.WBP_IngameMenu_Repair_C.DisplayRequireMaterials
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_IngameMenu_Repair_C_DisplayRequireMaterials final
{
public:
	TArray<struct FPalStaticItemIdAndNum>         Materials;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         HasNum;                                            // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPalStaticItemIdAndNum>         ControllableMaterialNum;                           // 0x0018(0x0010)(Edit, BlueprintVisible)
	TArray<class FName>                           RequireMaterialStaticIDArray;                      // 0x0028(0x0010)(Edit, BlueprintVisible)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPalStaticItemIdAndNum                 CallFunc_Array_Get_Item;                           // 0x0070(0x000C)(NoDestructor)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FPalStaticItemIdAndNum>         CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos; // 0x0080(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_96[0x2];                                       // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalStaticItemIdAndNum                 CallFunc_Array_Get_Item_1;                         // 0x0098(0x000C)(NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_AddUnique_ReturnValue;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AD[0x3];                                       // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalStaticItemIdAndNum                 CallFunc_Array_Get_Item_2;                         // 0x00B0(0x000C)(NoDestructor)
	uint8                                         Pad_BC[0x4];                                       // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_IngameMenuConstruction_InfoItem_C* CallFunc_Array_Get_Item_3;                         // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D9[0x7];                                       // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_IngameMenuConstruction_InfoItem_C* CallFunc_Array_Get_Item_4;                         // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials) == 0x000008, "Wrong alignment on WBP_IngameMenu_Repair_C_DisplayRequireMaterials");
static_assert(sizeof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials) == 0x0000F0, "Wrong size on WBP_IngameMenu_Repair_C_DisplayRequireMaterials");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, Materials) == 0x000000, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::Materials' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, HasNum) == 0x000010, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::HasNum' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, ControllableMaterialNum) == 0x000018, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::ControllableMaterialNum' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, RequireMaterialStaticIDArray) == 0x000028, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::RequireMaterialStaticIDArray' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, Temp_int_Array_Index_Variable) == 0x000038, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, Temp_int_Loop_Counter_Variable) == 0x00003C, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, Temp_int_Array_Index_Variable_1) == 0x000044, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, Temp_int_Loop_Counter_Variable_1) == 0x000048, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Add_IntInt_ReturnValue_1) == 0x00004C, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, Temp_bool_True_if_break_was_hit_Variable) == 0x000050, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, Temp_int_Loop_Counter_Variable_2) == 0x000054, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Add_IntInt_ReturnValue_2) == 0x000058, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Not_PreBool_ReturnValue) == 0x00005C, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, Temp_int_Array_Index_Variable_2) == 0x000060, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, Temp_int_Loop_Counter_Variable_3) == 0x000064, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, Temp_int_Array_Index_Variable_3) == 0x000068, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Add_IntInt_ReturnValue_3) == 0x00006C, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Array_Get_Item) == 0x000070, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos) == 0x000080, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_CollectLocalPlayerControllableItemInfos_OutItemInfos' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Array_Length_ReturnValue) == 0x000090, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_BooleanAND_ReturnValue) == 0x000095, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Array_Get_Item_1) == 0x000098, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Array_Length_ReturnValue_1) == 0x0000A4, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Array_AddUnique_ReturnValue) == 0x0000A8, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Array_AddUnique_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000AC, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Array_Get_Item_2) == 0x0000B0, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Array_Get_Item_3) == 0x0000C0, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000C8, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Array_Length_ReturnValue_2) == 0x0000CC, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Less_IntInt_ReturnValue_2) == 0x0000D0, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Array_Length_ReturnValue_3) == 0x0000D4, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Less_IntInt_ReturnValue_3) == 0x0000D8, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Array_Get_Item_4) == 0x0000E0, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Array_Length_ReturnValue_4) == 0x0000E8, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayRequireMaterials, CallFunc_Less_IntInt_ReturnValue_4) == 0x0000EC, "Member 'WBP_IngameMenu_Repair_C_DisplayRequireMaterials::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");

// Function WBP_IngameMenu_Repair.WBP_IngameMenu_Repair_C.DisplayTargetItem
// 0x0088 (0x0088 - 0x0000)
struct WBP_IngameMenu_Repair_C_DisplayTargetItem final
{
public:
	class UPalItemSlot*                           TargetItemSlot;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalDynamicItemDataBase*                CallFunc_TryGetDynamicItemData_OutDynamicItemData; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetDynamicItemData_ReturnValue;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IPalObjectDurabilityInterface> K2Node_DynamicCast_AsPal_Object_Durability_Interface; // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxDurability_ReturnValue;             // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDurability_ReturnValue;                // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPalItemId                             CallFunc_GetItemId_ReturnValue;                    // 0x0034(0x0028)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5C[0x4];                                       // 0x005C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRepairableItem_ReturnValue;             // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6A[0x6];                                       // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_B_ImplicitCast;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_A_ImplicitCast;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetPercent_InPercent_ImplicitCast;        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Repair_C_DisplayTargetItem) == 0x000008, "Wrong alignment on WBP_IngameMenu_Repair_C_DisplayTargetItem");
static_assert(sizeof(WBP_IngameMenu_Repair_C_DisplayTargetItem) == 0x000088, "Wrong size on WBP_IngameMenu_Repair_C_DisplayTargetItem");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, TargetItemSlot) == 0x000000, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::TargetItemSlot' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, CallFunc_TryGetDynamicItemData_OutDynamicItemData) == 0x000008, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::CallFunc_TryGetDynamicItemData_OutDynamicItemData' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, CallFunc_TryGetDynamicItemData_ReturnValue) == 0x000010, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::CallFunc_TryGetDynamicItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, K2Node_DynamicCast_AsPal_Object_Durability_Interface) == 0x000018, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::K2Node_DynamicCast_AsPal_Object_Durability_Interface' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, CallFunc_GetMaxDurability_ReturnValue) == 0x00002C, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::CallFunc_GetMaxDurability_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, CallFunc_GetDurability_ReturnValue) == 0x000030, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::CallFunc_GetDurability_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, CallFunc_GetItemId_ReturnValue) == 0x000034, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::CallFunc_GetItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000060, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, CallFunc_IsEmpty_ReturnValue) == 0x000068, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, CallFunc_IsRepairableItem_ReturnValue) == 0x000069, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::CallFunc_IsRepairableItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, CallFunc_Divide_DoubleDouble_B_ImplicitCast) == 0x000070, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::CallFunc_Divide_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, CallFunc_Divide_DoubleDouble_A_ImplicitCast) == 0x000078, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::CallFunc_Divide_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_DisplayTargetItem, CallFunc_SetPercent_InPercent_ImplicitCast) == 0x000080, "Member 'WBP_IngameMenu_Repair_C_DisplayTargetItem::CallFunc_SetPercent_InPercent_ImplicitCast' has a wrong offset!");

// Function WBP_IngameMenu_Repair.WBP_IngameMenu_Repair_C.ExecuteUbergraph_WBP_IngameMenu_Repair
// 0x00F0 (0x00F0 - 0x0000)
struct WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalItemSlotButtonBase_C*           K2Node_ComponentBoundEvent_buttonBase;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         K2Node_ComponentBoundEvent_pressType_7;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalItemSlot*                           CallFunc_GetTargetSlot_targetSlot;                 // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalItemSlotButtonBase_C*           K2Node_ComponentBoundEvent_Widget_6;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         K2Node_ComponentBoundEvent_pressType_6;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_PalInGameMenuItemSlotButton_C*> K2Node_MakeArray_Array;                            // 0x0038(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_PalItemSlotButtonBase_C*           K2Node_ComponentBoundEvent_Widget_5;               // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         K2Node_ComponentBoundEvent_pressType_5;            // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalItemSlotButtonBase_C*           K2Node_ComponentBoundEvent_Widget_4;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         K2Node_ComponentBoundEvent_pressType_4;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalItemSlotButtonBase_C*           K2Node_ComponentBoundEvent_Widget_3;               // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         K2Node_ComponentBoundEvent_pressType_3;            // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalItemSlotButtonBase_C*           K2Node_ComponentBoundEvent_Widget_2;               // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         K2Node_ComponentBoundEvent_pressType_2;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalItemSlotButtonBase_C*           K2Node_ComponentBoundEvent_Widget_1;               // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         K2Node_ComponentBoundEvent_pressType_1;            // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalItemSlotButtonBase_C*           K2Node_ComponentBoundEvent_Widget;                 // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         K2Node_ComponentBoundEvent_pressType;              // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_IngameMenuConstruction_InfoItem_C*> K2Node_MakeArray_Array_1;                          // 0x00A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(double MaxDurability, double NowDurability, class UWBP_PalItemSlotButtonBase_C* SelfWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_PalInGameMenuItemSlotButton_C*> K2Node_MakeArray_Array_2;                          // 0x00C8(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalInGameMenuItemSlotButton_C*     CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair) == 0x000008, "Wrong alignment on WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair");
static_assert(sizeof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair) == 0x0000F0, "Wrong size on WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, EntryPoint) == 0x000000, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, Temp_int_Array_Index_Variable) == 0x000004, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, Temp_int_Loop_Counter_Variable) == 0x000008, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_buttonBase) == 0x000010, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_buttonBase' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_pressType_7) == 0x000018, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_pressType_7' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, CallFunc_GetTargetSlot_targetSlot) == 0x000020, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::CallFunc_GetTargetSlot_targetSlot' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_Widget_6) == 0x000028, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_Widget_6' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_pressType_6) == 0x000030, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_pressType_6' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_MakeArray_Array) == 0x000038, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_Widget_5) == 0x000048, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_Widget_5' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_pressType_5) == 0x000050, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_pressType_5' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_Widget_4) == 0x000058, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_Widget_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_pressType_4) == 0x000060, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_pressType_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_Widget_3) == 0x000068, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_Widget_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_pressType_3) == 0x000070, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_pressType_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_Widget_2) == 0x000078, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_pressType_2) == 0x000080, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_pressType_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_Widget_1) == 0x000088, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_Widget_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_pressType_1) == 0x000090, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_pressType_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_Widget) == 0x000098, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_Widget' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_ComponentBoundEvent_pressType) == 0x0000A0, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_ComponentBoundEvent_pressType' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_MakeArray_Array_1) == 0x0000A8, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, K2Node_MakeArray_Array_2) == 0x0000C8, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, CallFunc_Array_Length_ReturnValue) == 0x0000D8, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'WBP_IngameMenu_Repair_C_ExecuteUbergraph_WBP_IngameMenu_Repair::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_IngameMenu_Repair.WBP_IngameMenu_Repair_C.GetDefaultFocusTarget
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenu_Repair_C_GetDefaultFocusTarget final
{
public:
	class UWidget*                                TargetWidget;                                      // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_Repair_C_GetDefaultFocusTarget) == 0x000008, "Wrong alignment on WBP_IngameMenu_Repair_C_GetDefaultFocusTarget");
static_assert(sizeof(WBP_IngameMenu_Repair_C_GetDefaultFocusTarget) == 0x000008, "Wrong size on WBP_IngameMenu_Repair_C_GetDefaultFocusTarget");
static_assert(offsetof(WBP_IngameMenu_Repair_C_GetDefaultFocusTarget, TargetWidget) == 0x000000, "Member 'WBP_IngameMenu_Repair_C_GetDefaultFocusTarget::TargetWidget' has a wrong offset!");

// Function WBP_IngameMenu_Repair.WBP_IngameMenu_Repair_C.HideRepairItemInfo
// 0x0020 (0x0020 - 0x0000)
struct WBP_IngameMenu_Repair_C_HideRepairItemInfo final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_IngameMenuConstruction_InfoItem_C* CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
