#pragma once

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Pal_structs.hpp"


namespace PalServer::Params
{

// Function WBP_MainMenu_Pal_Skill_Passive.WBP_MainMenu_Pal_Skill_Passive_C.BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Pal_Skill_Passive_C_BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Pal_Skill_Passive_C_BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Pal_Skill_Passive_C_BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Pal_Skill_Passive_C_BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MainMenu_Pal_Skill_Passive_C_BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MainMenu_Pal_Skill_Passive.WBP_MainMenu_Pal_Skill_Passive_C.BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Pal_Skill_Passive_C_BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Pal_Skill_Passive_C_BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Pal_Skill_Passive_C_BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Pal_Skill_Passive_C_BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MainMenu_Pal_Skill_Passive_C_BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_BndEvt__WBP_MainMenu_Pal_Skill_Passive_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MainMenu_Pal_Skill_Passive.WBP_MainMenu_Pal_Skill_Passive_C.ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive
// 0x0048 (0x0048 - 0x0000)
struct WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive) == 0x000008, "Wrong alignment on WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive");
static_assert(sizeof(WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive) == 0x000048, "Wrong size on WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive, EntryPoint) == 0x000000, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive, CallFunc_PlayAnimation_ReturnValue_1) == 0x000018, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive, CallFunc_PlayAnimation_ReturnValue_2) == 0x000020, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive, CallFunc_PlayAnimation_ReturnValue_3) == 0x000028, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive, CallFunc_PlayAnimation_ReturnValue_4) == 0x000030, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive, CallFunc_PlayAnimation_ReturnValue_5) == 0x000038, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive, K2Node_ComponentBoundEvent_Button_1) == 0x000040, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_ExecuteUbergraph_WBP_MainMenu_Pal_Skill_Passive::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");

// Function WBP_MainMenu_Pal_Skill_Passive.WBP_MainMenu_Pal_Skill_Passive_C.GetBindedPassiveSkillName
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Pal_Skill_Passive_C_GetBindedPassiveSkillName final
{
public:
	class FName                                   PassiveSkillName;                                  // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Pal_Skill_Passive_C_GetBindedPassiveSkillName) == 0x000004, "Wrong alignment on WBP_MainMenu_Pal_Skill_Passive_C_GetBindedPassiveSkillName");
static_assert(sizeof(WBP_MainMenu_Pal_Skill_Passive_C_GetBindedPassiveSkillName) == 0x000008, "Wrong size on WBP_MainMenu_Pal_Skill_Passive_C_GetBindedPassiveSkillName");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_GetBindedPassiveSkillName, PassiveSkillName) == 0x000000, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_GetBindedPassiveSkillName::PassiveSkillName' has a wrong offset!");

// Function WBP_MainMenu_Pal_Skill_Passive.WBP_MainMenu_Pal_Skill_Passive_C.OnHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Pal_Skill_Passive_C_OnHovered__DelegateSignature final
{
public:
	class UWBP_MainMenu_Pal_Skill_Passive_C*      SelfWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Pal_Skill_Passive_C_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Pal_Skill_Passive_C_OnHovered__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Pal_Skill_Passive_C_OnHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_MainMenu_Pal_Skill_Passive_C_OnHovered__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_OnHovered__DelegateSignature, SelfWidget) == 0x000000, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_OnHovered__DelegateSignature::SelfWidget' has a wrong offset!");

// Function WBP_MainMenu_Pal_Skill_Passive.WBP_MainMenu_Pal_Skill_Passive_C.OnUnhovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MainMenu_Pal_Skill_Passive_C_OnUnhovered__DelegateSignature final
{
public:
	class UWBP_MainMenu_Pal_Skill_Passive_C*      SelfWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Pal_Skill_Passive_C_OnUnhovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MainMenu_Pal_Skill_Passive_C_OnUnhovered__DelegateSignature");
static_assert(sizeof(WBP_MainMenu_Pal_Skill_Passive_C_OnUnhovered__DelegateSignature) == 0x000008, "Wrong size on WBP_MainMenu_Pal_Skill_Passive_C_OnUnhovered__DelegateSignature");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_OnUnhovered__DelegateSignature, SelfWidget) == 0x000000, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_OnUnhovered__DelegateSignature::SelfWidget' has a wrong offset!");

// Function WBP_MainMenu_Pal_Skill_Passive.WBP_MainMenu_Pal_Skill_Passive_C.SetPassiveSkill
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill final
{
public:
	class FName                                   SkillName;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_2;                            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_3;                            // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_4;                            // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3B[0x5];                                       // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPassiveSkillName_outName;              // 0x0040(0x0018)()
	class UPalPassiveSkillManager*                CallFunc_GetPassiveSkillManager_ReturnValue;       // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalPassiveSkillDatabaseRow            CallFunc_GetSkillData_outSkillData;                // 0x0060(0x0050)()
	bool                                          CallFunc_GetSkillData_ReturnValue;                 // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B3[0x1];                                       // 0x00B3(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Abs_Int_ReturnValue;                      // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill) == 0x000008, "Wrong alignment on WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill");
static_assert(sizeof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill) == 0x0000C8, "Wrong size on WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, SkillName) == 0x000000, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::SkillName' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, Temp_int_Variable) == 0x000008, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, Temp_object_Variable) == 0x000010, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, Temp_object_Variable_1) == 0x000018, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, Temp_object_Variable_2) == 0x000020, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::Temp_object_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, Temp_object_Variable_3) == 0x000028, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::Temp_object_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, Temp_object_Variable_4) == 0x000030, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::Temp_object_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, Temp_bool_Variable) == 0x000038, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, Temp_byte_Variable) == 0x000039, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, Temp_byte_Variable_1) == 0x00003A, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, CallFunc_GetPassiveSkillName_outName) == 0x000040, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::CallFunc_GetPassiveSkillName_outName' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, CallFunc_GetPassiveSkillManager_ReturnValue) == 0x000058, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::CallFunc_GetPassiveSkillManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, CallFunc_GetSkillData_outSkillData) == 0x000060, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::CallFunc_GetSkillData_outSkillData' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, CallFunc_GetSkillData_ReturnValue) == 0x0000B0, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::CallFunc_GetSkillData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, CallFunc_Greater_IntInt_ReturnValue) == 0x0000B1, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, K2Node_Select_Default) == 0x0000B2, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, CallFunc_Abs_Int_ReturnValue) == 0x0000B4, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::CallFunc_Abs_Int_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, K2Node_SwitchInteger_CmpSuccess) == 0x0000B8, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill, K2Node_Select_Default_1) == 0x0000C0, "Member 'WBP_MainMenu_Pal_Skill_Passive_C_SetPassiveSkill::K2Node_Select_Default_1' has a wrong offset!");

}

