#pragma once

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace PalSDK::Params
{

// Function BP_Action_Unique_WeaselDragon_FlyingTackle.BP_Action_Unique_WeaselDragon_FlyingTackle_C.ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle
// 0x00E8 (0x00E8 - 0x0000)
struct BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x002C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x003C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0044(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0054(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x005C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue;                  // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x7];                                       // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_2;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Montage_GetPosition_ReturnValue;          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Montage_IsPlaying_ReturnValue;            // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B6[0x2];                                       // 0x00B6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_3;         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetTrainerPlayer_ReturnValue;             // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x3];                                       // 0x00C9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x00CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DC[0x4];                                       // 0x00DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle) == 0x000008, "Wrong alignment on BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle");
static_assert(sizeof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle) == 0x0000E8, "Wrong size on BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, EntryPoint) == 0x000000, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, K2Node_CustomEvent_NotifyName_4) == 0x000004, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, K2Node_CustomEvent_NotifyName_3) == 0x00000C, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, K2Node_CreateDelegate_OutputDelegate) == 0x000014, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, K2Node_CustomEvent_NotifyName_2) == 0x000024, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, K2Node_CreateDelegate_OutputDelegate_1) == 0x00002C, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, K2Node_CustomEvent_NotifyName_1) == 0x00003C, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, K2Node_CreateDelegate_OutputDelegate_2) == 0x000044, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, K2Node_CustomEvent_NotifyName) == 0x000054, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, K2Node_CreateDelegate_OutputDelegate_3) == 0x00005C, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, Temp_name_Variable) == 0x00006C, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, K2Node_Event_DeltaTime) == 0x000074, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, CallFunc_GetActionCharacter_ReturnValue) == 0x000078, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000080, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, CallFunc_GetMainMesh_ReturnValue) == 0x000088, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::CallFunc_GetMainMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000090, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, CallFunc_IsValid_ReturnValue) == 0x000098, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, CallFunc_GetActionCharacter_ReturnValue_2) == 0x0000A0, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::CallFunc_GetActionCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, CallFunc_GetAnimInstance_ReturnValue) == 0x0000A8, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, CallFunc_Montage_GetPosition_ReturnValue) == 0x0000B0, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::CallFunc_Montage_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, CallFunc_Montage_IsPlaying_ReturnValue) == 0x0000B4, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::CallFunc_Montage_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000B5, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, CallFunc_GetActionCharacter_ReturnValue_3) == 0x0000B8, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::CallFunc_GetActionCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, CallFunc_GetTrainerPlayer_ReturnValue) == 0x0000C0, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::CallFunc_GetTrainerPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, CallFunc_IsValid_ReturnValue_1) == 0x0000C8, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, K2Node_CreateDelegate_OutputDelegate_4) == 0x0000CC, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x0000E0, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_ExecuteUbergraph_BP_Action_Unique_WeaselDragon_FlyingTackle::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function BP_Action_Unique_WeaselDragon_FlyingTackle.BP_Action_Unique_WeaselDragon_FlyingTackle_C.GetTargetPosition
// 0x0088 (0x0088 - 0x0000)
struct BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition final
{
public:
	struct FVector                                Position;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTargetLocation_ReturnValue;            // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetTrainerPlayer_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterParameterComponent*        CallFunc_GetComponentByClass_ReturnValue;          // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalRideMarkerComponent*                CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetOverrideTargetLocation_ConsiderRide_ReturnValue; // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetRiderCharacter_ReturnValue;            // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition) == 0x000008, "Wrong alignment on BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition");
static_assert(sizeof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition) == 0x000088, "Wrong size on BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition, Position) == 0x000000, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition::Position' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition, CallFunc_GetTargetLocation_ReturnValue) == 0x000018, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition::CallFunc_GetTargetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition, CallFunc_GetActionCharacter_ReturnValue) == 0x000030, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition, CallFunc_GetTrainerPlayer_ReturnValue) == 0x000038, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition::CallFunc_GetTrainerPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000040, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition, CallFunc_GetComponentByClass_ReturnValue) == 0x000048, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000050, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition, CallFunc_GetOverrideTargetLocation_ConsiderRide_ReturnValue) == 0x000058, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition::CallFunc_GetOverrideTargetLocation_ConsiderRide_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition, CallFunc_GetRiderCharacter_ReturnValue) == 0x000078, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition::CallFunc_GetRiderCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition, CallFunc_IsValid_ReturnValue_1) == 0x000080, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_GetTargetPosition::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_Action_Unique_WeaselDragon_FlyingTackle.BP_Action_Unique_WeaselDragon_FlyingTackle_C.Lookat
// 0x00D0 (0x00D0 - 0x0000)
struct BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat final
{
public:
	double                                        Speed;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetTargetPosition_Position;               // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_8C[0x4];                                       // 0x008C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RInterpTo_ReturnValue;                    // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x3];                                       // 0x00C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RInterpTo_InterpSpeed_ImplicitCast;       // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RInterpTo_DeltaTime_ImplicitCast;         // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat) == 0x000008, "Wrong alignment on BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat");
static_assert(sizeof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat) == 0x0000D0, "Wrong size on BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, Speed) == 0x000000, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::Speed' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_GetTargetPosition_Position) == 0x000008, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_GetTargetPosition_Position' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000020, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_GetActionCharacter_ReturnValue) == 0x000028, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000030, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000038, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_FindLookAtRotation_ReturnValue) == 0x000068, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_BreakRotator_Roll) == 0x000080, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_BreakRotator_Pitch) == 0x000084, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_BreakRotator_Yaw) == 0x000088, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_MakeRotator_ReturnValue) == 0x000090, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_RInterpTo_ReturnValue) == 0x0000A8, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_RInterpTo_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_K2_SetActorRotation_ReturnValue) == 0x0000C0, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_K2_SetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_RInterpTo_InterpSpeed_ImplicitCast) == 0x0000C4, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_RInterpTo_InterpSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat, CallFunc_RInterpTo_DeltaTime_ImplicitCast) == 0x0000C8, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_Lookat::CallFunc_RInterpTo_DeltaTime_ImplicitCast' has a wrong offset!");

// Function BP_Action_Unique_WeaselDragon_FlyingTackle.BP_Action_Unique_WeaselDragon_FlyingTackle_C.OnBlendOut_F3019064403B31061FF5A2B76E1C395E
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnBlendOut_F3019064403B31061FF5A2B76E1C395E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnBlendOut_F3019064403B31061FF5A2B76E1C395E) == 0x000004, "Wrong alignment on BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnBlendOut_F3019064403B31061FF5A2B76E1C395E");
static_assert(sizeof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnBlendOut_F3019064403B31061FF5A2B76E1C395E) == 0x000008, "Wrong size on BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnBlendOut_F3019064403B31061FF5A2B76E1C395E");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnBlendOut_F3019064403B31061FF5A2B76E1C395E, NotifyName) == 0x000000, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnBlendOut_F3019064403B31061FF5A2B76E1C395E::NotifyName' has a wrong offset!");

// Function BP_Action_Unique_WeaselDragon_FlyingTackle.BP_Action_Unique_WeaselDragon_FlyingTackle_C.OnCompleted_F3019064403B31061FF5A2B76E1C395E
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnCompleted_F3019064403B31061FF5A2B76E1C395E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnCompleted_F3019064403B31061FF5A2B76E1C395E) == 0x000004, "Wrong alignment on BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnCompleted_F3019064403B31061FF5A2B76E1C395E");
static_assert(sizeof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnCompleted_F3019064403B31061FF5A2B76E1C395E) == 0x000008, "Wrong size on BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnCompleted_F3019064403B31061FF5A2B76E1C395E");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnCompleted_F3019064403B31061FF5A2B76E1C395E, NotifyName) == 0x000000, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnCompleted_F3019064403B31061FF5A2B76E1C395E::NotifyName' has a wrong offset!");

// Function BP_Action_Unique_WeaselDragon_FlyingTackle.BP_Action_Unique_WeaselDragon_FlyingTackle_C.OnInterrupted_F3019064403B31061FF5A2B76E1C395E
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnInterrupted_F3019064403B31061FF5A2B76E1C395E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnInterrupted_F3019064403B31061FF5A2B76E1C395E) == 0x000004, "Wrong alignment on BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnInterrupted_F3019064403B31061FF5A2B76E1C395E");
static_assert(sizeof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnInterrupted_F3019064403B31061FF5A2B76E1C395E) == 0x000008, "Wrong size on BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnInterrupted_F3019064403B31061FF5A2B76E1C395E");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnInterrupted_F3019064403B31061FF5A2B76E1C395E, NotifyName) == 0x000000, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnInterrupted_F3019064403B31061FF5A2B76E1C395E::NotifyName' has a wrong offset!");

// Function BP_Action_Unique_WeaselDragon_FlyingTackle.BP_Action_Unique_WeaselDragon_FlyingTackle_C.OnNotifyBegin_F3019064403B31061FF5A2B76E1C395E
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnNotifyBegin_F3019064403B31061FF5A2B76E1C395E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnNotifyBegin_F3019064403B31061FF5A2B76E1C395E) == 0x000004, "Wrong alignment on BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnNotifyBegin_F3019064403B31061FF5A2B76E1C395E");
static_assert(sizeof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnNotifyBegin_F3019064403B31061FF5A2B76E1C395E) == 0x000008, "Wrong size on BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnNotifyBegin_F3019064403B31061FF5A2B76E1C395E");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnNotifyBegin_F3019064403B31061FF5A2B76E1C395E, NotifyName) == 0x000000, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnNotifyBegin_F3019064403B31061FF5A2B76E1C395E::NotifyName' has a wrong offset!");

// Function BP_Action_Unique_WeaselDragon_FlyingTackle.BP_Action_Unique_WeaselDragon_FlyingTackle_C.OnNotifyEnd_F3019064403B31061FF5A2B76E1C395E
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnNotifyEnd_F3019064403B31061FF5A2B76E1C395E final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnNotifyEnd_F3019064403B31061FF5A2B76E1C395E) == 0x000004, "Wrong alignment on BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnNotifyEnd_F3019064403B31061FF5A2B76E1C395E");
static_assert(sizeof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnNotifyEnd_F3019064403B31061FF5A2B76E1C395E) == 0x000008, "Wrong size on BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnNotifyEnd_F3019064403B31061FF5A2B76E1C395E");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnNotifyEnd_F3019064403B31061FF5A2B76E1C395E, NotifyName) == 0x000000, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_OnNotifyEnd_F3019064403B31061FF5A2B76E1C395E::NotifyName' has a wrong offset!");

// Function BP_Action_Unique_WeaselDragon_FlyingTackle.BP_Action_Unique_WeaselDragon_FlyingTackle_C.TickAction
// 0x0004 (0x0004 - 0x0000)
struct BP_Action_Unique_WeaselDragon_FlyingTackle_C_TickAction final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_TickAction) == 0x000004, "Wrong alignment on BP_Action_Unique_WeaselDragon_FlyingTackle_C_TickAction");
static_assert(sizeof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_TickAction) == 0x000004, "Wrong size on BP_Action_Unique_WeaselDragon_FlyingTackle_C_TickAction");
static_assert(offsetof(BP_Action_Unique_WeaselDragon_FlyingTackle_C_TickAction, DeltaTime) == 0x000000, "Member 'BP_Action_Unique_WeaselDragon_FlyingTackle_C_TickAction::DeltaTime' has a wrong offset!");

}

