#pragma once

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Pal_structs.hpp"
#include "Engine_structs.hpp"


namespace PalSDK::Params
{

// Function BP_ActionSleepPlayerBed.BP_ActionSleepPlayerBed_C.AttachBedCamera
// 0x0030 (0x0030 - 0x0000)
struct BP_ActionSleepPlayerBed_C_AttachBedCamera final
{
public:
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_PlayerBedCamera_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetViewTarget_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionSleepPlayerBed_C_AttachBedCamera) == 0x000008, "Wrong alignment on BP_ActionSleepPlayerBed_C_AttachBedCamera");
static_assert(sizeof(BP_ActionSleepPlayerBed_C_AttachBedCamera) == 0x000030, "Wrong size on BP_ActionSleepPlayerBed_C_AttachBedCamera");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_AttachBedCamera, CallFunc_GetActionCharacter_ReturnValue) == 0x000000, "Member 'BP_ActionSleepPlayerBed_C_AttachBedCamera::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_AttachBedCamera, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000008, "Member 'BP_ActionSleepPlayerBed_C_AttachBedCamera::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_AttachBedCamera, CallFunc_IsLocallyControlled_ReturnValue) == 0x000010, "Member 'BP_ActionSleepPlayerBed_C_AttachBedCamera::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_AttachBedCamera, CallFunc_FinishSpawningActor_ReturnValue) == 0x000018, "Member 'BP_ActionSleepPlayerBed_C_AttachBedCamera::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_AttachBedCamera, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000020, "Member 'BP_ActionSleepPlayerBed_C_AttachBedCamera::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_AttachBedCamera, CallFunc_GetViewTarget_ReturnValue) == 0x000028, "Member 'BP_ActionSleepPlayerBed_C_AttachBedCamera::CallFunc_GetViewTarget_ReturnValue' has a wrong offset!");

// Function BP_ActionSleepPlayerBed.BP_ActionSleepPlayerBed_C.Check Sleep Loop
// 0x0030 (0x0030 - 0x0000)
struct BP_ActionSleepPlayerBed_C_Check_Sleep_Loop final
{
public:
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3[0x5];                                        // 0x0003(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           CallFunc_GetMontage_Montage;                       // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Montage_IsPlaying_ReturnValue;            // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionSleepPlayerBed_C_Check_Sleep_Loop) == 0x000008, "Wrong alignment on BP_ActionSleepPlayerBed_C_Check_Sleep_Loop");
static_assert(sizeof(BP_ActionSleepPlayerBed_C_Check_Sleep_Loop) == 0x000030, "Wrong size on BP_ActionSleepPlayerBed_C_Check_Sleep_Loop");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Check_Sleep_Loop, Temp_bool_Has_Been_Initd_Variable) == 0x000000, "Member 'BP_ActionSleepPlayerBed_C_Check_Sleep_Loop::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Check_Sleep_Loop, Temp_bool_IsClosed_Variable) == 0x000001, "Member 'BP_ActionSleepPlayerBed_C_Check_Sleep_Loop::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Check_Sleep_Loop, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000002, "Member 'BP_ActionSleepPlayerBed_C_Check_Sleep_Loop::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Check_Sleep_Loop, CallFunc_GetMontage_Montage) == 0x000008, "Member 'BP_ActionSleepPlayerBed_C_Check_Sleep_Loop::CallFunc_GetMontage_Montage' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Check_Sleep_Loop, CallFunc_GetActionCharacter_ReturnValue) == 0x000010, "Member 'BP_ActionSleepPlayerBed_C_Check_Sleep_Loop::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Check_Sleep_Loop, CallFunc_GetMainMesh_ReturnValue) == 0x000018, "Member 'BP_ActionSleepPlayerBed_C_Check_Sleep_Loop::CallFunc_GetMainMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Check_Sleep_Loop, CallFunc_GetAnimInstance_ReturnValue) == 0x000020, "Member 'BP_ActionSleepPlayerBed_C_Check_Sleep_Loop::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Check_Sleep_Loop, CallFunc_Montage_IsPlaying_ReturnValue) == 0x000028, "Member 'BP_ActionSleepPlayerBed_C_Check_Sleep_Loop::CallFunc_Montage_IsPlaying_ReturnValue' has a wrong offset!");

// Function BP_ActionSleepPlayerBed.BP_ActionSleepPlayerBed_C.Detach Bed Camera
// 0x00B0 (0x00B0 - 0x0000)
struct BP_ActionSleepPlayerBed_C_Detach_Bed_Camera final
{
public:
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue;      // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_RotatorFromAxisAndAngle_ReturnValue_1;    // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue;              // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_ComposeRotators_ReturnValue_1;            // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalControlActor_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionSleepPlayerBed_C_Detach_Bed_Camera) == 0x000008, "Wrong alignment on BP_ActionSleepPlayerBed_C_Detach_Bed_Camera");
static_assert(sizeof(BP_ActionSleepPlayerBed_C_Detach_Bed_Camera) == 0x0000B0, "Wrong size on BP_ActionSleepPlayerBed_C_Detach_Bed_Camera");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Detach_Bed_Camera, CallFunc_GetActionCharacter_ReturnValue) == 0x000000, "Member 'BP_ActionSleepPlayerBed_C_Detach_Bed_Camera::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Detach_Bed_Camera, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'BP_ActionSleepPlayerBed_C_Detach_Bed_Camera::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Detach_Bed_Camera, CallFunc_GetRightVector_ReturnValue) == 0x000020, "Member 'BP_ActionSleepPlayerBed_C_Detach_Bed_Camera::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Detach_Bed_Camera, CallFunc_RotatorFromAxisAndAngle_ReturnValue) == 0x000038, "Member 'BP_ActionSleepPlayerBed_C_Detach_Bed_Camera::CallFunc_RotatorFromAxisAndAngle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Detach_Bed_Camera, CallFunc_RotatorFromAxisAndAngle_ReturnValue_1) == 0x000050, "Member 'BP_ActionSleepPlayerBed_C_Detach_Bed_Camera::CallFunc_RotatorFromAxisAndAngle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Detach_Bed_Camera, CallFunc_ComposeRotators_ReturnValue) == 0x000068, "Member 'BP_ActionSleepPlayerBed_C_Detach_Bed_Camera::CallFunc_ComposeRotators_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Detach_Bed_Camera, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000080, "Member 'BP_ActionSleepPlayerBed_C_Detach_Bed_Camera::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Detach_Bed_Camera, CallFunc_ComposeRotators_ReturnValue_1) == 0x000088, "Member 'BP_ActionSleepPlayerBed_C_Detach_Bed_Camera::CallFunc_ComposeRotators_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Detach_Bed_Camera, CallFunc_GetActionCharacter_ReturnValue_1) == 0x0000A0, "Member 'BP_ActionSleepPlayerBed_C_Detach_Bed_Camera::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Detach_Bed_Camera, CallFunc_IsLocalControlActor_ReturnValue) == 0x0000A8, "Member 'BP_ActionSleepPlayerBed_C_Detach_Bed_Camera::CallFunc_IsLocalControlActor_ReturnValue' has a wrong offset!");

// Function BP_ActionSleepPlayerBed.BP_ActionSleepPlayerBed_C.Disable Movement
// 0x0050 (0x0050 - 0x0000)
struct BP_ActionSleepPlayerBed_C_Disable_Movement final
{
public:
	bool                                          Disable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerController*                   PalPlayerController;                               // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterMovementComponent*         CharacterMovementComponent;                        // 0x0010(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerController*                   K2Node_DynamicCast_AsPal_Player_Controller;        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterMovementComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionSleepPlayerBed_C_Disable_Movement) == 0x000008, "Wrong alignment on BP_ActionSleepPlayerBed_C_Disable_Movement");
static_assert(sizeof(BP_ActionSleepPlayerBed_C_Disable_Movement) == 0x000050, "Wrong size on BP_ActionSleepPlayerBed_C_Disable_Movement");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Disable_Movement, Disable) == 0x000000, "Member 'BP_ActionSleepPlayerBed_C_Disable_Movement::Disable' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Disable_Movement, PalPlayerController) == 0x000008, "Member 'BP_ActionSleepPlayerBed_C_Disable_Movement::PalPlayerController' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Disable_Movement, CharacterMovementComponent) == 0x000010, "Member 'BP_ActionSleepPlayerBed_C_Disable_Movement::CharacterMovementComponent' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Disable_Movement, CallFunc_GetActionCharacter_ReturnValue) == 0x000018, "Member 'BP_ActionSleepPlayerBed_C_Disable_Movement::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Disable_Movement, CallFunc_GetController_ReturnValue) == 0x000020, "Member 'BP_ActionSleepPlayerBed_C_Disable_Movement::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Disable_Movement, K2Node_DynamicCast_AsPal_Player_Controller) == 0x000028, "Member 'BP_ActionSleepPlayerBed_C_Disable_Movement::K2Node_DynamicCast_AsPal_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Disable_Movement, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_ActionSleepPlayerBed_C_Disable_Movement::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Disable_Movement, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000038, "Member 'BP_ActionSleepPlayerBed_C_Disable_Movement::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Disable_Movement, CallFunc_GetComponentByClass_ReturnValue) == 0x000040, "Member 'BP_ActionSleepPlayerBed_C_Disable_Movement::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_Disable_Movement, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'BP_ActionSleepPlayerBed_C_Disable_Movement::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ActionSleepPlayerBed.BP_ActionSleepPlayerBed_C.DisableInteract
// 0x0020 (0x0020 - 0x0000)
struct BP_ActionSleepPlayerBed_C_DisableInteract final
{
public:
	bool                                          Disable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalInteractComponent*                  CallFunc_GetComponentByClass_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionSleepPlayerBed_C_DisableInteract) == 0x000008, "Wrong alignment on BP_ActionSleepPlayerBed_C_DisableInteract");
static_assert(sizeof(BP_ActionSleepPlayerBed_C_DisableInteract) == 0x000020, "Wrong size on BP_ActionSleepPlayerBed_C_DisableInteract");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableInteract, Disable) == 0x000000, "Member 'BP_ActionSleepPlayerBed_C_DisableInteract::Disable' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableInteract, CallFunc_GetActionCharacter_ReturnValue) == 0x000008, "Member 'BP_ActionSleepPlayerBed_C_DisableInteract::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableInteract, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_ActionSleepPlayerBed_C_DisableInteract::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableInteract, CallFunc_GetComponentByClass_ReturnValue) == 0x000018, "Member 'BP_ActionSleepPlayerBed_C_DisableInteract::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_ActionSleepPlayerBed.BP_ActionSleepPlayerBed_C.DisableLocalPlayerInput
// 0x0030 (0x0030 - 0x0000)
struct BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput final
{
public:
	bool                                          Disable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_PalPlayerController_C*              K2Node_DynamicCast_AsBP_Pal_Player_Controller;     // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput) == 0x000008, "Wrong alignment on BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput");
static_assert(sizeof(BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput) == 0x000030, "Wrong size on BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput, Disable) == 0x000000, "Member 'BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput::Disable' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput, CallFunc_GetActionCharacter_ReturnValue) == 0x000008, "Member 'BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput, CallFunc_IsLocallyControlled_ReturnValue) == 0x000010, "Member 'BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput::CallFunc_IsLocallyControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput, CallFunc_GetController_ReturnValue) == 0x000018, "Member 'BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput, K2Node_DynamicCast_AsBP_Pal_Player_Controller) == 0x000020, "Member 'BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput::K2Node_DynamicCast_AsBP_Pal_Player_Controller' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_ActionSleepPlayerBed_C_DisableLocalPlayerInput::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function BP_ActionSleepPlayerBed.BP_ActionSleepPlayerBed_C.DisableShooter
// 0x0028 (0x0028 - 0x0000)
struct BP_ActionSleepPlayerBed_C_DisableShooter final
{
public:
	bool                                          Disable;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalShooterFlagContainerPriority              Priority;                                          // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalShooterComponent*                   Shooter;                                           // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalShooterComponent*                   CallFunc_GetComponentByClass_ReturnValue;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionSleepPlayerBed_C_DisableShooter) == 0x000008, "Wrong alignment on BP_ActionSleepPlayerBed_C_DisableShooter");
static_assert(sizeof(BP_ActionSleepPlayerBed_C_DisableShooter) == 0x000028, "Wrong size on BP_ActionSleepPlayerBed_C_DisableShooter");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableShooter, Disable) == 0x000000, "Member 'BP_ActionSleepPlayerBed_C_DisableShooter::Disable' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableShooter, Priority) == 0x000001, "Member 'BP_ActionSleepPlayerBed_C_DisableShooter::Priority' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableShooter, Shooter) == 0x000008, "Member 'BP_ActionSleepPlayerBed_C_DisableShooter::Shooter' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableShooter, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_ActionSleepPlayerBed_C_DisableShooter::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableShooter, CallFunc_GetActionCharacter_ReturnValue) == 0x000018, "Member 'BP_ActionSleepPlayerBed_C_DisableShooter::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_DisableShooter, CallFunc_GetComponentByClass_ReturnValue) == 0x000020, "Member 'BP_ActionSleepPlayerBed_C_DisableShooter::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");

// Function BP_ActionSleepPlayerBed.BP_ActionSleepPlayerBed_C.ExecuteUbergraph_BP_ActionSleepPlayerBed
// 0x0560 (0x0560 - 0x0000)
struct BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Temp_name_Variable;                                // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable;                            // 0x0014(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> Temp_delegate_Variable_1;                          // 0x0024(0x0010)(ConstParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x3];                                       // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaTime;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0050(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_2;         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_K2_SetActorTransform_SweepHitResult;      // 0x00C8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorTransform_ReturnValue;         // 0x01B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B1[0x7];                                      // 0x01B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_3;         // 0x01B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_4;         // 0x01C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterParameterComponent*        CallFunc_GetComponentByClass_ReturnValue;          // 0x01C8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterParameterComponent*        CallFunc_GetComponentByClass_ReturnValue_1;        // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetMontage_Montage;                       // 0x01D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_5;         // 0x01E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetMontage_Montage_1;                     // 0x01E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue;                  // 0x01F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetMontage_Montage_2;                     // 0x01F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0200(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0208(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_209[0x7];                                      // 0x0209(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_6;         // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetMontage_Montage_3;                     // 0x0218(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_7;         // 0x0220(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetMontage_Montage_4;                     // 0x0228(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetMontage_Montage_5;                     // 0x0230(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalTimeManager*                        CallFunc_GetTimeManager_ReturnValue;               // 0x0238(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_8;         // 0x0240(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalTimeManager*                        CallFunc_GetTimeManager_ReturnValue_1;             // 0x0248(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    K2Node_DynamicCast_AsPal_Player_Character;         // 0x0250(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_9;         // 0x0260(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    K2Node_DynamicCast_AsPal_Player_Character_1;       // 0x0268(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_271[0x7];                                      // 0x0271(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0278(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue_1;              // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDDispatchParameter_FadeWidget*    CallFunc_SpawnObject_ReturnValue;                  // 0x0288(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate;              // 0x0290(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x02A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_10;        // 0x02B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue_2;              // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_11;        // 0x02C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalTimeManager*                        CallFunc_GetTimeManager_ReturnValue_2;             // 0x02C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x02D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_12;        // 0x02E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue_1;                // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CallFunc_GetMontage_Montage_6;                     // 0x02F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x02F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Montage_IsPlaying_ReturnValue;            // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x3];                                      // 0x0301(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0304(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x030C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x0310(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_314[0x4];                                      // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_13;        // 0x0318(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue;          // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_321[0x7];                                      // 0x0321(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalTimeManager*                        CallFunc_GetTimeManager_ReturnValue_3;             // 0x0328(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0330(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0340(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_14;        // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_1;        // 0x0358(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_359[0x3];                                      // 0x0359(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x035C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x036C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36D[0x3];                                      // 0x036D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0370(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_15;        // 0x0378(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_2;        // 0x0380(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_381[0x7];                                      // 0x0381(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_16;        // 0x0388(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_3;        // 0x0390(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_391[0x7];                                      // 0x0391(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalTimeManager*                        CallFunc_GetTimeManager_ReturnValue_4;             // 0x0398(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x03A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_17;        // 0x03B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_18;        // 0x03B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x03C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C1[0x7];                                      // 0x03C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    K2Node_DynamicCast_AsPal_Player_Character_2;       // 0x03C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x03D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3D1[0x7];                                      // 0x03D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalTimeManager*                        CallFunc_GetTimeManager_ReturnValue_5;             // 0x03D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_7;            // 0x03E0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_19;        // 0x03F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    K2Node_DynamicCast_AsPal_Player_Character_3;       // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalTimeManager*                        CallFunc_GetTimeManager_ReturnValue_6;             // 0x0408(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_20;        // 0x0410(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0430(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0434(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0438(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_43C[0x4];                                      // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0440(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_SetActorRotation_ReturnValue;          // 0x0458(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_459[0x7];                                      // 0x0459(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0460(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x0468(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerController*                   K2Node_DynamicCast_AsPal_Player_Controller;        // 0x0478(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_21;        // 0x0488(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocallyControlled_ReturnValue_4;        // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSleepLooping_ReturnValue;               // 0x0491(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0492(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_493[0x1];                                      // 0x0493(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0494(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x049C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49D[0x3];                                      // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue_1;   // 0x04A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerController*                   K2Node_DynamicCast_AsPal_Player_Controller_1;      // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x04B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x04D1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D2[0x6];                                      // 0x04D2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue_1;                   // 0x04D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x04E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E1[0x7];                                      // 0x04E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue_2;   // 0x04E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerController*                   K2Node_DynamicCast_AsPal_Player_Controller_2;      // 0x04F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x04F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F9[0x3];                                      // 0x04F9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_10;           // 0x04FC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_50C[0x4];                                      // 0x050C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_GetControllerLeftStickValue_ReturnValue;  // 0x0510(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize2D_ReturnValue;                      // 0x0520(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetKeyboardMoveValue_ReturnValue;         // 0x0528(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize2D_ReturnValue_1;                    // 0x0538(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0540(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0548(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_549[0x3];                                      // 0x0549(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_VariableSet_FadeInTime_ImplicitCast;        // 0x054C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_FadeOutTime_ImplicitCast;       // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed) == 0x000010, "Wrong alignment on BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed");
static_assert(sizeof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed) == 0x000560, "Wrong size on BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, EntryPoint) == 0x000000, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, K2Node_CustomEvent_NotifyName) == 0x000004, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, Temp_name_Variable) == 0x00000C, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::Temp_name_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, Temp_delegate_Variable) == 0x000014, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::Temp_delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, Temp_delegate_Variable_1) == 0x000024, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::Temp_delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, Temp_bool_IsClosed_Variable) == 0x000034, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, Temp_bool_Has_Been_Initd_Variable) == 0x000035, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, K2Node_CustomEvent_NotifyName_4) == 0x000038, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, Temp_bool_Has_Been_Initd_Variable_1) == 0x000040, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, K2Node_Event_DeltaTime) == 0x000044, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_GetActionCharacter_ReturnValue) == 0x000048, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_GetTransform_ReturnValue) == 0x000050, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_GetActionCharacter_ReturnValue_1) == 0x0000B0, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_GetActionCharacter_ReturnValue_2) == 0x0000B8, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_GetActionCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_HasAuthority_ReturnValue) == 0x0000C0, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_K2_SetActorTransform_SweepHitResult) == 0x0000C8, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_K2_SetActorTransform_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_K2_SetActorTransform_ReturnValue) == 0x0001B0, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_K2_SetActorTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_GetActionCharacter_ReturnValue_3) == 0x0001B8, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_GetActionCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_GetActionCharacter_ReturnValue_4) == 0x0001C0, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_GetActionCharacter_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_GetComponentByClass_ReturnValue) == 0x0001C8, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_GetComponentByClass_ReturnValue_1) == 0x0001D0, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_GetMontage_Montage) == 0x0001D8, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_GetMontage_Montage' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_GetActionCharacter_ReturnValue_5) == 0x0001E0, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_GetActionCharacter_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_GetMontage_Montage_1) == 0x0001E8, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_GetMontage_Montage_1' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_GetMainMesh_ReturnValue) == 0x0001F0, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_GetMainMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed, CallFunc_GetMontage_Montage_2) == 0x0001F8, "Member 'BP_ActionSleepPlayerBed_C_ExecuteUbergraph_BP_ActionSleepPlayerBed::CallFunc_GetMontage_Montage_2' has a wrong offset!");
