#pragma once

#include "Basic.hpp"


namespace PalSDK::Params
{

// Function BP_Action_Unique_VolcanicMonster_Ice_IceAttack.BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C.GetEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C_GetEffect final
{
public:
	class UClass*                                 NewParam;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C_GetEffect) == 0x000008, "Wrong alignment on BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C_GetEffect");
static_assert(sizeof(BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C_GetEffect) == 0x000008, "Wrong size on BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C_GetEffect");
static_assert(offsetof(BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C_GetEffect, NewParam) == 0x000000, "Member 'BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C_GetEffect::NewParam' has a wrong offset!");

// Function BP_Action_Unique_VolcanicMonster_Ice_IceAttack.BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C.GetMontage
// 0x0008 (0x0008 - 0x0000)
struct BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C_GetMontage final
{
public:
	class UAnimMontage*                           NewParam;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C_GetMontage) == 0x000008, "Wrong alignment on BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C_GetMontage");
static_assert(sizeof(BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C_GetMontage) == 0x000008, "Wrong size on BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C_GetMontage");
static_assert(offsetof(BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C_GetMontage, NewParam) == 0x000000, "Member 'BP_Action_Unique_VolcanicMonster_Ice_IceAttack_C_GetMontage::NewParam' has a wrong offset!");

}

