#pragma once

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace PalSDK::Params
{

// Function BP_Action_Unique_Anubis_Tackle.BP_Action_Unique_Anubis_Tackle_C.ChargeAndRotate
// 0x01D0 (0x01D0 - 0x0000)
struct BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                PlayerVelocityY0;                                  // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PlayerAimMoveSpeed;                                // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        AverageSpeed;                                      // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        PredictTime;                                       // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Distance;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActionTarget_ReturnValue;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActionTarget_ReturnValue_1;            // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetVelocity_ReturnValue;                  // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_2;         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActionTarget_ReturnValue_2;            // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0188(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0189(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_18A[0x6];                                      // 0x018A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_3;        // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue_1;                      // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GeneralTurnLinear_DeltaTime_ImplicitCast; // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate) == 0x000008, "Wrong alignment on BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate");
static_assert(sizeof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate) == 0x0001D0, "Wrong size on BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, DeltaTime) == 0x000000, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, PlayerVelocityY0) == 0x000008, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::PlayerVelocityY0' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, PlayerAimMoveSpeed) == 0x000020, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::PlayerAimMoveSpeed' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, AverageSpeed) == 0x000028, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::AverageSpeed' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, PredictTime) == 0x000030, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::PredictTime' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, Distance) == 0x000038, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::Distance' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_GetActionCharacter_ReturnValue) == 0x000040, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000048, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000050, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_GetActionTarget_ReturnValue) == 0x000068, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_GetActionTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000070, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000088, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_Add_VectorVector_ReturnValue) == 0x0000A0, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0000B8, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_Normal_ReturnValue) == 0x0000D0, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000E8, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000100, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_GetActionTarget_ReturnValue_1) == 0x000108, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_GetActionTarget_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_GetVelocity_ReturnValue) == 0x000110, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_GetVelocity_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_GetActionCharacter_ReturnValue_2) == 0x000128, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_GetActionCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_BreakVector_X) == 0x000130, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_BreakVector_Y) == 0x000138, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_BreakVector_Z) == 0x000140, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000148, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_MakeVector_ReturnValue) == 0x000160, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_VSize_ReturnValue) == 0x000178, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_VSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_GetActionTarget_ReturnValue_2) == 0x000180, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_GetActionTarget_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000188, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_IsValid_ReturnValue) == 0x000189, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_K2_GetActorLocation_ReturnValue_3) == 0x000190, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_K2_GetActorLocation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x0001A8, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_VSize_ReturnValue_1) == 0x0001C0, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_VSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate, CallFunc_GeneralTurnLinear_DeltaTime_ImplicitCast) == 0x0001C8, "Member 'BP_Action_Unique_Anubis_Tackle_C_ChargeAndRotate::CallFunc_GeneralTurnLinear_DeltaTime_ImplicitCast' has a wrong offset!");

// Function BP_Action_Unique_Anubis_Tackle.BP_Action_Unique_Anubis_Tackle_C.CheckEndTackle
// 0x0118 (0x0118 - 0x0000)
struct BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnd;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                ToVector;                                          // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSizeSquared_ReturnValue;                 // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue;       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue_1;       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x6];                                       // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_DoubleDouble_ReturnValue_1;     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActionTarget_ReturnValue;              // 0x00B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle) == 0x000008, "Wrong alignment on BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle");
static_assert(sizeof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle) == 0x000118, "Wrong size on BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, DeltaTime) == 0x000000, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, IsEnd) == 0x000008, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::IsEnd' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, ToVector) == 0x000010, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::ToVector' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_VSizeSquared_ReturnValue) == 0x000028, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_VSizeSquared_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_Dot_VectorVector_ReturnValue) == 0x000040, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_LessEqual_DoubleDouble_ReturnValue) == 0x000048, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_LessEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_Greater_DoubleDouble_ReturnValue_1) == 0x000049, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_Greater_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_GetActionCharacter_ReturnValue) == 0x000050, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000058, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_LessEqual_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_LessEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_BreakVector_X) == 0x000080, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_BreakVector_Y) == 0x000088, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_BreakVector_Z) == 0x000090, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_MakeVector_ReturnValue) == 0x000098, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_GetActionTarget_ReturnValue) == 0x0000B0, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_GetActionTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000B8, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_BreakVector_X_1) == 0x0000D0, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_BreakVector_Y_1) == 0x0000D8, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_BreakVector_Z_1) == 0x0000E0, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_MakeVector_ReturnValue_1) == 0x0000E8, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000100, "Member 'BP_Action_Unique_Anubis_Tackle_C_CheckEndTackle::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_Action_Unique_Anubis_Tackle.BP_Action_Unique_Anubis_Tackle_C.ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle
// 0x01C8 (0x01C8 - 0x0000)
struct BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_CustomEvent_Montage;                        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue;                  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue;              // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalAnimInstance*                       K2Node_DynamicCast_AsPal_Anim_Instance;            // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckEndTackle_IsEnd;                     // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x007B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_1;         // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue_1;                // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_2;         // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimInstance*                          CallFunc_GetAnimInstance_ReturnValue_1;            // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue_2;                // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Montage_IsPlaying_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue;          // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UNiagaraComponent>       CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x00C0(0x0030)(InstancedReference, UObjectWrapper, HasGetValueTypeHash)
	class UNiagaraComponent*                      CallFunc_SpawnSystemAttached_ReturnValue_1;        // 0x00F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F9[0x7];                                       // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UNiagaraComponent>       CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1; // 0x0100(0x0030)(InstancedReference, UObjectWrapper, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_3;         // 0x0130(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0174(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_4;         // 0x0178(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UAnimMontage* Montage, class FName NotifyName)> K2Node_CreateDelegate_OutputDelegate;              // 0x0180(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_193[0x5];                                      // 0x0193(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue_5;         // 0x0198(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterMovementComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_VariableSet_BrakingFrictionFactor_ImplicitCast; // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1AC[0x4];                                      // 0x01AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_StopMovement_DeltaTime_ImplicitCast;      // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_TackleMovement_DeltaTime_ImplicitCast;    // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CheckEndTackle_DeltaTime_ImplicitCast;    // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle) == 0x000008, "Wrong alignment on BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle");
static_assert(sizeof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle) == 0x0001C8, "Wrong size on BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, EntryPoint) == 0x000000, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_GetActionCharacter_ReturnValue) == 0x000008, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, K2Node_CustomEvent_Montage) == 0x000010, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::K2Node_CustomEvent_Montage' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, K2Node_CustomEvent_NotifyName) == 0x000018, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000020, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000021, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000028, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_GetForwardVector_ReturnValue) == 0x000040, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_GetMainMesh_ReturnValue) == 0x000058, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_GetMainMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_GetAnimInstance_ReturnValue) == 0x000060, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_GetAnimInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, K2Node_Event_DeltaTime) == 0x000068, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, K2Node_DynamicCast_AsPal_Anim_Instance) == 0x000070, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::K2Node_DynamicCast_AsPal_Anim_Instance' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_CheckEndTackle_IsEnd) == 0x000079, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_CheckEndTackle_IsEnd' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, K2Node_SwitchEnum_CmpSuccess) == 0x00007A, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, K2Node_SwitchEnum_CmpSuccess_1) == 0x00007B, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_GetActionCharacter_ReturnValue_1) == 0x000080, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_GetActionCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, K2Node_SwitchEnum_CmpSuccess_2) == 0x000088, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_GetMainMesh_ReturnValue_1) == 0x000090, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_GetMainMesh_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_GetActionCharacter_ReturnValue_2) == 0x000098, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_GetActionCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_GetAnimInstance_ReturnValue_1) == 0x0000A0, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_GetAnimInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_GetMainMesh_ReturnValue_2) == 0x0000A8, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_GetMainMesh_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_Montage_IsPlaying_ReturnValue) == 0x0000B0, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_Montage_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_SpawnSystemAttached_ReturnValue) == 0x0000B8, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_SpawnSystemAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x0000C0, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_SpawnSystemAttached_ReturnValue_1) == 0x0000F0, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_SpawnSystemAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, Temp_bool_Has_Been_Initd_Variable) == 0x0000F8, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1) == 0x000100, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_GetActionCharacter_ReturnValue_3) == 0x000130, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_GetActionCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, Temp_bool_IsClosed_Variable) == 0x000138, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000140, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_GetForwardVector_ReturnValue_1) == 0x000158, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_Array_Add_ReturnValue) == 0x000170, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_Array_Add_ReturnValue_1) == 0x000174, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_GetActionCharacter_ReturnValue_4) == 0x000178, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_GetActionCharacter_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, K2Node_CreateDelegate_OutputDelegate) == 0x000180, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_IsDead_ReturnValue) == 0x000190, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_Not_PreBool_ReturnValue) == 0x000191, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_BooleanAND_ReturnValue) == 0x000192, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_GetActionCharacter_ReturnValue_5) == 0x000198, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_GetActionCharacter_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_GetComponentByClass_ReturnValue) == 0x0001A0, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, K2Node_VariableSet_BrakingFrictionFactor_ImplicitCast) == 0x0001A8, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::K2Node_VariableSet_BrakingFrictionFactor_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_StopMovement_DeltaTime_ImplicitCast) == 0x0001B0, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_StopMovement_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_TackleMovement_DeltaTime_ImplicitCast) == 0x0001B8, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_TackleMovement_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle, CallFunc_CheckEndTackle_DeltaTime_ImplicitCast) == 0x0001C0, "Member 'BP_Action_Unique_Anubis_Tackle_C_ExecuteUbergraph_BP_Action_Unique_Anubis_Tackle::CallFunc_CheckEndTackle_DeltaTime_ImplicitCast' has a wrong offset!");

// Function BP_Action_Unique_Anubis_Tackle.BP_Action_Unique_Anubis_Tackle_C.GetDesiredTransformOfOmenEffect
// 0x02C0 (0x02C0 - 0x0000)
struct BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect final
{
public:
	double                                        ScaleY;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        ScaleZ;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             Transform;                                         // 0x0010(0x0060)(Parm, OutParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetActionTarget_ReturnValue;              // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetActionCharacter_ReturnValue;           // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0098(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue_1;         // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x01B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x01C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x01D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x01E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0200(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0230(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x0248(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0260(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect) == 0x000010, "Wrong alignment on BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect");
static_assert(sizeof(BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect) == 0x0002C0, "Wrong size on BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect, ScaleY) == 0x000000, "Member 'BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect::ScaleY' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect, ScaleZ) == 0x000008, "Member 'BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect::ScaleZ' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect, Transform) == 0x000010, "Member 'BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect::Transform' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect, CallFunc_GetActionTarget_ReturnValue) == 0x000070, "Member 'BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect::CallFunc_GetActionTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect, CallFunc_GetActionCharacter_ReturnValue) == 0x000078, "Member 'BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect::CallFunc_GetActionCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000080, "Member 'BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect, CallFunc_GetActorScale3D_ReturnValue) == 0x000098, "Member 'BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect, CallFunc_Divide_VectorFloat_ReturnValue) == 0x0000B0, "Member 'BP_Action_Unique_Anubis_Tackle_C_GetDesiredTransformOfOmenEffect::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
