#pragma once

#include "Basic.hpp"


namespace PalSDK::Params
{

// Function BP_BuildObject_Light_FirePlace01.BP_BuildObject_Light_FirePlace01_C.ExecuteUbergraph_BP_BuildObject_Light_FirePlace01
// 0x0004 (0x0004 - 0x0000)
struct BP_BuildObject_Light_FirePlace01_C_ExecuteUbergraph_BP_BuildObject_Light_FirePlace01 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildObject_Light_FirePlace01_C_ExecuteUbergraph_BP_BuildObject_Light_FirePlace01) == 0x000004, "Wrong alignment on BP_BuildObject_Light_FirePlace01_C_ExecuteUbergraph_BP_BuildObject_Light_FirePlace01");
static_assert(sizeof(BP_BuildObject_Light_FirePlace01_C_ExecuteUbergraph_BP_BuildObject_Light_FirePlace01) == 0x000004, "Wrong size on BP_BuildObject_Light_FirePlace01_C_ExecuteUbergraph_BP_BuildObject_Light_FirePlace01");
static_assert(offsetof(BP_BuildObject_Light_FirePlace01_C_ExecuteUbergraph_BP_BuildObject_Light_FirePlace01, EntryPoint) == 0x000000, "Member 'BP_BuildObject_Light_FirePlace01_C_ExecuteUbergraph_BP_BuildObject_Light_FirePlace01::EntryPoint' has a wrong offset!");

// Function BP_BuildObject_Light_FirePlace01.BP_BuildObject_Light_FirePlace01_C.SetActiveLight
// 0x0001 (0x0001 - 0x0000)
struct BP_BuildObject_Light_FirePlace01_C_SetActiveLight final
{
public:
	bool                                          bActive;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildObject_Light_FirePlace01_C_SetActiveLight) == 0x000001, "Wrong alignment on BP_BuildObject_Light_FirePlace01_C_SetActiveLight");
static_assert(sizeof(BP_BuildObject_Light_FirePlace01_C_SetActiveLight) == 0x000001, "Wrong size on BP_BuildObject_Light_FirePlace01_C_SetActiveLight");
static_assert(offsetof(BP_BuildObject_Light_FirePlace01_C_SetActiveLight, bActive) == 0x000000, "Member 'BP_BuildObject_Light_FirePlace01_C_SetActiveLight::bActive' has a wrong offset!");

}

