#pragma once

#include "Basic.hpp"


namespace PalSDK::Params
{

// Function BP_BuildObject_CookingStove.BP_BuildObject_CookingStove_C.ExecuteUbergraph_BP_BuildObject_CookingStove
// 0x0004 (0x0004 - 0x0000)
struct BP_BuildObject_CookingStove_C_ExecuteUbergraph_BP_BuildObject_CookingStove final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildObject_CookingStove_C_ExecuteUbergraph_BP_BuildObject_CookingStove) == 0x000004, "Wrong alignment on BP_BuildObject_CookingStove_C_ExecuteUbergraph_BP_BuildObject_CookingStove");
static_assert(sizeof(BP_BuildObject_CookingStove_C_ExecuteUbergraph_BP_BuildObject_CookingStove) == 0x000004, "Wrong size on BP_BuildObject_CookingStove_C_ExecuteUbergraph_BP_BuildObject_CookingStove");
static_assert(offsetof(BP_BuildObject_CookingStove_C_ExecuteUbergraph_BP_BuildObject_CookingStove, EntryPoint) == 0x000000, "Member 'BP_BuildObject_CookingStove_C_ExecuteUbergraph_BP_BuildObject_CookingStove::EntryPoint' has a wrong offset!");

// Function BP_BuildObject_CookingStove.BP_BuildObject_CookingStove_C.SetActive_Internal
// 0x0001 (0x0001 - 0x0000)
struct BP_BuildObject_CookingStove_C_SetActive_Internal final
{
public:
	bool                                          bOn;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_BuildObject_CookingStove_C_SetActive_Internal) == 0x000001, "Wrong alignment on BP_BuildObject_CookingStove_C_SetActive_Internal");
static_assert(sizeof(BP_BuildObject_CookingStove_C_SetActive_Internal) == 0x000001, "Wrong size on BP_BuildObject_CookingStove_C_SetActive_Internal");
static_assert(offsetof(BP_BuildObject_CookingStove_C_SetActive_Internal, bOn) == 0x000000, "Member 'BP_BuildObject_CookingStove_C_SetActive_Internal::bOn' has a wrong offset!");

}

