#pragma once

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "PPSkyCreatorPlugin_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace PalSDK::Params
{

// Function BP_PPSkyCreator_Controller.BP_PPSkyCreator_Controller_C.ExecuteUbergraph_BP_PPSkyCreator_Controller
// 0x1070 (0x1070 - 0x0000)
struct BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_1;               // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPPSkyCreatorWeatherSettings           CallFunc_GetWeatherPresetSettings_ReturnValue;     // 0x0010(0x0458)(NoDestructor)
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x0468(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue;       // 0x046C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_46D[0x3];                                      // 0x046D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x0470(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue;         // 0x0478(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_GetWorldDeltaSeconds_ReturnValue_1;       // 0x0480(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue; // 0x0488(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_48C[0x4];                                      // 0x048C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0490(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTime_ReturnValue;                      // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A4[0x4];                                      // 0x04A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x04A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x04B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x04C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x04CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RandomIntegerInRange_ReturnValue;         // 0x04D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D4[0x4];                                      // 0x04D4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPPSkyCreatorWeatherSettings           CallFunc_GetWeatherSettings_ReturnValue;           // 0x04D8(0x0458)(NoDestructor)
	class UPPSkyCreatorWeatherPreset*             CallFunc_Array_Get_Item;                           // 0x0930(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0938(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0948(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0950(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_IsTimerActiveHandle_ReturnValue_1;     // 0x0958(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_959[0x7];                                      // 0x0959(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPPSkyCreatorWeatherSettings           CallFunc_GetWeatherPresetSettings_ReturnValue_1;   // 0x0960(0x0458)(NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0DB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DB9[0x7];                                      // 0x0DB9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x0DC0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0DD0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_2;               // 0x0DE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DE1[0x7];                                      // 0x0DE1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0DE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0DF0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0E00(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_3;               // 0x0E08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_4;               // 0x0E09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E0A[0x6];                                      // 0x0E0A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0E10(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_3;         // 0x0E18(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPPSkyCreatorWindSettings              CallFunc_GetWindSettings_ReturnValue;              // 0x0E20(0x001C)(NoDestructor)
	struct FPPSkyCreatorWindSettings              K2Node_MakeStruct_PPSkyCreatorWindSettings;        // 0x0E3C(0x001C)(NoDestructor)
	bool                                          CallFunc_HasAuthority_ReturnValue_5;               // 0x0E58(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E59[0x3];                                      // 0x0E59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0E5C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E6C[0x4];                                      // 0x0E6C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_2;        // 0x0E70(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0E78(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_3;        // 0x0E88(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0E90(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_6;               // 0x0EA0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EA1[0x7];                                      // 0x0EA1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_4;        // 0x0EA8(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_5;            // 0x0EB0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_5;        // 0x0EC0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_7;               // 0x0EC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0EC9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue;      // 0x0ECA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_1;          // 0x0ECB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_1;    // 0x0ECC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue;        // 0x0ECD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_1;      // 0x0ECE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ECF[0x1];                                      // 0x0ECF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_6;            // 0x0ED0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_6;        // 0x0EE0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_8;               // 0x0EE8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EE9[0x3];                                      // 0x0EE9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x0EEC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EFC[0x4];                                      // 0x0EFC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_7;        // 0x0F00(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue_2;          // 0x0F08(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_DoubleDouble_ReturnValue_2;    // 0x0F09(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_DoubleDouble_ReturnValue_2;      // 0x0F0A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0F0B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FVector& LightningPosition)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0F0C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1C[0x4];                                      // 0x0F1C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_LightningPosition;              // 0x0F20(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                        CallFunc_SpawnSound2D_ReturnValue;                 // 0x0F38(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalTimeManager*                        CallFunc_GetTimeManager_ReturnValue;               // 0x0F40(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentPalWorldHoursFloat_ReturnValue; // 0x0F48(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F4C[0x4];                                      // 0x0F4C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalTimeManager*                        CallFunc_GetTimeManager_ReturnValue_1;             // 0x0F50(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetCurrentPalWorldHoursFloat_ReturnValue_1; // 0x0F58(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_HasAuthority_ReturnValue_9;               // 0x0F5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F5D[0x3];                                      // 0x0F5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0F60(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0F78(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0F80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0F88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue;                         // 0x0F90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue_1;           // 0x0F98(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue_1;           // 0x0FB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Lerp_ReturnValue_1;                       // 0x0FB8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0FC0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0FC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeClamped_Value_ImplicitCast;       // 0x0FD0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LerpWeatherSettings_Alpha_ImplicitCast;   // 0x0FD8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PrintString_Duration_ImplicitCast;        // 0x0FDC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PrintString_Duration_ImplicitCast_1;      // 0x0FE0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FE4[0x4];                                      // 0x0FE4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0x0FE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1; // 0x0FF0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0FF8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1;  // 0x0FFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_LerpWindIndependentSettings_Alpha_ImplicitCast; // 0x1000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_CloudWindDirection_ImplicitCast; // 0x1004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_CloudWindSpeed_ImplicitCast;     // 0x1008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_PrecipitationWindDirection_ImplicitCast; // 0x100C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_MakeStruct_PrecipitationWindSpeed_ImplicitCast; // 0x1010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2;  // 0x1014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_3;  // 0x1018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_4;  // 0x101C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_5;  // 0x1020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1024[0x4];                                     // 0x1024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_VariableSet_CurrentWetnessAmount_ImplicitCast; // 0x1028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_NextWetnessAmount_ImplicitCast; // 0x1030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CurrentPuddlesAmount_ImplicitCast; // 0x1038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_NextPuddlesAmount_ImplicitCast; // 0x1040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_6;  // 0x1048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_7;  // 0x104C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_CurrentSnowAmount_ImplicitCast; // 0x1050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_VariableSet_NextSnowAmount_ImplicitCast;    // 0x1058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetOcclusionMaskDarkness_NewValue_ImplicitCast; // 0x1060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetBloomMaxBrightness_NewValue_ImplicitCast; // 0x1064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast; // 0x1068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller) == 0x000008, "Wrong alignment on BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller");
static_assert(sizeof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller) == 0x001070, "Wrong size on BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, EntryPoint) == 0x000000, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_HasAuthority_ReturnValue) == 0x000004, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_HasAuthority_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_HasAuthority_ReturnValue_1) == 0x000005, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_HasAuthority_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_GetWeatherPresetSettings_ReturnValue) == 0x000010, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_GetWeatherPresetSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x000468, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_IsTimerActiveHandle_ReturnValue) == 0x00046C, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_IsTimerActiveHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_MapRangeClamped_ReturnValue) == 0x000470, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_MapRangeClamped_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_GetWorldDeltaSeconds_ReturnValue) == 0x000478, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_GetWorldDeltaSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_GetWorldDeltaSeconds_ReturnValue_1) == 0x000480, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_GetWorldDeltaSeconds_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue) == 0x000488, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Conv_DoubleToString_ReturnValue) == 0x000490, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Conv_DoubleToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_GetTime_ReturnValue) == 0x0004A0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_GetTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Concat_StrStr_ReturnValue) == 0x0004A8, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Conv_DoubleToString_ReturnValue_1) == 0x0004B8, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Conv_DoubleToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Array_Length_ReturnValue) == 0x0004C8, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Subtract_IntInt_ReturnValue) == 0x0004CC, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_RandomIntegerInRange_ReturnValue) == 0x0004D0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_RandomIntegerInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_GetWeatherSettings_ReturnValue) == 0x0004D8, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_GetWeatherSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Array_Get_Item) == 0x000930, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_CreateDelegate_OutputDelegate) == 0x000938, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_RandomFloatInRange_ReturnValue) == 0x000948, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000950, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_IsTimerActiveHandle_ReturnValue_1) == 0x000958, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_IsTimerActiveHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_GetWeatherPresetSettings_ReturnValue_1) == 0x000960, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_GetWeatherPresetSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Not_PreBool_ReturnValue) == 0x000DB8, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_GetDisplayName_ReturnValue) == 0x000DC0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_GetDisplayName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000DD0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_HasAuthority_ReturnValue_2) == 0x000DE0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_HasAuthority_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000DE8, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_CreateDelegate_OutputDelegate_1) == 0x000DF0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000E00, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_HasAuthority_ReturnValue_3) == 0x000E08, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_HasAuthority_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_HasAuthority_ReturnValue_4) == 0x000E09, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_HasAuthority_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000E10, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_RandomFloatInRange_ReturnValue_3) == 0x000E18, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_RandomFloatInRange_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_GetWindSettings_ReturnValue) == 0x000E20, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_GetWindSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_MakeStruct_PPSkyCreatorWindSettings) == 0x000E3C, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_MakeStruct_PPSkyCreatorWindSettings' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_HasAuthority_ReturnValue_5) == 0x000E58, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_HasAuthority_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_CreateDelegate_OutputDelegate_2) == 0x000E5C, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_ReturnValue_2) == 0x000E70, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_CreateDelegate_OutputDelegate_3) == 0x000E78, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_ReturnValue_3) == 0x000E88, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_CreateDelegate_OutputDelegate_4) == 0x000E90, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_HasAuthority_ReturnValue_6) == 0x000EA0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_HasAuthority_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_ReturnValue_4) == 0x000EA8, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_CreateDelegate_OutputDelegate_5) == 0x000EB0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_ReturnValue_5) == 0x000EC0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_HasAuthority_ReturnValue_7) == 0x000EC8, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_HasAuthority_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Less_DoubleDouble_ReturnValue) == 0x000EC9, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Less_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_EqualEqual_DoubleDouble_ReturnValue) == 0x000ECA, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_EqualEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Less_DoubleDouble_ReturnValue_1) == 0x000ECB, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Less_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_EqualEqual_DoubleDouble_ReturnValue_1) == 0x000ECC, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_EqualEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_NotEqual_DoubleDouble_ReturnValue) == 0x000ECD, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_NotEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_NotEqual_DoubleDouble_ReturnValue_1) == 0x000ECE, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_NotEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_CreateDelegate_OutputDelegate_6) == 0x000ED0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_ReturnValue_6) == 0x000EE0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_HasAuthority_ReturnValue_8) == 0x000EE8, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_HasAuthority_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_CreateDelegate_OutputDelegate_7) == 0x000EEC, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_ReturnValue_7) == 0x000F00, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Less_DoubleDouble_ReturnValue_2) == 0x000F08, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Less_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_EqualEqual_DoubleDouble_ReturnValue_2) == 0x000F09, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_EqualEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_NotEqual_DoubleDouble_ReturnValue_2) == 0x000F0A, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_NotEqual_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_IsDedicatedServer_ReturnValue) == 0x000F0B, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_CreateDelegate_OutputDelegate_8) == 0x000F0C, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_CustomEvent_LightningPosition) == 0x000F20, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_CustomEvent_LightningPosition' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_SpawnSound2D_ReturnValue) == 0x000F38, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_SpawnSound2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_GetTimeManager_ReturnValue) == 0x000F40, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_GetTimeManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_GetCurrentPalWorldHoursFloat_ReturnValue) == 0x000F48, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_GetCurrentPalWorldHoursFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_GetTimeManager_ReturnValue_1) == 0x000F50, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_GetTimeManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_GetCurrentPalWorldHoursFloat_ReturnValue_1) == 0x000F58, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_GetCurrentPalWorldHoursFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_HasAuthority_ReturnValue_9) == 0x000F5C, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_HasAuthority_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_GetForwardVector_ReturnValue) == 0x000F60, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Dot_VectorVector_ReturnValue) == 0x000F78, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000F80, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_FClamp_ReturnValue) == 0x000F88, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Lerp_ReturnValue) == 0x000F90, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Lerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_GetForwardVector_ReturnValue_1) == 0x000F98, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_GetForwardVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Dot_VectorVector_ReturnValue_1) == 0x000FB0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Dot_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Lerp_ReturnValue_1) == 0x000FB8, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Lerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000FC0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_FClamp_ReturnValue_1) == 0x000FC8, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_MapRangeClamped_Value_ImplicitCast) == 0x000FD0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_MapRangeClamped_Value_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_LerpWeatherSettings_Alpha_ImplicitCast) == 0x000FD8, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_LerpWeatherSettings_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_PrintString_Duration_ImplicitCast) == 0x000FDC, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_PrintString_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_PrintString_Duration_ImplicitCast_1) == 0x000FE0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_PrintString_Duration_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast) == 0x000FE8, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1) == 0x000FF0, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000FF8, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1) == 0x000FFC, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_LerpWindIndependentSettings_Alpha_ImplicitCast) == 0x001000, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_LerpWindIndependentSettings_Alpha_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_MakeStruct_CloudWindDirection_ImplicitCast) == 0x001004, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_MakeStruct_CloudWindDirection_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_MakeStruct_CloudWindSpeed_ImplicitCast) == 0x001008, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_MakeStruct_CloudWindSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_MakeStruct_PrecipitationWindDirection_ImplicitCast) == 0x00100C, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_MakeStruct_PrecipitationWindDirection_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_MakeStruct_PrecipitationWindSpeed_ImplicitCast) == 0x001010, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_MakeStruct_PrecipitationWindSpeed_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2) == 0x001014, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_3) == 0x001018, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_4) == 0x00101C, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_5) == 0x001020, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_5' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_VariableSet_CurrentWetnessAmount_ImplicitCast) == 0x001028, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_VariableSet_CurrentWetnessAmount_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_VariableSet_NextWetnessAmount_ImplicitCast) == 0x001030, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_VariableSet_NextWetnessAmount_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_VariableSet_CurrentPuddlesAmount_ImplicitCast) == 0x001038, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_VariableSet_CurrentPuddlesAmount_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_VariableSet_NextPuddlesAmount_ImplicitCast) == 0x001040, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_VariableSet_NextPuddlesAmount_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_6) == 0x001048, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_6' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_7) == 0x00104C, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast_7' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_VariableSet_CurrentSnowAmount_ImplicitCast) == 0x001050, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_VariableSet_CurrentSnowAmount_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, K2Node_VariableSet_NextSnowAmount_ImplicitCast) == 0x001058, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::K2Node_VariableSet_NextSnowAmount_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_SetOcclusionMaskDarkness_NewValue_ImplicitCast) == 0x001060, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_SetOcclusionMaskDarkness_NewValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_SetBloomMaxBrightness_NewValue_ImplicitCast) == 0x001064, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_SetBloomMaxBrightness_NewValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller, CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast) == 0x001068, "Member 'BP_PPSkyCreator_Controller_C_ExecuteUbergraph_BP_PPSkyCreator_Controller::CallFunc_SetScalarParameterValue_ParameterValue_ImplicitCast' has a wrong offset!");

// Function BP_PPSkyCreator_Controller.BP_PPSkyCreator_Controller_C.LightningStrike
// 0x0018 (0x0018 - 0x0000)
struct BP_PPSkyCreator_Controller_C_LightningStrike final
{
public:
	struct FVector                                LightningPosition;                                 // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PPSkyCreator_Controller_C_LightningStrike) == 0x000008, "Wrong alignment on BP_PPSkyCreator_Controller_C_LightningStrike");
static_assert(sizeof(BP_PPSkyCreator_Controller_C_LightningStrike) == 0x000018, "Wrong size on BP_PPSkyCreator_Controller_C_LightningStrike");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_LightningStrike, LightningPosition) == 0x000000, "Member 'BP_PPSkyCreator_Controller_C_LightningStrike::LightningPosition' has a wrong offset!");

// Function BP_PPSkyCreator_Controller.BP_PPSkyCreator_Controller_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_PPSkyCreator_Controller_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_PPSkyCreator_Controller_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_PPSkyCreator_Controller_C_ReceiveTick");
static_assert(sizeof(BP_PPSkyCreator_Controller_C_ReceiveTick) == 0x000004, "Wrong size on BP_PPSkyCreator_Controller_C_ReceiveTick");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_PPSkyCreator_Controller_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_PPSkyCreator_Controller.BP_PPSkyCreator_Controller_C.SetRainVolume
// 0x0110 (0x0110 - 0x0000)
struct BP_PPSkyCreator_Controller_C_SetRainVolume final
{
public:
	struct FPPSkyCreatorWeatherFXSettings         CallFunc_GetWeatherFXSettings_ReturnValue;         // 0x0000(0x0110)(NoDestructor)
};
static_assert(alignof(BP_PPSkyCreator_Controller_C_SetRainVolume) == 0x000008, "Wrong alignment on BP_PPSkyCreator_Controller_C_SetRainVolume");
static_assert(sizeof(BP_PPSkyCreator_Controller_C_SetRainVolume) == 0x000110, "Wrong size on BP_PPSkyCreator_Controller_C_SetRainVolume");
static_assert(offsetof(BP_PPSkyCreator_Controller_C_SetRainVolume, CallFunc_GetWeatherFXSettings_ReturnValue) == 0x000000, "Member 'BP_PPSkyCreator_Controller_C_SetRainVolume::CallFunc_GetWeatherFXSettings_ReturnValue' has a wrong offset!");

// Function BP_PPSkyCreator_Controller.BP_PPSkyCreator_Controller_C.UserConstructionScript
// 0x0008 (0x0008 - 0x0000)
struct BP_PPSkyCreator_Controller_C_UserConstructionScript final
{
public:
	class APPSkyCreator*                          CallFunc_GetActorOfClass_ReturnValue;              // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
