#pragma once

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace PalSDK
{

// BlueprintGeneratedClass BP_pal_b00_hurou.BP_pal_b00_hurou_C
// 0x00A0 (0x0330 - 0x0290)
class ABP_pal_b00_hurou_C final : public AActor
{
public:
	class UStaticMeshComponent*                   SM_Pal_b00_hurou_pPlane15;                         // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Pal_b00_hurou_pPlane14;                         // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Pal_b00_hurou_pCylinder4;                       // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_pal_b00_grass_Lodenfel_Column_Ruined_014;       // 0x02A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere7;                                           // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_pal_b00_grass_Lodenfel_Column_Ruined_013;       // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere6;                                           // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_pal_b00_grass_Lodenfel_Column_Ruined_011;       // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_pal_b00_grass_Lodenfel_Column_Ruined_012;       // 0x02D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere5;                                           // 0x02D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_pal_b00_grass_Lodenfel_Column_Ruined_09;        // 0x02E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere4;                                           // 0x02E8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_pal_b00_grass_Lodenfel_Column_Ruined_010;       // 0x02F0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere3;                                           // 0x02F8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere2;                                           // 0x0300(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_pal_b00_grass_Lodenfel_Column_Ruined_08;        // 0x0308(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere1;                                           // 0x0310(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_pal_b00_grass_Lodenfel_Column_Ruined_07;        // 0x0318(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Sphere;                                            // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_pal_b00_hurou_C">();
	}
	static class ABP_pal_b00_hurou_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_pal_b00_hurou_C>();
	}
};
static_assert(alignof(ABP_pal_b00_hurou_C) == 0x000008, "Wrong alignment on ABP_pal_b00_hurou_C");
static_assert(sizeof(ABP_pal_b00_hurou_C) == 0x000330, "Wrong size on ABP_pal_b00_hurou_C");
static_assert(offsetof(ABP_pal_b00_hurou_C, SM_Pal_b00_hurou_pPlane15) == 0x000290, "Member 'ABP_pal_b00_hurou_C::SM_Pal_b00_hurou_pPlane15' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, SM_Pal_b00_hurou_pPlane14) == 0x000298, "Member 'ABP_pal_b00_hurou_C::SM_Pal_b00_hurou_pPlane14' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, SM_Pal_b00_hurou_pCylinder4) == 0x0002A0, "Member 'ABP_pal_b00_hurou_C::SM_Pal_b00_hurou_pCylinder4' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, SM_pal_b00_grass_Lodenfel_Column_Ruined_014) == 0x0002A8, "Member 'ABP_pal_b00_hurou_C::SM_pal_b00_grass_Lodenfel_Column_Ruined_014' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, Sphere7) == 0x0002B0, "Member 'ABP_pal_b00_hurou_C::Sphere7' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, SM_pal_b00_grass_Lodenfel_Column_Ruined_013) == 0x0002B8, "Member 'ABP_pal_b00_hurou_C::SM_pal_b00_grass_Lodenfel_Column_Ruined_013' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, Sphere6) == 0x0002C0, "Member 'ABP_pal_b00_hurou_C::Sphere6' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, SM_pal_b00_grass_Lodenfel_Column_Ruined_011) == 0x0002C8, "Member 'ABP_pal_b00_hurou_C::SM_pal_b00_grass_Lodenfel_Column_Ruined_011' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, SM_pal_b00_grass_Lodenfel_Column_Ruined_012) == 0x0002D0, "Member 'ABP_pal_b00_hurou_C::SM_pal_b00_grass_Lodenfel_Column_Ruined_012' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, Sphere5) == 0x0002D8, "Member 'ABP_pal_b00_hurou_C::Sphere5' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, SM_pal_b00_grass_Lodenfel_Column_Ruined_09) == 0x0002E0, "Member 'ABP_pal_b00_hurou_C::SM_pal_b00_grass_Lodenfel_Column_Ruined_09' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, Sphere4) == 0x0002E8, "Member 'ABP_pal_b00_hurou_C::Sphere4' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, SM_pal_b00_grass_Lodenfel_Column_Ruined_010) == 0x0002F0, "Member 'ABP_pal_b00_hurou_C::SM_pal_b00_grass_Lodenfel_Column_Ruined_010' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, Sphere3) == 0x0002F8, "Member 'ABP_pal_b00_hurou_C::Sphere3' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, Sphere2) == 0x000300, "Member 'ABP_pal_b00_hurou_C::Sphere2' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, SM_pal_b00_grass_Lodenfel_Column_Ruined_08) == 0x000308, "Member 'ABP_pal_b00_hurou_C::SM_pal_b00_grass_Lodenfel_Column_Ruined_08' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, Sphere1) == 0x000310, "Member 'ABP_pal_b00_hurou_C::Sphere1' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, SM_pal_b00_grass_Lodenfel_Column_Ruined_07) == 0x000318, "Member 'ABP_pal_b00_hurou_C::SM_pal_b00_grass_Lodenfel_Column_Ruined_07' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, Sphere) == 0x000320, "Member 'ABP_pal_b00_hurou_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_pal_b00_hurou_C, DefaultSceneRoot) == 0x000328, "Member 'ABP_pal_b00_hurou_C::DefaultSceneRoot' has a wrong offset!");

}

