#pragma once

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace PalSDK::Params
{

// Function BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main.BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C.ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main
// 0x000C (0x000C - 0x0000)
struct BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast_1;            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main) == 0x000004, "Wrong alignment on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main");
static_assert(sizeof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main) == 0x00000C, "Wrong size on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main, EntryPoint) == 0x000000, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main, CallFunc_Delay_Duration_ImplicitCast) == 0x000004, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main, CallFunc_Delay_Duration_ImplicitCast_1) == 0x000008, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main::CallFunc_Delay_Duration_ImplicitCast_1' has a wrong offset!");

// Function BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main.BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C.GetBullet
// 0x0008 (0x0008 - 0x0000)
struct BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_GetBullet final
{
public:
	class UClass*                                 NewParam;                                          // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_GetBullet) == 0x000008, "Wrong alignment on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_GetBullet");
static_assert(sizeof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_GetBullet) == 0x000008, "Wrong size on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_GetBullet");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_GetBullet, NewParam) == 0x000000, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_GetBullet::NewParam' has a wrong offset!");

// Function BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main.BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C.SetMainActive
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainActive final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainActive) == 0x000001, "Wrong alignment on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainActive");
static_assert(sizeof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainActive) == 0x000001, "Wrong size on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainActive");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainActive, Active) == 0x000000, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainActive::Active' has a wrong offset!");

// Function BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main.BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C.SetMainSize
// 0x0038 (0x0038 - 0x0000)
struct BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCapsuleHalfHeight_HalfHeight_ImplicitCast; // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetCapsuleRadius_Radius_ImplicitCast;     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize) == 0x000008, "Wrong alignment on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize");
static_assert(sizeof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize) == 0x000038, "Wrong size on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000008, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000010, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize, CallFunc_SetCapsuleHalfHeight_HalfHeight_ImplicitCast) == 0x000030, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize::CallFunc_SetCapsuleHalfHeight_HalfHeight_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize, CallFunc_SetCapsuleRadius_Radius_ImplicitCast) == 0x000034, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetMainSize::CallFunc_SetCapsuleRadius_Radius_ImplicitCast' has a wrong offset!");

// Function BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main.BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C.SetSignActive
// 0x0001 (0x0001 - 0x0000)
struct BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignActive final
{
public:
	bool                                          Active;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignActive) == 0x000001, "Wrong alignment on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignActive");
static_assert(sizeof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignActive) == 0x000001, "Wrong size on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignActive");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignActive, Active) == 0x000000, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignActive::Active' has a wrong offset!");

// Function BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main.BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C.SetSignSize
// 0x0020 (0x0020 - 0x0000)
struct BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignSize final
{
public:
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignSize) == 0x000008, "Wrong alignment on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignSize");
static_assert(sizeof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignSize) == 0x000020, "Wrong size on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignSize");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignSize, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000000, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignSize::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignSize, CallFunc_MakeVector_ReturnValue) == 0x000008, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_SetSignSize::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main.BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C.ShootAllBullet
// 0x0048 (0x0048 - 0x0000)
struct BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet final
{
public:
	double                                        Angle360;                                          // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        OneAngleYaw;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Variable;                                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_24[0x4];                                       // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_IntInt_ReturnValue;             // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet) == 0x000008, "Wrong alignment on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet");
static_assert(sizeof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet) == 0x000048, "Wrong size on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet, Angle360) == 0x000000, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet::Angle360' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet, OneAngleYaw) == 0x000008, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet::OneAngleYaw' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet, Temp_int_Variable) == 0x000010, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet::Temp_int_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet, CallFunc_Conv_IntToDouble_ReturnValue) == 0x000018, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000028, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet, CallFunc_Conv_IntToDouble_ReturnValue_1) == 0x000030, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet::CallFunc_Conv_IntToDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000038, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet, CallFunc_Subtract_IntInt_ReturnValue) == 0x000040, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet, CallFunc_LessEqual_IntInt_ReturnValue) == 0x000044, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootAllBullet::CallFunc_LessEqual_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main.BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C.ShootOneBullet
// 0x01A0 (0x01A0 - 0x0000)
struct BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet final
{
public:
	double                                        YawAngle;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        RandomedYaw;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               MuzzleRotate;                                      // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                MuzzleVector;                                      // 0x0028(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetBullet_NewParam;                       // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegSin_ReturnValue;                       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DegCos_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7C[0x4];                                       // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               CallFunc_MakeRotFromX_ReturnValue;                 // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GreaterGreater_VectorRotator_ReturnValue; // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_118[0x8];                                      // 0x0118(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0120(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0180(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_SkillEffectBase_C*                  CallFunc_FinishSpawningActor_ReturnValue;          // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast; // 0x0190(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast; // 0x0194(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Add_DoubleDouble_A_ImplicitCast;          // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet) == 0x000010, "Wrong alignment on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet");
static_assert(sizeof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet) == 0x0001A0, "Wrong size on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, YawAngle) == 0x000000, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::YawAngle' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, RandomedYaw) == 0x000008, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::RandomedYaw' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, MuzzleRotate) == 0x000010, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::MuzzleRotate' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, MuzzleVector) == 0x000028, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::MuzzleVector' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_GetBullet_NewParam) == 0x000040, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_GetBullet_NewParam' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_DegSin_ReturnValue) == 0x000048, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_DegSin_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_DegCos_ReturnValue) == 0x000050, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_DegCos_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_MakeVector_ReturnValue) == 0x000058, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000070, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x000078, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000080, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000088, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_MakeRotFromX_ReturnValue) == 0x0000A0, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_MakeRotFromX_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_GreaterGreater_VectorRotator_ReturnValue) == 0x0000B8, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_GreaterGreater_VectorRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000D0, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_MakeVector_ReturnValue_1) == 0x0000E8, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_Add_VectorVector_ReturnValue) == 0x000100, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_MakeTransform_ReturnValue) == 0x000120, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000180, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_FinishSpawningActor_ReturnValue) == 0x000188, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast) == 0x000190, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast) == 0x000194, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet, CallFunc_Add_DoubleDouble_A_ImplicitCast) == 0x000198, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Main_C_ShootOneBullet::CallFunc_Add_DoubleDouble_A_ImplicitCast' has a wrong offset!");

}

