#pragma once

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace PalSDK::Params
{

// Function BP_SkillEffect_FlareTornado.BP_SkillEffect_FlareTornado_C.ExecuteUbergraph_BP_SkillEffect_FlareTornado
// 0x03C0 (0x03C0 - 0x0000)
struct BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue;          // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue;               // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_1;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue;              // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_2;        // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetRightVector_ReturnValue_1;             // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_3;        // 0x00C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue_1;       // 0x00D8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_1;            // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0110(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_2;            // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorScale3D_ReturnValue_3;            // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0170(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x01B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x01D0(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_MakeTransform_ReturnValue_1;              // 0x0230(0x0060)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_TargetLocation;                       // 0x0290(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x02A8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_AdjustActorToFloor_ReturnValue;           // 0x02B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_K2_GetActorRotation_ReturnValue_4;        // 0x02D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x02E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_2;      // 0x0300(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue;                 // 0x0318(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue_1;               // 0x0328(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0338(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue;          // 0x0348(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x0350(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalSkillEffectBase*                    K2Node_DynamicCast_AsPal_Skill_Effect_Base;        // 0x0358(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0360(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_361[0x7];                                      // 0x0361(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalSkillEffectBase*                    K2Node_DynamicCast_AsPal_Skill_Effect_Base_1;      // 0x0368(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0370(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0371(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0372(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_373[0x5];                                      // 0x0373(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_MoveToTargetLocation_NewDirection;        // 0x0378(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MoveToTargetLocation_NewDirection_1;      // 0x0388(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0398(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0399(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39A[0x6];                                      // 0x039A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_AdjustActorToFloor_ReturnValue_1;         // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MoveToTargetLocation_DeltaTime_ImplicitCast; // 0x03A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MoveToTargetLocation_DeltaTime_ImplicitCast_1; // 0x03B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotated2D_AngleDeg_ImplicitCast;       // 0x03B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotated2D_AngleDeg_ImplicitCast_1;     // 0x03BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado) == 0x000010, "Wrong alignment on BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado");
static_assert(sizeof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado) == 0x0003C0, "Wrong size on BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, EntryPoint) == 0x000000, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_K2_GetActorRotation_ReturnValue) == 0x000008, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_K2_GetActorRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_GetRightVector_ReturnValue) == 0x000020, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_GetRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_K2_GetActorRotation_ReturnValue_1) == 0x000038, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_K2_GetActorRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000050, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_GetActorScale3D_ReturnValue) == 0x000068, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_GetActorScale3D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_GetOwner_ReturnValue) == 0x000080, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_K2_GetActorRotation_ReturnValue_2) == 0x000088, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_K2_GetActorRotation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_GetRightVector_ReturnValue_1) == 0x0000A0, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_GetRightVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_K2_GetActorRotation_ReturnValue_3) == 0x0000C0, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_K2_GetActorRotation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_Multiply_VectorFloat_ReturnValue_1) == 0x0000D8, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_Multiply_VectorFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_GetActorScale3D_ReturnValue_1) == 0x0000F0, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_GetActorScale3D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_GetOwner_ReturnValue_1) == 0x000108, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000110, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000128, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_GetActorScale3D_ReturnValue_2) == 0x000140, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_GetActorScale3D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_GetActorScale3D_ReturnValue_3) == 0x000158, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_GetActorScale3D_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000170, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000188, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_Add_VectorVector_ReturnValue) == 0x0001A0, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_Add_VectorVector_ReturnValue_1) == 0x0001B8, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_MakeTransform_ReturnValue) == 0x0001D0, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_MakeTransform_ReturnValue_1) == 0x000230, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_MakeTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, K2Node_Event_TargetLocation) == 0x000290, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::K2Node_Event_TargetLocation' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0002A8, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_AdjustActorToFloor_ReturnValue) == 0x0002B8, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_AdjustActorToFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x0002C0, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_K2_GetActorRotation_ReturnValue_4) == 0x0002D0, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_K2_GetActorRotation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_GetForwardVector_ReturnValue) == 0x0002E8, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_Conv_VectorToVector2D_ReturnValue_2) == 0x000300, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_Conv_VectorToVector2D_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000310, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_GetRotated2D_ReturnValue) == 0x000318, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_GetRotated2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_GetRotated2D_ReturnValue_1) == 0x000328, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_GetRotated2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000338, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x000340, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_FinishSpawningActor_ReturnValue) == 0x000348, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x000350, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, K2Node_DynamicCast_AsPal_Skill_Effect_Base) == 0x000358, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::K2Node_DynamicCast_AsPal_Skill_Effect_Base' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, K2Node_DynamicCast_bSuccess) == 0x000360, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, K2Node_DynamicCast_AsPal_Skill_Effect_Base_1) == 0x000368, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::K2Node_DynamicCast_AsPal_Skill_Effect_Base_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, K2Node_DynamicCast_bSuccess_1) == 0x000370, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_IsValid_ReturnValue) == 0x000371, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_IsValid_ReturnValue_1) == 0x000372, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_MoveToTargetLocation_NewDirection) == 0x000378, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_MoveToTargetLocation_NewDirection' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_MoveToTargetLocation_NewDirection_1) == 0x000388, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_MoveToTargetLocation_NewDirection_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_IsValid_ReturnValue_2) == 0x000398, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_IsValid_ReturnValue_3) == 0x000399, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_AdjustActorToFloor_ReturnValue_1) == 0x0003A0, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_AdjustActorToFloor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_MoveToTargetLocation_DeltaTime_ImplicitCast) == 0x0003A8, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_MoveToTargetLocation_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_MoveToTargetLocation_DeltaTime_ImplicitCast_1) == 0x0003B0, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_MoveToTargetLocation_DeltaTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_GetRotated2D_AngleDeg_ImplicitCast) == 0x0003B8, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_GetRotated2D_AngleDeg_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado, CallFunc_GetRotated2D_AngleDeg_ImplicitCast_1) == 0x0003BC, "Member 'BP_SkillEffect_FlareTornado_C_ExecuteUbergraph_BP_SkillEffect_FlareTornado::CallFunc_GetRotated2D_AngleDeg_ImplicitCast_1' has a wrong offset!");

// Function BP_SkillEffect_FlareTornado.BP_SkillEffect_FlareTornado_C.GetDesiredLocation
// 0x01A0 (0x01A0 - 0x0000)
struct BP_SkillEffect_FlareTornado_C_GetDesiredLocation final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TargetLocation2D;                                  // 0x0008(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              NormalizedDirection2D;                             // 0x0018(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              NewDirection;                                      // 0x0028(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewLocation;                                       // 0x0038(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              NewNormalizedDirection;                            // 0x0050(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp;                                              // 0x0060(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalActorLocation2D;                              // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalNormalizedDirectionForTarget;                 // 0x0078(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNearlyZero2D_ReturnValue;               // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DotProduct2D_ReturnValue;                 // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A9[0x7];                                       // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x00C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0108(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue;                 // 0x0128(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CrossProduct2D_ReturnValue;               // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_151[0x7];                                      // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0188(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotated2D_AngleDeg_ImplicitCast;       // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation) == 0x000008, "Wrong alignment on BP_SkillEffect_FlareTornado_C_GetDesiredLocation");
static_assert(sizeof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation) == 0x0001A0, "Wrong size on BP_SkillEffect_FlareTornado_C_GetDesiredLocation");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, DeltaTime) == 0x000000, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, TargetLocation2D) == 0x000008, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::TargetLocation2D' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, NormalizedDirection2D) == 0x000018, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::NormalizedDirection2D' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, NewDirection) == 0x000028, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::NewDirection' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, NewLocation) == 0x000038, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::NewLocation' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, NewNormalizedDirection) == 0x000050, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::NewNormalizedDirection' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, Temp) == 0x000060, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::Temp' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, LocalActorLocation2D) == 0x000068, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::LocalActorLocation2D' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, LocalNormalizedDirectionForTarget) == 0x000078, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::LocalNormalizedDirectionForTarget' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_IsNearlyZero2D_ReturnValue) == 0x000088, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_IsNearlyZero2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000090, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_DotProduct2D_ReturnValue) == 0x0000A0, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_DotProduct2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000A8, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0000B0, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0000C8, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000D8, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x0000E0, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x0000F0, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000100, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000108, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000120, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_GetRotated2D_ReturnValue) == 0x000128, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_GetRotated2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_Normal2D_ReturnValue) == 0x000138, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_CrossProduct2D_ReturnValue) == 0x000148, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_CrossProduct2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000150, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000158, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_BreakVector_X) == 0x000170, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_BreakVector_Y) == 0x000178, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_BreakVector_Z) == 0x000180, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_MakeVector2D_ReturnValue) == 0x000188, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_GetDesiredLocation, CallFunc_GetRotated2D_AngleDeg_ImplicitCast) == 0x000198, "Member 'BP_SkillEffect_FlareTornado_C_GetDesiredLocation::CallFunc_GetRotated2D_AngleDeg_ImplicitCast' has a wrong offset!");

// Function BP_SkillEffect_FlareTornado.BP_SkillEffect_FlareTornado_C.MoveToTargetLocation
// 0x02B8 (0x02B8 - 0x0000)
struct BP_SkillEffect_FlareTornado_C_MoveToTargetLocation final
{
public:
	class APalSkillEffectBase*                    Tornado;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor, HasGetValueTypeHash)
	double                                        DeltaTime;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              TargetLocation2D;                                  // 0x0010(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              NormalizedDirection2D;                             // 0x0020(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              NewDirection;                                      // 0x0030(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              NewNormalizedDirection;                            // 0x0040(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        Temp;                                              // 0x0050(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalActorLocation2D;                              // 0x0058(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalNormalizedDirectionForTarget;                 // 0x0068(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00D0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsNearlyZero2D_ReturnValue;               // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_AdjustActorToFloor_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_DotProduct2D_ReturnValue;                 // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x0118(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x0128(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0140(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_Vector2DToVector_ReturnValue;        // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x0180(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x7];                                      // 0x0269(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_CrossProduct2D_ReturnValue;               // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetRotated2D_ReturnValue;                 // 0x0288(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1;  // 0x0298(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_299[0x7];                                      // 0x0299(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Normal2D_ReturnValue;                     // 0x02A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_Vector2DToVector_Z_ImplicitCast;     // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetRotated2D_AngleDeg_ImplicitCast;       // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation) == 0x000008, "Wrong alignment on BP_SkillEffect_FlareTornado_C_MoveToTargetLocation");
static_assert(sizeof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation) == 0x0002B8, "Wrong size on BP_SkillEffect_FlareTornado_C_MoveToTargetLocation");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, Tornado) == 0x000000, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::Tornado' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, DeltaTime) == 0x000008, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, TargetLocation2D) == 0x000010, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::TargetLocation2D' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, NormalizedDirection2D) == 0x000020, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::NormalizedDirection2D' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, NewDirection) == 0x000030, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::NewDirection' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, NewNormalizedDirection) == 0x000040, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::NewNormalizedDirection' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, Temp) == 0x000050, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::Temp' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, LocalActorLocation2D) == 0x000058, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::LocalActorLocation2D' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, LocalNormalizedDirectionForTarget) == 0x000068, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::LocalNormalizedDirectionForTarget' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000078, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000090, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000A0, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_BreakVector_X) == 0x0000B8, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_BreakVector_Y) == 0x0000C0, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_BreakVector_Z) == 0x0000C8, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_MakeVector2D_ReturnValue) == 0x0000D0, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_IsNearlyZero2D_ReturnValue) == 0x0000E0, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_IsNearlyZero2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_AdjustActorToFloor_ReturnValue) == 0x0000E8, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_AdjustActorToFloor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x0000F0, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_DotProduct2D_ReturnValue) == 0x000100, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_DotProduct2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000108, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000110, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x000118, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x000128, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000140, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_BreakVector_X_1) == 0x000150, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_BreakVector_Y_1) == 0x000158, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_BreakVector_Z_1) == 0x000160, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_Conv_Vector2DToVector_ReturnValue) == 0x000168, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_Conv_Vector2DToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x000180, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000268, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000270, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x000278, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_CrossProduct2D_ReturnValue) == 0x000280, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_CrossProduct2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_GetRotated2D_ReturnValue) == 0x000288, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_GetRotated2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1) == 0x000298, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_GreaterEqual_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_Normal2D_ReturnValue) == 0x0002A0, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_Normal2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_Conv_Vector2DToVector_Z_ImplicitCast) == 0x0002B0, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_Conv_Vector2DToVector_Z_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_FlareTornado_C_MoveToTargetLocation, CallFunc_GetRotated2D_AngleDeg_ImplicitCast) == 0x0002B4, "Member 'BP_SkillEffect_FlareTornado_C_MoveToTargetLocation::CallFunc_GetRotated2D_AngleDeg_ImplicitCast' has a wrong offset!");

// Function BP_SkillEffect_FlareTornado.BP_SkillEffect_FlareTornado_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SkillEffect_FlareTornado_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
