#pragma once

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace PalSDK::Params
{

// Function BP_Skill_ThunderFunnel_Funnel.BP_Skill_ThunderFunnel_Funnel_C.ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel
// 0x0148 (0x0148 - 0x0000)
struct BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_2; // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_99[0x3];                                       // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_ReturnValue_2;              // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_DeltaSecond;                          // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           Temp_struct_Variable;                              // 0x00C0(0x0008)(ConstParm, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CD[0x3];                                       // 0x00CD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x00D0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x00E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetOwnerCharacter_ReturnValue;            // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x00F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x00FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_FB[0x1];                                       // 0x00FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_1;      // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_2;      // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_2;  // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12C[0x4];                                      // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_InitMoveFunnelLocation_DeltaTime_ImplicitCast; // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Greater_DoubleDouble_A_ImplicitCast;      // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel) == 0x000008, "Wrong alignment on BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel");
static_assert(sizeof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel) == 0x000148, "Wrong size on BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, EntryPoint) == 0x000000, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000006, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x000028, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_GetFloatValue_ReturnValue) == 0x00002C, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, Temp_bool_IsClosed_Variable_1) == 0x000038, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_2) == 0x000048, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_FClamp_ReturnValue_1) == 0x000058, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_GetFloatValue_ReturnValue_1) == 0x000060, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, Temp_bool_Has_Been_Initd_Variable_1) == 0x000064, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_SelectFloat_ReturnValue_1) == 0x000068, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000070, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000078, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000080, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_SelectFloat_ReturnValue_2) == 0x000088, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_FClamp_ReturnValue_2) == 0x000090, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, Temp_bool_Has_Been_Initd_Variable_2) == 0x000098, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_GetFloatValue_ReturnValue_2) == 0x00009C, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_GetFloatValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000A0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, K2Node_Event_DeltaSeconds) == 0x0000A8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_GetGameTimeSinceCreation_ReturnValue) == 0x0000AC, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_GetGameTimeSinceCreation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, K2Node_Event_DeltaSecond) == 0x0000B0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::K2Node_Event_DeltaSecond' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0000B8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, Temp_struct_Variable) == 0x0000C0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Array_Add_ReturnValue) == 0x0000C8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x0000CC, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, K2Node_CreateDelegate_OutputDelegate) == 0x0000D0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x0000E0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, Temp_bool_IsClosed_Variable_2) == 0x0000E8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_GetOwnerCharacter_ReturnValue) == 0x0000F0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_IsValid_ReturnValue) == 0x0000F8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_IsDead_ReturnValue) == 0x0000F9, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_IsPlayerControlled_ReturnValue) == 0x0000FA, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x0000FC, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000100, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000108, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_GetFloatValue_InTime_ImplicitCast_1) == 0x00010C, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_GetFloatValue_InTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000110, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000118, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_GetFloatValue_InTime_ImplicitCast_2) == 0x00011C, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_GetFloatValue_InTime_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x000120, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_SetVariableFloat_InValue_ImplicitCast_2) == 0x000128, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_SetVariableFloat_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_InitMoveFunnelLocation_DeltaTime_ImplicitCast) == 0x000130, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_InitMoveFunnelLocation_DeltaTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_Greater_DoubleDouble_A_ImplicitCast) == 0x000138, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_Greater_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x000140, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ExecuteUbergraph_BP_Skill_ThunderFunnel_Funnel::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_Skill_ThunderFunnel_Funnel.BP_Skill_ThunderFunnel_Funnel_C.FadeOutEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_Skill_ThunderFunnel_Funnel_C_FadeOutEffect final
{
public:
	double                                        DeltaSecond;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skill_ThunderFunnel_Funnel_C_FadeOutEffect) == 0x000008, "Wrong alignment on BP_Skill_ThunderFunnel_Funnel_C_FadeOutEffect");
static_assert(sizeof(BP_Skill_ThunderFunnel_Funnel_C_FadeOutEffect) == 0x000008, "Wrong size on BP_Skill_ThunderFunnel_Funnel_C_FadeOutEffect");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_FadeOutEffect, DeltaSecond) == 0x000000, "Member 'BP_Skill_ThunderFunnel_Funnel_C_FadeOutEffect::DeltaSecond' has a wrong offset!");

// Function BP_Skill_ThunderFunnel_Funnel.BP_Skill_ThunderFunnel_Funnel_C.Get Bullet Rotat
// 0x0060 (0x0060 - 0x0000)
struct BP_Skill_ThunderFunnel_Funnel_C_Get_Bullet_Rotat final
{
public:
	struct FRotator                               Rotation;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetNearestTargetLocation_NearestTargetLocation; // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_FindLookAtRotation_ReturnValue;           // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Skill_ThunderFunnel_Funnel_C_Get_Bullet_Rotat) == 0x000008, "Wrong alignment on BP_Skill_ThunderFunnel_Funnel_C_Get_Bullet_Rotat");
static_assert(sizeof(BP_Skill_ThunderFunnel_Funnel_C_Get_Bullet_Rotat) == 0x000060, "Wrong size on BP_Skill_ThunderFunnel_Funnel_C_Get_Bullet_Rotat");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_Get_Bullet_Rotat, Rotation) == 0x000000, "Member 'BP_Skill_ThunderFunnel_Funnel_C_Get_Bullet_Rotat::Rotation' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_Get_Bullet_Rotat, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_Skill_ThunderFunnel_Funnel_C_Get_Bullet_Rotat::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_Get_Bullet_Rotat, CallFunc_GetNearestTargetLocation_NearestTargetLocation) == 0x000030, "Member 'BP_Skill_ThunderFunnel_Funnel_C_Get_Bullet_Rotat::CallFunc_GetNearestTargetLocation_NearestTargetLocation' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_Get_Bullet_Rotat, CallFunc_FindLookAtRotation_ReturnValue) == 0x000048, "Member 'BP_Skill_ThunderFunnel_Funnel_C_Get_Bullet_Rotat::CallFunc_FindLookAtRotation_ReturnValue' has a wrong offset!");

// Function BP_Skill_ThunderFunnel_Funnel.BP_Skill_ThunderFunnel_Funnel_C.GetNearestTargetLocation
// 0x0108 (0x0108 - 0x0000)
struct BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation final
{
public:
	struct FVector                                NearestTargetLocation;                             // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APalCharacter*>                  UseableTarget;                                     // 0x0018(0x0010)(Edit, BlueprintVisible, DisableEditOnTemplate)
	int32                                         CurrentNearestLocationIndex;                       // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CurrentMinDistance;                                // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                        TargetsLocation;                                   // 0x0038(0x0010)(Edit, BlueprintVisible)
	struct FVector                                CallFunc_GetActionTargetLocation_ReturnValue;      // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerControlled_ReturnValue;           // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetOwnerCharacter_ReturnValue_1;          // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActionTargetLocation_ReturnValue_1;    // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0090(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class APalCharacter*>                  CallFunc_GetEnemiesByLocation_ReturnValue;         // 0x00A8(0x0010)(ReferenceParm)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FindNearestActor_Distance;                // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_FindNearestActor_ReturnValue;             // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x7];                                       // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_Array_Get_Item;                           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsApplicableDamage_ReturnValue;           // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x2];                                       // 0x00E2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E9[0x7];                                       // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation) == 0x000008, "Wrong alignment on BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation");
static_assert(sizeof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation) == 0x000108, "Wrong size on BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, NearestTargetLocation) == 0x000000, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::NearestTargetLocation' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, UseableTarget) == 0x000018, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::UseableTarget' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CurrentNearestLocationIndex) == 0x000028, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CurrentNearestLocationIndex' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CurrentMinDistance) == 0x000030, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CurrentMinDistance' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, TargetsLocation) == 0x000038, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::TargetsLocation' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_GetActionTargetLocation_ReturnValue) == 0x000048, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_GetActionTargetLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000060, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_IsPlayerControlled_ReturnValue) == 0x000068, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_IsPlayerControlled_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_GetOwnerCharacter_ReturnValue_1) == 0x000070, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_GetOwnerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_GetActionTargetLocation_ReturnValue_1) == 0x000078, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_GetActionTargetLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000090, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_GetEnemiesByLocation_ReturnValue) == 0x0000A8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_GetEnemiesByLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, Temp_int_Loop_Counter_Variable) == 0x0000B8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_Add_IntInt_ReturnValue) == 0x0000BC, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, Temp_int_Array_Index_Variable) == 0x0000C0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_FindNearestActor_Distance) == 0x0000C4, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_FindNearestActor_Distance' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_FindNearestActor_ReturnValue) == 0x0000C8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_FindNearestActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_IsValid_ReturnValue) == 0x0000D0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_Array_Get_Item) == 0x0000D8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_Array_RemoveItem_ReturnValue) == 0x0000E0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_IsApplicableDamage_ReturnValue) == 0x0000E1, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_IsApplicableDamage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_Array_Length_ReturnValue) == 0x0000E4, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_Less_IntInt_ReturnValue) == 0x0000E8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0000F0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_GetNearestTargetLocation::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");

// Function BP_Skill_ThunderFunnel_Funnel.BP_Skill_ThunderFunnel_Funnel_C.InitMoveFunnelLocation
// 0x02C8 (0x02C8 - 0x0000)
struct BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation final
{
public:
	double                                        DeltaTime;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                FunnelLocationOffset;                              // 0x0008(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalCharacter*                          CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0028(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorUpVector_ReturnValue;             // 0x0040(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorRightVector_ReturnValue;          // 0x0058(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x00E8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_2;        // 0x0100(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_3;        // 0x0130(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_2;      // 0x0148(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0160(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0178(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0190(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_3;      // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_2;           // 0x01C0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x01D8(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation) == 0x000008, "Wrong alignment on BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation");
static_assert(sizeof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation) == 0x0002C8, "Wrong size on BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, DeltaTime) == 0x000000, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, FunnelLocationOffset) == 0x000008, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::FunnelLocationOffset' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000020, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000028, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_GetActorUpVector_ReturnValue) == 0x000040, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_GetActorUpVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_GetActorRightVector_ReturnValue) == 0x000058, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_GetActorRightVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_GetActorForwardVector_ReturnValue) == 0x000070, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_BreakVector_X) == 0x000088, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_BreakVector_Y) == 0x000090, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_BreakVector_Z) == 0x000098, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000A0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x0000A8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000C0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Multiply_VectorVector_ReturnValue) == 0x0000C8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000E0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x0000E8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Conv_DoubleToVector_ReturnValue_2) == 0x000100, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Conv_DoubleToVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000118, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Conv_DoubleToVector_ReturnValue_3) == 0x000130, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Conv_DoubleToVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Multiply_VectorVector_ReturnValue_2) == 0x000148, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Multiply_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Add_VectorVector_ReturnValue) == 0x000160, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000178, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Normal_ReturnValue) == 0x000190, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Multiply_VectorVector_ReturnValue_3) == 0x0001A8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Multiply_VectorVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_Add_VectorVector_ReturnValue_2) == 0x0001C0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_Add_VectorVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0001D8, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation, CallFunc_K2_SetActorLocation_ReturnValue) == 0x0002C0, "Member 'BP_Skill_ThunderFunnel_Funnel_C_InitMoveFunnelLocation::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");

// Function BP_Skill_ThunderFunnel_Funnel.BP_Skill_ThunderFunnel_Funnel_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_Skill_ThunderFunnel_Funnel_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Skill_ThunderFunnel_Funnel_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_Skill_ThunderFunnel_Funnel_C_ReceiveTick");
static_assert(sizeof(BP_Skill_ThunderFunnel_Funnel_C_ReceiveTick) == 0x000004, "Wrong size on BP_Skill_ThunderFunnel_Funnel_C_ReceiveTick");
static_assert(offsetof(BP_Skill_ThunderFunnel_Funnel_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_Skill_ThunderFunnel_Funnel_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_Skill_ThunderFunnel_Funnel.BP_Skill_ThunderFunnel_Funnel_C.SpawnBullet
// 0x0070 (0x0070 - 0x0000)
struct BP_Skill_ThunderFunnel_Funnel_C_SpawnBullet final
{
public:
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APalCharacter*                          CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SkillEffectBase_C*                  CallFunc_SpawnSkillEffect_SkillEffect;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_Skill_ThunderFunnel_Bullet_C*       K2Node_DynamicCast_AsBP_Skill_Thunder_Funnel_Bullet; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue_1;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_DoubleDouble_ReturnValue;            // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x3];                                       // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue_2;   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue_3;   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
