#pragma once

#include "Basic.hpp"


namespace PalSDK::Params
{

// Function BP_SkillEffect_Unique_GrassPanda_MusclePunch.BP_SkillEffect_Unique_GrassPanda_MusclePunch_C.ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch
// 0x01A0 (0x01A0 - 0x0000)
struct BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_2; // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_2;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_74[0x4];                                       // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_3; // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_2;        // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_2;                     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_2;              // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_AC[0x4];                                       // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_2;                // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_3;      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_3;        // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_3;                     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_3;              // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_3;               // 0x00EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_ED[0x3];                                       // 0x00ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_3;                // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_4; // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_4;      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_4;        // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue_4;                // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_4;                     // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_4;              // 0x0128(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_4;                     // 0x012C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12D[0x3];                                      // 0x012D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_4;               // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_139[0x7];                                      // 0x0139(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        K2Node_Event_DeltaSecond;                          // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_5;               // 0x0148(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_5;                     // 0x0149(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14A[0x2];                                      // 0x014A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x014C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_1;      // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_2;      // 0x016C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2;   // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_2;  // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_3;      // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3;   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_3;  // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_4;      // 0x018C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4;   // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_4;  // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch) == 0x000008, "Wrong alignment on BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch");
static_assert(sizeof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch) == 0x0001A0, "Wrong size on BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, EntryPoint) == 0x000000, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000004, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_Has_Been_Initd_Variable) == 0x000005, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x000006, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_IsClosed_Variable) == 0x000007, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_2) == 0x000010, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000018, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_GetFloatValue_ReturnValue) == 0x000028, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_SelectFloat_ReturnValue) == 0x000030, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_Has_Been_Initd_Variable_1) == 0x000038, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000040, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_IsClosed_Variable_1) == 0x000048, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000050, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_Has_Been_Initd_Variable_2) == 0x000058, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_Has_Been_Initd_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000060, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_FClamp_ReturnValue_1) == 0x000068, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_GetFloatValue_ReturnValue_1) == 0x000070, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_SelectFloat_ReturnValue_1) == 0x000078, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000080, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_3) == 0x000088, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Subtract_DoubleDouble_ReturnValue_2) == 0x000090, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Subtract_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Divide_DoubleDouble_ReturnValue_2) == 0x000098, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Divide_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_FClamp_ReturnValue_2) == 0x0000A0, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_GetFloatValue_ReturnValue_2) == 0x0000A8, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_GetFloatValue_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_SelectFloat_ReturnValue_2) == 0x0000B0, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_SelectFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_IsClosed_Variable_2) == 0x0000B8, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_IsClosed_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Multiply_DoubleDouble_ReturnValue_2) == 0x0000C0, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Multiply_DoubleDouble_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_IsClosed_Variable_3) == 0x0000C8, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_IsClosed_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Subtract_DoubleDouble_ReturnValue_3) == 0x0000D0, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Subtract_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Divide_DoubleDouble_ReturnValue_3) == 0x0000D8, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Divide_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_FClamp_ReturnValue_3) == 0x0000E0, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_FClamp_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_GetFloatValue_ReturnValue_3) == 0x0000E8, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_GetFloatValue_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_Has_Been_Initd_Variable_3) == 0x0000EC, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_Has_Been_Initd_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_SelectFloat_ReturnValue_3) == 0x0000F0, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_SelectFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Multiply_DoubleDouble_ReturnValue_3) == 0x0000F8, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Multiply_DoubleDouble_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_4) == 0x000100, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Subtract_DoubleDouble_ReturnValue_4) == 0x000108, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Subtract_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Divide_DoubleDouble_ReturnValue_4) == 0x000110, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Divide_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_SelectFloat_ReturnValue_4) == 0x000118, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_SelectFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_FClamp_ReturnValue_4) == 0x000120, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_FClamp_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_GetFloatValue_ReturnValue_4) == 0x000128, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_GetFloatValue_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_IsClosed_Variable_4) == 0x00012C, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_IsClosed_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Multiply_DoubleDouble_ReturnValue_4) == 0x000130, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Multiply_DoubleDouble_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_Has_Been_Initd_Variable_4) == 0x000138, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_Has_Been_Initd_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, K2Node_Event_DeltaSecond) == 0x000140, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::K2Node_Event_DeltaSecond' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_Has_Been_Initd_Variable_5) == 0x000148, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_Has_Been_Initd_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, Temp_bool_IsClosed_Variable_5) == 0x000149, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::Temp_bool_IsClosed_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x00014C, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000150, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000158, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_GetFloatValue_InTime_ImplicitCast_1) == 0x00015C, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_GetFloatValue_InTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x000160, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000168, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_GetFloatValue_InTime_ImplicitCast_2) == 0x00016C, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_GetFloatValue_InTime_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2) == 0x000170, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_SetVariableFloat_InValue_ImplicitCast_2) == 0x000178, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_SetVariableFloat_InValue_ImplicitCast_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_GetFloatValue_InTime_ImplicitCast_3) == 0x00017C, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_GetFloatValue_InTime_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3) == 0x000180, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_SetVariableFloat_InValue_ImplicitCast_3) == 0x000188, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_SetVariableFloat_InValue_ImplicitCast_3' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_GetFloatValue_InTime_ImplicitCast_4) == 0x00018C, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_GetFloatValue_InTime_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4) == 0x000190, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_4' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch, CallFunc_SetVariableFloat_InValue_ImplicitCast_4) == 0x000198, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_ExecuteUbergraph_BP_SkillEffect_Unique_GrassPanda_MusclePunch::CallFunc_SetVariableFloat_InValue_ImplicitCast_4' has a wrong offset!");

// Function BP_SkillEffect_Unique_GrassPanda_MusclePunch.BP_SkillEffect_Unique_GrassPanda_MusclePunch_C.FadeOutEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_FadeOutEffect final
{
public:
	double                                        DeltaSecond;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_FadeOutEffect) == 0x000008, "Wrong alignment on BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_FadeOutEffect");
static_assert(sizeof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_FadeOutEffect) == 0x000008, "Wrong size on BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_FadeOutEffect");
static_assert(offsetof(BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_FadeOutEffect, DeltaSecond) == 0x000000, "Member 'BP_SkillEffect_Unique_GrassPanda_MusclePunch_C_FadeOutEffect::DeltaSecond' has a wrong offset!");

}

