#pragma once

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace PalSDK::Params
{

// Function BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet.BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C.ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet
// 0x01D0 (0x01D0 - 0x0000)
struct BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetActorForwardVector_ReturnValue;        // 0x0008(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue;          // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Vector_One_ReturnValue;                   // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_DoubleToVector_ReturnValue_1;        // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorVector_ReturnValue_1;      // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x00A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalSkillEffectBase*                    K2Node_DynamicCast_AsPal_Skill_Effect_Base;        // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x3];                                       // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRangeFromStream_ReturnValue; // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x00B8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_AddRelativeRotation_SweepHitResult;    // 0x00D0(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	float                                         K2Node_VariableSet_ProjectileGravityScale_ImplicitCast; // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast; // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast; // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast; // 0x01C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Delay_Duration_ImplicitCast;              // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet) == 0x000008, "Wrong alignment on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet");
static_assert(sizeof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet) == 0x0001D0, "Wrong size on BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, EntryPoint) == 0x000000, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_GetActorForwardVector_ReturnValue) == 0x000008, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_GetActorForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_Conv_DoubleToVector_ReturnValue) == 0x000020, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_Conv_DoubleToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_Multiply_VectorVector_ReturnValue) == 0x000038, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_Multiply_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_Vector_One_ReturnValue) == 0x000050, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_Vector_One_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000068, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_Conv_DoubleToVector_ReturnValue_1) == 0x000070, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_Conv_DoubleToVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_Multiply_VectorVector_ReturnValue_1) == 0x000088, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_Multiply_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_GetOwner_ReturnValue) == 0x0000A0, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, K2Node_DynamicCast_AsPal_Skill_Effect_Base) == 0x0000A8, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::K2Node_DynamicCast_AsPal_Skill_Effect_Base' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_RandomFloatInRangeFromStream_ReturnValue) == 0x0000B4, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_RandomFloatInRangeFromStream_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_MakeRotator_ReturnValue) == 0x0000B8, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_K2_AddRelativeRotation_SweepHitResult) == 0x0000D0, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_K2_AddRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, K2Node_VariableSet_ProjectileGravityScale_ImplicitCast) == 0x0001B8, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::K2Node_VariableSet_ProjectileGravityScale_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast) == 0x0001BC, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast) == 0x0001C0, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_RandomFloatInRangeFromStream_Min_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast) == 0x0001C4, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_RandomFloatInRangeFromStream_Max_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet, CallFunc_Delay_Duration_ImplicitCast) == 0x0001C8, "Member 'BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Unique_VolcanicMonster_MagmaAttack_Bullet::CallFunc_Delay_Duration_ImplicitCast' has a wrong offset!");

}

