#pragma once

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace PalSDK::Params
{

// Function BP_SkillEffect_IcicleThrow_Blast.BP_SkillEffect_IcicleThrow_Blast_C.AttachOrEnableAttackCollisionToTarget
// 0x0080 (0x0080 - 0x0000)
struct BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       CallFunc_AddComponentByClass_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0020(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue_1;              // 0x0030(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue_1;          // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USphereComponent*>               CallFunc_GetComponentsByTag_ReturnValue;           // 0x0050(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_64[0x4];                                       // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       CallFunc_Array_Get_Item;                           // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_IsEmpty_ReturnValue;                // 0x0075(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_76[0x2];                                       // 0x0076(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget) == 0x000008, "Wrong alignment on BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget");
static_assert(sizeof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget) == 0x000080, "Wrong size on BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, Target) == 0x000000, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::Target' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, CallFunc_AddComponentByClass_ReturnValue) == 0x000010, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, Temp_int_Loop_Counter_Variable) == 0x000018, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, CallFunc_Add_IntInt_ReturnValue) == 0x00001C, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, CallFunc_GetObjectName_ReturnValue) == 0x000020, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, CallFunc_GetObjectName_ReturnValue_1) == 0x000030, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::CallFunc_GetObjectName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, CallFunc_Conv_StringToName_ReturnValue) == 0x000040, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, CallFunc_Conv_StringToName_ReturnValue_1) == 0x000048, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::CallFunc_Conv_StringToName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, CallFunc_GetComponentsByTag_ReturnValue) == 0x000050, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, CallFunc_Array_Add_ReturnValue) == 0x000060, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, CallFunc_Array_Get_Item) == 0x000068, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, CallFunc_Array_IsEmpty_ReturnValue) == 0x000075, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::CallFunc_Array_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget, CallFunc_Array_Add_ReturnValue_1) == 0x000078, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_AttachOrEnableAttackCollisionToTarget::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");

// Function BP_SkillEffect_IcicleThrow_Blast.BP_SkillEffect_IcicleThrow_Blast_C.BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_4_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_SkillEffect_IcicleThrow_Blast.BP_SkillEffect_IcicleThrow_Blast_C.BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Height_K2Node_ComponentBoundEvent_5_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_SkillEffect_IcicleThrow_Blast.BP_SkillEffect_IcicleThrow_Blast_C.BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_SkillEffect_IcicleThrow_Blast.BP_SkillEffect_IcicleThrow_Blast_C.BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Inner_K2Node_ComponentBoundEvent_3_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_SkillEffect_IcicleThrow_Blast.BP_SkillEffect_IcicleThrow_Blast_C.BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x0108 (0x0108 - 0x0000)
struct BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x00E8)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000108, "Wrong size on BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_SkillEffect_IcicleThrow_Blast.BP_SkillEffect_IcicleThrow_Blast_C.BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_BndEvt__BP_SkillEffect_IcicleThrow_Blast_AttackTrigger_Outer_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_SkillEffect_IcicleThrow_Blast.BP_SkillEffect_IcicleThrow_Blast_C.CheckAttackTriggers
// 0x0020 (0x0020 - 0x0000)
struct BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers) == 0x000008, "Wrong alignment on BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers");
static_assert(sizeof(BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers) == 0x000020, "Wrong size on BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers, CallFunc_Array_Get_Item) == 0x000010, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers, CallFunc_Less_IntInt_ReturnValue) == 0x000018, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers, CallFunc_Array_Contains_ReturnValue) == 0x000019, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers, CallFunc_Array_Contains_ReturnValue_1) == 0x00001A, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers::CallFunc_Array_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers, CallFunc_Not_PreBool_ReturnValue) == 0x00001B, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers, CallFunc_BooleanAND_ReturnValue) == 0x00001C, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_CheckAttackTriggers::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_SkillEffect_IcicleThrow_Blast.BP_SkillEffect_IcicleThrow_Blast_C.DestroyAllAttachedAttackCollisions
// 0x0028 (0x0028 - 0x0000)
struct BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions final
{
public:
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C[0x4];                                        // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       CallFunc_Array_Get_Item;                           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions) == 0x000008, "Wrong alignment on BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions");
static_assert(sizeof(BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions) == 0x000028, "Wrong size on BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions, Temp_int_Array_Index_Variable) == 0x000000, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000010, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions, CallFunc_Array_Get_Item) == 0x000018, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions, CallFunc_Array_Length_ReturnValue) == 0x000020, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions, CallFunc_Less_IntInt_ReturnValue) == 0x000024, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions, CallFunc_K2_AttachToComponent_ReturnValue) == 0x000025, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DestroyAllAttachedAttackCollisions::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");

// Function BP_SkillEffect_IcicleThrow_Blast.BP_SkillEffect_IcicleThrow_Blast_C.DisableAttachedAttackCollision
// 0x0058 (0x0058 - 0x0000)
struct BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision final
{
public:
	class AActor*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14[0x4];                                       // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0018(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USphereComponent*>               CallFunc_GetComponentsByTag_ReturnValue;           // 0x0030(0x0010)(ReferenceParm, ContainsInstancedReference)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USphereComponent*                       CallFunc_Array_Get_Item;                           // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision) == 0x000008, "Wrong alignment on BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision");
static_assert(sizeof(BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision) == 0x000058, "Wrong size on BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision, Target) == 0x000000, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision::Target' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision, Temp_int_Array_Index_Variable) == 0x000008, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision, Temp_int_Loop_Counter_Variable) == 0x00000C, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision, CallFunc_Add_IntInt_ReturnValue) == 0x000010, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision, CallFunc_GetObjectName_ReturnValue) == 0x000018, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision::CallFunc_GetObjectName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision, CallFunc_Conv_StringToName_ReturnValue) == 0x000028, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision, CallFunc_GetComponentsByTag_ReturnValue) == 0x000030, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision, CallFunc_Array_Get_Item) == 0x000048, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision, CallFunc_Less_IntInt_ReturnValue) == 0x000050, "Member 'BP_SkillEffect_IcicleThrow_Blast_C_DisableAttachedAttackCollision::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

// Function BP_SkillEffect_IcicleThrow_Blast.BP_SkillEffect_IcicleThrow_Blast_C.DrawDebug
// 0x0230 (0x0230 - 0x0000)
struct BP_SkillEffect_IcicleThrow_Blast_C_DrawDebug final
{
public:
	class FString                                 Debug_ActorsInOuterTrigger;                        // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	class FString                                 Debug_ActorsInInnerTrigger;                        // 0x0010(0x0010)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_44[0x4];                                       // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetNiagaraArrayVectorValue_ReturnValue;   // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetObjectName_ReturnValue;                // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_VectorToString_ReturnValue;          // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetPlayerPawn_ReturnValue;                // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class USphereComponent*>               CallFunc_GetComponentsByTag_ReturnValue;           // 0x0090(0x0010)(ReferenceParm, ContainsInstancedReference)
	class USphereComponent*                       CallFunc_Array_Get_Item;                           // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x00A8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue;               // 0x00B8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x00C8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_DD[0x3];                                       // 0x00DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item_1;                         // 0x00E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_EC[0x4];                                       // 0x00EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetDisplayName_ReturnValue_1;             // 0x00F0(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0108(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_3;              // 0x0118(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_2;                         // 0x0128(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetDisplayName_ReturnValue_2;             // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_4;              // 0x0158(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0168(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_184[0x4];                                      // 0x0184(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0188(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A1[0x7];                                      // 0x01A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x01A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
