#pragma once

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace PalSDK::Params
{

// Function BP_SkillEffect_Inferno_Bullet.BP_SkillEffect_Inferno_Bullet_C.ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet
// 0x00B8 (0x00B8 - 0x0000)
struct BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable;                       // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable; // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Has_Been_Initd_Variable_1;               // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_SelectFloat_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue;                       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue;                // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2C[0x4];                                       // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1; // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FClamp_ReturnValue_1;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0058(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_ReturnValue_1;              // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_SelectFloat_ReturnValue_1;                // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0080(0x0008)(NoDestructor, HasGetValueTypeHash)
	double                                        K2Node_Event_DeltaSecond;                          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_IsClosed_Variable_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x3];                                       // 0x0091(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast;        // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetFloatValue_InTime_ImplicitCast_1;      // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_SetTimerDelegate_Time_ImplicitCast;    // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet) == 0x000008, "Wrong alignment on BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet");
static_assert(sizeof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet) == 0x0000B8, "Wrong size on BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, EntryPoint) == 0x000000, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, Temp_bool_Has_Been_Initd_Variable) == 0x000004, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::Temp_bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, Temp_bool_IsClosed_Variable) == 0x000005, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::Temp_bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable) == 0x000006, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, Temp_bool_Has_Been_Initd_Variable_1) == 0x000007, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::Temp_bool_Has_Been_Initd_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000008, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x000010, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_SelectFloat_ReturnValue) == 0x000018, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_SelectFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_FClamp_ReturnValue) == 0x000020, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_GetFloatValue_ReturnValue) == 0x000028, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_GetFloatValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000030, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1) == 0x000038, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::Temp_bool_Whether_the_gate_is_currently_open_or_close_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000040, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_Divide_DoubleDouble_ReturnValue_1) == 0x000048, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_Divide_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_FClamp_ReturnValue_1) == 0x000050, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, K2Node_CreateDelegate_OutputDelegate) == 0x000058, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_GetFloatValue_ReturnValue_1) == 0x000068, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_GetFloatValue_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_SelectFloat_ReturnValue_1) == 0x000070, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_SelectFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000078, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000080, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, K2Node_Event_DeltaSecond) == 0x000088, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::K2Node_Event_DeltaSecond' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, Temp_bool_IsClosed_Variable_1) == 0x000090, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::Temp_bool_IsClosed_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_GetFloatValue_InTime_ImplicitCast) == 0x000094, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_GetFloatValue_InTime_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x000098, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x0000A0, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_GetFloatValue_InTime_ImplicitCast_1) == 0x0000A4, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_GetFloatValue_InTime_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1) == 0x0000A8, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_Multiply_DoubleDouble_A_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x0000B0, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet, CallFunc_K2_SetTimerDelegate_Time_ImplicitCast) == 0x0000B4, "Member 'BP_SkillEffect_Inferno_Bullet_C_ExecuteUbergraph_BP_SkillEffect_Inferno_Bullet::CallFunc_K2_SetTimerDelegate_Time_ImplicitCast' has a wrong offset!");

// Function BP_SkillEffect_Inferno_Bullet.BP_SkillEffect_Inferno_Bullet_C.FadeOutEffect
// 0x0008 (0x0008 - 0x0000)
struct BP_SkillEffect_Inferno_Bullet_C_FadeOutEffect final
{
public:
	double                                        DeltaSecond;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Inferno_Bullet_C_FadeOutEffect) == 0x000008, "Wrong alignment on BP_SkillEffect_Inferno_Bullet_C_FadeOutEffect");
static_assert(sizeof(BP_SkillEffect_Inferno_Bullet_C_FadeOutEffect) == 0x000008, "Wrong size on BP_SkillEffect_Inferno_Bullet_C_FadeOutEffect");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_FadeOutEffect, DeltaSecond) == 0x000000, "Member 'BP_SkillEffect_Inferno_Bullet_C_FadeOutEffect::DeltaSecond' has a wrong offset!");

// Function BP_SkillEffect_Inferno_Bullet.BP_SkillEffect_Inferno_Bullet_C.SetRandomValueIntoNiagaraVariable
// 0x0030 (0x0030 - 0x0000)
struct BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable final
{
public:
	class UNiagaraComponent*                      NiagaraComp;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_1;         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_RandomFloatInRange_ReturnValue_2;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast;    // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_1;  // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SetVariableFloat_InValue_ImplicitCast_2;  // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable) == 0x000008, "Wrong alignment on BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable");
static_assert(sizeof(BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable) == 0x000030, "Wrong size on BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable, NiagaraComp) == 0x000000, "Member 'BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable::NiagaraComp' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable, CallFunc_RandomFloatInRange_ReturnValue_1) == 0x000010, "Member 'BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable::CallFunc_RandomFloatInRange_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable, CallFunc_RandomFloatInRange_ReturnValue_2) == 0x000018, "Member 'BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable::CallFunc_RandomFloatInRange_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable, CallFunc_SetVariableFloat_InValue_ImplicitCast) == 0x000020, "Member 'BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable::CallFunc_SetVariableFloat_InValue_ImplicitCast' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable, CallFunc_SetVariableFloat_InValue_ImplicitCast_1) == 0x000024, "Member 'BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable::CallFunc_SetVariableFloat_InValue_ImplicitCast_1' has a wrong offset!");
static_assert(offsetof(BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable, CallFunc_SetVariableFloat_InValue_ImplicitCast_2) == 0x000028, "Member 'BP_SkillEffect_Inferno_Bullet_C_SetRandomValueIntoNiagaraVariable::CallFunc_SetVariableFloat_InValue_ImplicitCast_2' has a wrong offset!");

}

