#pragma once

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace PalSDK::Params
{

// Function BP_UltimateRiverTool.BP_UltimateRiverTool_C.ExecuteUbergraph_BP_UltimateRiverTool
// 0x0680 (0x0680 - 0x0000)
struct BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D[0x3];                                        // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_15[0x3];                                       // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_5;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_54[0x4];                                       // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_Array_Get_Item;                           // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         CallFunc_GetOverlappingActors_OverlappingActors;   // 0x0060(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetDirectionAtSplinePoint_ReturnValue;    // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X;                            // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtSplinePoint_ReturnValue;     // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_True_if_break_was_hit_Variable_1;        // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C1[0x7];                                       // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_1;                          // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0xF];                                       // 0x00E1(0x000F)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Temp_struct_Variable;                              // 0x00F0(0x0060)(ConstParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_5;                  // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_5;                 // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_6;                   // 0x0168(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_16C[0x4];                                      // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   CallFunc_Array_Get_Item_1;                         // 0x0170(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x017C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_17D[0x3];                                      // 0x017D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent_1;          // 0x0180(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor_1;                   // 0x0188(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp_1;                    // 0x0190(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex_1;               // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19C[0x4];                                      // 0x019C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APawn*                                  K2Node_DynamicCast_AsPawn;                         // 0x01A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x01A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A9[0x7];                                      // 0x01A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x01B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPostProcessComponent*>          CallFunc_GetComponentsByTag_ReturnValue;           // 0x01B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue;               // 0x01C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C9[0x7];                                      // 0x01C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostProcessComponent*                  CallFunc_Array_Get_Item_2;                         // 0x01D0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1DD[0x3];                                      // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x01E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x01F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0210(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerController_ReturnValue;           // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_221[0x7];                                      // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0228(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_GetOverlappingComponents_OverlappingComponents; // 0x0240(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UCharacterMovementComponent*            CallFunc_GetComponentByClass_ReturnValue;          // 0x0250(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_3;                         // 0x0258(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USplineMeshComponent*                   K2Node_DynamicCast_AsSpline_Mesh_Component;        // 0x0260(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_269[0x3];                                      // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x026C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0270(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x0271(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0272(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_273[0x5];                                      // 0x0273(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_CustomEvent_OverlappedComponent;            // 0x0278(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x0280(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_CustomEvent_OtherComp;                      // 0x0288(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OtherBodyIndex;                 // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bFromSweep;                     // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_295[0x3];                                      // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_CustomEvent_SweepResult;                    // 0x0298(0x00E8)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x0380(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x0398(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x03B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_3;                          // 0x03C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_3;                          // 0x03D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_3;                          // 0x03D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_4;                          // 0x03E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_4;                          // 0x03E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_4;                          // 0x03F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x03F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AStaticMeshActor*                       K2Node_DynamicCast_AsStatic_Mesh_Actor;            // 0x0400(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_409[0x7];                                      // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0418(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnySimulatingPhysics_ReturnValue;       // 0x0430(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_431[0x7];                                      // 0x0431(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCharacterMovementComponent*            CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0438(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_DynamicCast_AsPawn_1;                       // 0x0440(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_449[0x7];                                      // 0x0449(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0450(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0458(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0460(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_461[0x7];                                      // 0x0461(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0468(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ClassIsChildOf_ReturnValue_1;             // 0x0480(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_481[0x7];                                      // 0x0481(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPostProcessComponent*>          CallFunc_GetComponentsByTag_ReturnValue_1;         // 0x0488(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPostProcessComponent*                  CallFunc_Array_Get_Item_4;                         // 0x0498(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_5;               // 0x04A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x04A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A5[0x3];                                      // 0x04A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPostProcessComponent*                  CallFunc_AddComponent_ReturnValue;                 // 0x04A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x04B0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UPrimitiveComponent*>            CallFunc_GetOverlappingComponents_OverlappingComponents_1; // 0x04B8(0x0010)(ReferenceParm, ContainsInstancedReference)
	class APlayerController*                      K2Node_DynamicCast_AsPlayer_Controller;            // 0x04C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4D1[0x7];                                      // 0x04D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    CallFunc_Array_Get_Item_5;                         // 0x04D8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_6;               // 0x04E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4E4[0x4];                                      // 0x04E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USplineMeshComponent*                   K2Node_DynamicCast_AsSpline_Mesh_Component_1;      // 0x04E8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x04F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_5;                // 0x04F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x04F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x04F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue_1;             // 0x04F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsPlayerController_ReturnValue_1;         // 0x04F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4F6[0x2];                                      // 0x04F6(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_6;                  // 0x04F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_6;                // 0x04FC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4FD[0x3];                                      // 0x04FD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_6;                 // 0x0500(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_7;                  // 0x0504(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_7;                 // 0x0508(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult)> K2Node_CreateDelegate_OutputDelegate;              // 0x050C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x051C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_7;                   // 0x052C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_Array_Get_Item_6;                         // 0x0530(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           CallFunc_K2_GetComponentsByClass_ReturnValue;      // 0x0538(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UStaticMeshComponent*                   CallFunc_Array_Get_Item_7;                         // 0x0548(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_7;               // 0x0550(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_554[0x4];                                      // 0x0554(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetPhysicsLinearVelocity_ReturnValue;     // 0x0558(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_7;                // 0x0570(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571[0x7];                                      // 0x0571(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X_5;                          // 0x0578(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_5;                          // 0x0580(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_5;                          // 0x0588(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMass_ReturnValue;                      // 0x0590(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_594[0x4];                                      // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0598(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_2;      // 0x05B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_6;                          // 0x05B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_6;                          // 0x05C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_6;                          // 0x05C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAnySimulatingPhysics_ReturnValue_1;     // 0x05D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D1[0x7];                                      // 0x05D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x05D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_2;      // 0x05E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x05E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5E9[0x7];                                      // 0x05E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Abs_ReturnValue;                          // 0x05F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue_1;        // 0x05F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MultiplyMultiply_FloatFloat_ReturnValue;  // 0x0600(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0608(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_3;      // 0x0620(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Abs_ReturnValue_1;                        // 0x0628(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_4;      // 0x0630(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0638(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0650(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0658(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_2;     // 0x0660(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x0668(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x0670(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool) == 0x000010, "Wrong alignment on BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool");
static_assert(sizeof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool) == 0x000680, "Wrong size on BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, EntryPoint) == 0x000000, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_int_Loop_Counter_Variable) == 0x000004, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Add_IntInt_ReturnValue) == 0x000008, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_bool_True_if_break_was_hit_Variable) == 0x00000C, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_int_Array_Index_Variable) == 0x000010, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Not_PreBool_ReturnValue) == 0x000014, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_int_Loop_Counter_Variable_1) == 0x000018, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Add_IntInt_ReturnValue_1) == 0x00001C, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_int_Loop_Counter_Variable_2) == 0x000020, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Add_IntInt_ReturnValue_2) == 0x000024, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_int_Array_Index_Variable_1) == 0x000028, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_int_Loop_Counter_Variable_3) == 0x00002C, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Add_IntInt_ReturnValue_3) == 0x000030, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_int_Array_Index_Variable_2) == 0x000034, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_int_Loop_Counter_Variable_4) == 0x000038, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Add_IntInt_ReturnValue_4) == 0x00003C, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_int_Array_Index_Variable_3) == 0x000040, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_Event_DeltaSeconds) == 0x000044, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Array_Length_ReturnValue) == 0x000048, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_int_Array_Index_Variable_4) == 0x00004C, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_int_Array_Index_Variable_5) == 0x000050, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_int_Array_Index_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Array_Get_Item) == 0x000058, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_GetOverlappingActors_OverlappingActors) == 0x000060, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_GetOverlappingActors_OverlappingActors' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Array_Length_ReturnValue_1) == 0x000070, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_GetDirectionAtSplinePoint_ReturnValue) == 0x000078, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_GetDirectionAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_X) == 0x000090, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_Y) == 0x000098, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_Z) == 0x0000A0, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_GetLocationAtSplinePoint_ReturnValue) == 0x0000A8, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_GetLocationAtSplinePoint_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_bool_True_if_break_was_hit_Variable_1) == 0x0000C0, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_X_1) == 0x0000C8, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_Y_1) == 0x0000D0, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_Z_1) == 0x0000D8, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000E0, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_struct_Variable) == 0x0000F0, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000150, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x000158, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_int_Loop_Counter_Variable_5) == 0x000160, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_int_Loop_Counter_Variable_5' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Add_IntInt_ReturnValue_5) == 0x000164, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Add_IntInt_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, Temp_int_Array_Index_Variable_6) == 0x000168, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::Temp_int_Array_Index_Variable_6' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Array_Get_Item_1) == 0x000170, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Array_Length_ReturnValue_2) == 0x000178, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Less_IntInt_ReturnValue_1) == 0x00017C, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_CustomEvent_OverlappedComponent_1) == 0x000180, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_CustomEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_CustomEvent_OtherActor_1) == 0x000188, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_CustomEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_CustomEvent_OtherComp_1) == 0x000190, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_CustomEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_CustomEvent_OtherBodyIndex_1) == 0x000198, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_CustomEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_DynamicCast_AsPawn) == 0x0001A0, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_DynamicCast_AsPawn' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_DynamicCast_bSuccess) == 0x0001A8, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_GetObjectClass_ReturnValue) == 0x0001B0, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_GetComponentsByTag_ReturnValue) == 0x0001B8, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_GetComponentsByTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_ClassIsChildOf_ReturnValue) == 0x0001C8, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_ClassIsChildOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Array_Get_Item_2) == 0x0001D0, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Array_Length_ReturnValue_3) == 0x0001D8, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001DC, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_K2_GetActorLocation_ReturnValue) == 0x0001E0, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_X_2) == 0x0001F8, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_Y_2) == 0x000200, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_Z_2) == 0x000208, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_GetController_ReturnValue) == 0x000210, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x000218, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_IsPlayerController_ReturnValue) == 0x000220, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_IsPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_MakeVector_ReturnValue) == 0x000228, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_GetOverlappingComponents_OverlappingComponents) == 0x000240, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_GetOverlappingComponents_OverlappingComponents' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_GetComponentByClass_ReturnValue) == 0x000250, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Array_Get_Item_3) == 0x000258, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_DynamicCast_AsSpline_Mesh_Component) == 0x000260, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_DynamicCast_AsSpline_Mesh_Component' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_DynamicCast_bSuccess_1) == 0x000268, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Array_Length_ReturnValue_4) == 0x00026C, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Array_Contains_ReturnValue) == 0x000270, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Less_IntInt_ReturnValue_3) == 0x000271, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BooleanAND_ReturnValue) == 0x000272, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_CustomEvent_OverlappedComponent) == 0x000278, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_CustomEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_CustomEvent_OtherActor) == 0x000280, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_CustomEvent_OtherComp) == 0x000288, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_CustomEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_CustomEvent_OtherBodyIndex) == 0x000290, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_CustomEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_CustomEvent_bFromSweep) == 0x000294, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_CustomEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_CustomEvent_SweepResult) == 0x000298, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_CustomEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_GetActorBounds_Origin) == 0x000380, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_GetActorBounds_BoxExtent) == 0x000398, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x0003B0, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_X_3) == 0x0003C8, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_Y_3) == 0x0003D0, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_Z_3) == 0x0003D8, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_X_4) == 0x0003E0, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_Y_4) == 0x0003E8, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_BreakVector_Z_4) == 0x0003F0, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0003F8, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_DynamicCast_AsStatic_Mesh_Actor) == 0x000400, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_DynamicCast_AsStatic_Mesh_Actor' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, K2Node_DynamicCast_bSuccess_2) == 0x000408, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000410, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_MakeVector_ReturnValue_1) == 0x000418, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_IsAnySimulatingPhysics_ReturnValue) == 0x000430, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_IsAnySimulatingPhysics_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000438, "Member 'BP_UltimateRiverTool_C_ExecuteUbergraph_BP_UltimateRiverTool::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
