#pragma once

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace PalSDK::Params
{

// Function WBP_IngameMenu_PalCondense.WBP_IngameMenu_PalCondense_C.BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_10_OnUnhoveredSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_10_OnUnhoveredSlot__DelegateSignature final
{
public:
	class UWBP_PalCharacterSlotButtonBase_C*      Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_10_OnUnhoveredSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_10_OnUnhoveredSlot__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_10_OnUnhoveredSlot__DelegateSignature) == 0x000008, "Wrong size on WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_10_OnUnhoveredSlot__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_10_OnUnhoveredSlot__DelegateSignature, Widget) == 0x000000, "Member 'WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_10_OnUnhoveredSlot__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_IngameMenu_PalCondense.WBP_IngameMenu_PalCondense_C.BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_6_OnLeftClickedSlot__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_6_OnLeftClickedSlot__DelegateSignature final
{
public:
	class UWBP_PalCharacterSlotButtonBase_C*      Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         PressType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_6_OnLeftClickedSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_6_OnLeftClickedSlot__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_6_OnLeftClickedSlot__DelegateSignature) == 0x000010, "Wrong size on WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_6_OnLeftClickedSlot__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_6_OnLeftClickedSlot__DelegateSignature, Widget) == 0x000000, "Member 'WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_6_OnLeftClickedSlot__DelegateSignature::Widget' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_6_OnLeftClickedSlot__DelegateSignature, PressType) == 0x000008, "Member 'WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_6_OnLeftClickedSlot__DelegateSignature::PressType' has a wrong offset!");

// Function WBP_IngameMenu_PalCondense.WBP_IngameMenu_PalCondense_C.BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_7_OnUpdatedPage__DelegateSignature
// 0x0004 (0x0004 - 0x0000)
struct WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_7_OnUpdatedPage__DelegateSignature final
{
public:
	int32                                         NowPage;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_7_OnUpdatedPage__DelegateSignature) == 0x000004, "Wrong alignment on WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_7_OnUpdatedPage__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_7_OnUpdatedPage__DelegateSignature) == 0x000004, "Wrong size on WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_7_OnUpdatedPage__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_7_OnUpdatedPage__DelegateSignature, NowPage) == 0x000000, "Member 'WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_7_OnUpdatedPage__DelegateSignature::NowPage' has a wrong offset!");

// Function WBP_IngameMenu_PalCondense.WBP_IngameMenu_PalCondense_C.BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_8_OnCreatedNewSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_8_OnCreatedNewSlot__DelegateSignature final
{
public:
	class UWBP_PalCharacterSlotButtonBase_C*      NewSlot;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_8_OnCreatedNewSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_8_OnCreatedNewSlot__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_8_OnCreatedNewSlot__DelegateSignature) == 0x000008, "Wrong size on WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_8_OnCreatedNewSlot__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_8_OnCreatedNewSlot__DelegateSignature, NewSlot) == 0x000000, "Member 'WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_8_OnCreatedNewSlot__DelegateSignature::NewSlot' has a wrong offset!");

// Function WBP_IngameMenu_PalCondense.WBP_IngameMenu_PalCondense_C.BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_9_OnHoveredSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_9_OnHoveredSlot__DelegateSignature final
{
public:
	class UWBP_PalCharacterSlotButtonBase_C*      Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_9_OnHoveredSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_9_OnHoveredSlot__DelegateSignature");
static_assert(sizeof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_9_OnHoveredSlot__DelegateSignature) == 0x000008, "Wrong size on WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_9_OnHoveredSlot__DelegateSignature");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_9_OnHoveredSlot__DelegateSignature, Widget) == 0x000000, "Member 'WBP_IngameMenu_PalCondense_C_BndEvt__WBP_IngameMenu_PalCondense_WBP_BoxPalList_K2Node_ComponentBoundEvent_9_OnHoveredSlot__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_IngameMenu_PalCondense.WBP_IngameMenu_PalCondense_C.Cancel Condense
// 0x00F8 (0x00F8 - 0x0000)
struct WBP_IngameMenu_PalCondense_C_Cancel_Condense final
{
public:
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_PalCharacterSlotButtonBase_C*> CallFunc_GetNowDisplayingSlots_Slots;              // 0x0018(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalCharacterSlotButtonBase_C*      CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalCommonCharacterSlotButton_C*    K2Node_DynamicCast_AsWBP_Pal_Common_Character_Slot_Button; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterSlot*            CallFunc_GetTargetSlot_targetSlot;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          CallFunc_GetHandle_ReturnValue;                    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRank_ReturnValue;                      // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x006C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D[0x3];                                       // 0x006D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_75[0x3];                                       // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue_1;             // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 NowRank, int32 OldRank)> K2Node_CreateDelegate_OutputDelegate;              // 0x0080(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue_1;  // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x00B2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00B3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B4[0x4];                                       // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCommonCharacterSlotButton_C*    CallFunc_Array_Get_Item_1;                         // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterSlot*            CallFunc_GetTargetSlot_targetSlot_1;               // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue_1;                    // 0x00CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x00CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CE[0x2];                                       // 0x00CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterHandle*          CallFunc_GetHandle_ReturnValue_1;                  // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue_2;  // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetRank_ReturnValue_1;                    // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E4[0x4];                                       // 0x00E4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_PalCondense_C_Cancel_Condense) == 0x000008, "Wrong alignment on WBP_IngameMenu_PalCondense_C_Cancel_Condense");
static_assert(sizeof(WBP_IngameMenu_PalCondense_C_Cancel_Condense) == 0x0000F8, "Wrong size on WBP_IngameMenu_PalCondense_C_Cancel_Condense");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, Temp_int_Loop_Counter_Variable) == 0x000000, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_Add_IntInt_ReturnValue) == 0x000004, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, Temp_int_Array_Index_Variable) == 0x000008, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, Temp_int_Loop_Counter_Variable_1) == 0x00000C, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, Temp_int_Array_Index_Variable_1) == 0x000010, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_Add_IntInt_ReturnValue_1) == 0x000014, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_GetNowDisplayingSlots_Slots) == 0x000018, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_GetNowDisplayingSlots_Slots' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_GetGameSetting_ReturnValue) == 0x000028, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, K2Node_DynamicCast_AsWBP_Pal_Common_Character_Slot_Button) == 0x000038, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::K2Node_DynamicCast_AsWBP_Pal_Common_Character_Slot_Button' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_GetTargetSlot_targetSlot) == 0x000048, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_GetTargetSlot_targetSlot' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_GetHandle_ReturnValue) == 0x000050, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_GetHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_IsEmpty_ReturnValue) == 0x000058, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000060, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_GetRank_ReturnValue) == 0x000068, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_GetRank_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00006C, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_Array_Length_ReturnValue) == 0x000070, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_Less_IntInt_ReturnValue) == 0x000074, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_GetGameSetting_ReturnValue_1) == 0x000078, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_GetGameSetting_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, K2Node_CreateDelegate_OutputDelegate) == 0x000080, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_IsValid_ReturnValue) == 0x000090, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_TryGetIndividualParameter_ReturnValue_1) == 0x000098, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_TryGetIndividualParameter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0000A8, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_GetCurrentInputType_ReturnValue) == 0x0000B0, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_Array_Contains_ReturnValue) == 0x0000B1, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0000B2, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_IsValid_ReturnValue_2) == 0x0000B3, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_Array_Get_Item_1) == 0x0000B8, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_GetTargetSlot_targetSlot_1) == 0x0000C0, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_GetTargetSlot_targetSlot_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_Array_Length_ReturnValue_1) == 0x0000C8, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_IsEmpty_ReturnValue_1) == 0x0000CC, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_IsEmpty_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_Less_IntInt_ReturnValue_1) == 0x0000CD, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_GetHandle_ReturnValue_1) == 0x0000D0, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_GetHandle_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_TryGetIndividualParameter_ReturnValue_2) == 0x0000D8, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_TryGetIndividualParameter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_GetRank_ReturnValue_1) == 0x0000E0, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_GetRank_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_PlayAnimation_ReturnValue) == 0x0000E8, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_Cancel_Condense, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x0000F0, "Member 'WBP_IngameMenu_PalCondense_C_Cancel_Condense::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function WBP_IngameMenu_PalCondense.WBP_IngameMenu_PalCondense_C.ConfirmSuccess
// 0x0001 (0x0001 - 0x0000)
struct WBP_IngameMenu_PalCondense_C_ConfirmSuccess final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_PalCondense_C_ConfirmSuccess) == 0x000001, "Wrong alignment on WBP_IngameMenu_PalCondense_C_ConfirmSuccess");
static_assert(sizeof(WBP_IngameMenu_PalCondense_C_ConfirmSuccess) == 0x000001, "Wrong size on WBP_IngameMenu_PalCondense_C_ConfirmSuccess");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ConfirmSuccess, bResult) == 0x000000, "Member 'WBP_IngameMenu_PalCondense_C_ConfirmSuccess::bResult' has a wrong offset!");

// Function WBP_IngameMenu_PalCondense.WBP_IngameMenu_PalCondense_C.ExecuteUbergraph_WBP_IngameMenu_PalCondense
// 0x0450 (0x0450 - 0x0000)
struct WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bResult)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable;                     // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDDispatchParameter_CharacterRankUp* K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Character_Rank_Up; // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCommonCharacterSlotButton_C*    CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3C[0x4];                                       // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_PalCharacterRankUpModel_C*          CallFunc_SpawnObject_ReturnValue;                  // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_PalCharacterSlotButtonBase_C* Widget, EPalItemSlotPressType PressType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_PalCommonCharacterSlotButton_C*> K2Node_MakeArray_Array;                            // 0x0058(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(class UWBP_PalCharacterSlotButtonBase_C* Widget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0068(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bResult)>                 K2Node_CreateDelegate_OutputDelegate_3;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_PalCharacterSlotButtonBase_C* Widget)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0098(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetFocusTarget_widget;                    // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_MainMenu_PalRarityStar_C*>  K2Node_MakeArray_Array_1;                          // 0x00A8(0x0010)(ReferenceParm, ContainsInstancedReference)
	TDelegate<void(bool bResult)>                 K2Node_CreateDelegate_OutputDelegate_5;            // 0x00B8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsConfirmed;                    // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C9[0x7];                                       // 0x00C9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x00D0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x00E8(0x0050)(HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_1;        // 0x0138(0x0018)()
	int32                                         K2Node_CustomEvent_NewRank;                        // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_OldRank;                        // 0x0154(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bResult_2;                      // 0x0158(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_159[0x3];                                      // 0x0159(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_162[0x2];                                      // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0164(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0168(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_171[0x7];                                      // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetNickName_outName;                      // 0x0178(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0188(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x01A0(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x01F0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_2;        // 0x0200(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0218(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x0230(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_3;                          // 0x0280(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue_1;                     // 0x0290(0x0018)()
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x02A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A9[0x3];                                      // 0x02A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool bResult)>                 K2Node_CreateDelegate_OutputDelegate_6;            // 0x02AC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x02BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2BD[0x3];                                      // 0x02BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  CallFunc_Dialog_ReturnValue;                       // 0x02C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bResult_1;                      // 0x02D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2D1[0x7];                                      // 0x02D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_3;        // 0x02D8(0x0018)()
	struct FGuid                                  CallFunc_Dialog_ReturnValue_1;                     // 0x02F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0300(0x0018)()
	bool                                          K2Node_CustomEvent_bResult;                        // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_SelectText_ReturnValue;                   // 0x0320(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_3;            // 0x0338(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_4;                          // 0x0388(0x0010)(ReferenceParm)
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text_4;        // 0x0398(0x0018)()
	class FText                                   CallFunc_Format_ReturnValue_2;                     // 0x03B0(0x0018)()
	struct FGuid                                  CallFunc_Dialog_ReturnValue_2;                     // 0x03C8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_Dialog_ReturnValue_3;                     // 0x03D8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOverflowResourcesForTarget_ReturnValue; // 0x03E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3E9[0x7];                                      // 0x03E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCharacterSlotButtonBase_C*      K2Node_ComponentBoundEvent_Widget_2;               // 0x03F0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         K2Node_ComponentBoundEvent_pressType;              // 0x03F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x03F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalUIPalCharacterRankUpRequestResult         CallFunc_CanInvokeRankUp_ReturnValue;              // 0x03FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3FB[0x1];                                      // 0x03FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_ComponentBoundEvent_NowPage;                // 0x03FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_401[0x7];                                      // 0x0401(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCharacterSlotButtonBase_C*      K2Node_ComponentBoundEvent_NewSlot;                // 0x0408(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalCommonCharacterSlotButton_C*    K2Node_DynamicCast_AsWBP_Pal_Common_Character_Slot_Button; // 0x0410(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_419[0x7];                                      // 0x0419(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCharacterSlotButtonBase_C*      K2Node_ComponentBoundEvent_Widget_1;               // 0x0420(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsSlotSync_WaitingSync;                // 0x0428(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_429[0x7];                                      // 0x0429(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_PalCharacterSlotButtonBase_C*      K2Node_ComponentBoundEvent_Widget;                 // 0x0430(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0438(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_439[0x3];                                      // 0x0439(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_PalCharacterSlotButtonBase_C* SelfButton)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x043C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense) == 0x000008, "Wrong alignment on WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense");
static_assert(sizeof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense) == 0x000450, "Wrong size on WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, EntryPoint) == 0x000000, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, Temp_int_Array_Index_Variable) == 0x000014, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_GetParam_ReturnValue) == 0x000018, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Character_Rank_Up) == 0x000020, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_Character_Rank_Up' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_SpawnObject_ReturnValue) == 0x000040, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_SpawnObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_CreateDelegate_OutputDelegate_1) == 0x000048, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_MakeArray_Array) == 0x000058, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_CreateDelegate_OutputDelegate_2) == 0x000068, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_CreateDelegate_OutputDelegate_3) == 0x000078, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_CreateDelegate_OutputDelegate_4) == 0x000088, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_PlayAnimation_ReturnValue) == 0x000098, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_GetFocusTarget_widget) == 0x0000A0, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_GetFocusTarget_widget' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_MakeArray_Array_1) == 0x0000A8, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000B8, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_CustomEvent_IsConfirmed) == 0x0000C8, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_CustomEvent_IsConfirmed' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_GetLocalizedTextFromHandle_Text) == 0x0000D0, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_MakeStruct_FormatArgumentData) == 0x0000E8, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_GetLocalizedTextFromHandle_Text_1) == 0x000138, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_GetLocalizedTextFromHandle_Text_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_CustomEvent_NewRank) == 0x000150, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_CustomEvent_NewRank' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_CustomEvent_OldRank) == 0x000154, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_CustomEvent_OldRank' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_CustomEvent_bResult_2) == 0x000158, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_CustomEvent_bResult_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, Temp_int_Loop_Counter_Variable) == 0x00015C, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_Less_IntInt_ReturnValue) == 0x000161, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_Add_IntInt_ReturnValue) == 0x000164, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000168, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_IsValid_ReturnValue_1) == 0x000170, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_GetNickName_outName) == 0x000178, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_GetNickName_outName' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_Conv_StringToText_ReturnValue) == 0x000188, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_MakeStruct_FormatArgumentData_1) == 0x0001A0, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_MakeStruct_FormatArgumentData_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_MakeArray_Array_2) == 0x0001F0, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_MakeArray_Array_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_GetLocalizedTextFromHandle_Text_2) == 0x000200, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_GetLocalizedTextFromHandle_Text_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_Format_ReturnValue) == 0x000218, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_MakeStruct_FormatArgumentData_2) == 0x000230, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_MakeStruct_FormatArgumentData_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_MakeArray_Array_3) == 0x000280, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_MakeArray_Array_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_Format_ReturnValue_1) == 0x000290, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_Format_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_Greater_IntInt_ReturnValue) == 0x0002A8, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_CreateDelegate_OutputDelegate_6) == 0x0002AC, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_Greater_IntInt_ReturnValue_1) == 0x0002BC, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_Dialog_ReturnValue) == 0x0002C0, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_Dialog_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_CustomEvent_bResult_1) == 0x0002D0, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_CustomEvent_bResult_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_GetLocalizedTextFromHandle_Text_3) == 0x0002D8, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_GetLocalizedTextFromHandle_Text_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_Dialog_ReturnValue_1) == 0x0002F0, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_Dialog_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_MakeLiteralText_ReturnValue) == 0x000300, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_CustomEvent_bResult) == 0x000318, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_CustomEvent_bResult' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_SelectText_ReturnValue) == 0x000320, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_SelectText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_MakeStruct_FormatArgumentData_3) == 0x000338, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_MakeStruct_FormatArgumentData_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_MakeArray_Array_4) == 0x000388, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_MakeArray_Array_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_GetLocalizedTextFromHandle_Text_4) == 0x000398, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_GetLocalizedTextFromHandle_Text_4' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_Format_ReturnValue_2) == 0x0003B0, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_Format_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_Dialog_ReturnValue_2) == 0x0003C8, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_Dialog_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_Dialog_ReturnValue_3) == 0x0003D8, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_Dialog_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, CallFunc_IsOverflowResourcesForTarget_ReturnValue) == 0x0003E8, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::CallFunc_IsOverflowResourcesForTarget_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense, K2Node_ComponentBoundEvent_Widget_2) == 0x0003F0, "Member 'WBP_IngameMenu_PalCondense_C_ExecuteUbergraph_WBP_IngameMenu_PalCondense::K2Node_ComponentBoundEvent_Widget_2' has a wrong offset!");
