#pragma once

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace PalSDK::Params
{

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_0_OnHoveredPartySlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_0_OnHoveredPartySlot__DelegateSignature final
{
public:
	class UPalIndividualCharacterSlot*            Slot_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_0_OnHoveredPartySlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_0_OnHoveredPartySlot__DelegateSignature");
static_assert(sizeof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_0_OnHoveredPartySlot__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_0_OnHoveredPartySlot__DelegateSignature");
static_assert(offsetof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_0_OnHoveredPartySlot__DelegateSignature, Slot_0) == 0x000000, "Member 'WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_0_OnHoveredPartySlot__DelegateSignature::Slot_0' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_10_OnAnySlotHovered__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_10_OnAnySlotHovered__DelegateSignature final
{
public:
	class UPalIndividualCharacterSlot*            Slot_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_10_OnAnySlotHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_10_OnAnySlotHovered__DelegateSignature");
static_assert(sizeof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_10_OnAnySlotHovered__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_10_OnAnySlotHovered__DelegateSignature");
static_assert(offsetof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_10_OnAnySlotHovered__DelegateSignature, Slot_0) == 0x000000, "Member 'WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_10_OnAnySlotHovered__DelegateSignature::Slot_0' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_12_OnRightClickedBoxSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_12_OnRightClickedBoxSlot__DelegateSignature final
{
public:
	class UPalIndividualCharacterSlot*            Slot_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_12_OnRightClickedBoxSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_12_OnRightClickedBoxSlot__DelegateSignature");
static_assert(sizeof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_12_OnRightClickedBoxSlot__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_12_OnRightClickedBoxSlot__DelegateSignature");
static_assert(offsetof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_12_OnRightClickedBoxSlot__DelegateSignature, Slot_0) == 0x000000, "Member 'WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_12_OnRightClickedBoxSlot__DelegateSignature::Slot_0' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_13_OnRightClickedWorkerSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_13_OnRightClickedWorkerSlot__DelegateSignature final
{
public:
	class UPalIndividualCharacterSlot*            Slot_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_13_OnRightClickedWorkerSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_13_OnRightClickedWorkerSlot__DelegateSignature");
static_assert(sizeof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_13_OnRightClickedWorkerSlot__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_13_OnRightClickedWorkerSlot__DelegateSignature");
static_assert(offsetof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_13_OnRightClickedWorkerSlot__DelegateSignature, Slot_0) == 0x000000, "Member 'WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_13_OnRightClickedWorkerSlot__DelegateSignature::Slot_0' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_1_OnHoveredBoxSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_1_OnHoveredBoxSlot__DelegateSignature final
{
public:
	class UPalIndividualCharacterSlot*            Slot_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_1_OnHoveredBoxSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_1_OnHoveredBoxSlot__DelegateSignature");
static_assert(sizeof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_1_OnHoveredBoxSlot__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_1_OnHoveredBoxSlot__DelegateSignature");
static_assert(offsetof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_1_OnHoveredBoxSlot__DelegateSignature, Slot_0) == 0x000000, "Member 'WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_1_OnHoveredBoxSlot__DelegateSignature::Slot_0' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_2_OnHoveredWorkerSlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_2_OnHoveredWorkerSlot__DelegateSignature final
{
public:
	class UPalIndividualCharacterSlot*            Slot_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_2_OnHoveredWorkerSlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_2_OnHoveredWorkerSlot__DelegateSignature");
static_assert(sizeof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_2_OnHoveredWorkerSlot__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_2_OnHoveredWorkerSlot__DelegateSignature");
static_assert(offsetof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_2_OnHoveredWorkerSlot__DelegateSignature, Slot_0) == 0x000000, "Member 'WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_2_OnHoveredWorkerSlot__DelegateSignature::Slot_0' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_4_OnClickedPalBoxPal__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_4_OnClickedPalBoxPal__DelegateSignature final
{
public:
	class UPalIndividualCharacterSlot*            Slot_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         PressType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_4_OnClickedPalBoxPal__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_4_OnClickedPalBoxPal__DelegateSignature");
static_assert(sizeof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_4_OnClickedPalBoxPal__DelegateSignature) == 0x000010, "Wrong size on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_4_OnClickedPalBoxPal__DelegateSignature");
static_assert(offsetof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_4_OnClickedPalBoxPal__DelegateSignature, Slot_0) == 0x000000, "Member 'WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_4_OnClickedPalBoxPal__DelegateSignature::Slot_0' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_4_OnClickedPalBoxPal__DelegateSignature, PressType) == 0x000008, "Member 'WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_4_OnClickedPalBoxPal__DelegateSignature::PressType' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_5_OnClickedPartySlot__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_5_OnClickedPartySlot__DelegateSignature final
{
public:
	class UPalIndividualCharacterSlot*            TargetSlot;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_5_OnClickedPartySlot__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_5_OnClickedPartySlot__DelegateSignature");
static_assert(sizeof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_5_OnClickedPartySlot__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_5_OnClickedPartySlot__DelegateSignature");
static_assert(offsetof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_5_OnClickedPartySlot__DelegateSignature, TargetSlot) == 0x000000, "Member 'WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_5_OnClickedPartySlot__DelegateSignature::TargetSlot' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_7_OnClickedBaseCampPal__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_7_OnClickedBaseCampPal__DelegateSignature final
{
public:
	class UPalIndividualCharacterSlot*            Slot_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         PressType;                                         // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_7_OnClickedBaseCampPal__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_7_OnClickedBaseCampPal__DelegateSignature");
static_assert(sizeof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_7_OnClickedBaseCampPal__DelegateSignature) == 0x000010, "Wrong size on WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_7_OnClickedBaseCampPal__DelegateSignature");
static_assert(offsetof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_7_OnClickedBaseCampPal__DelegateSignature, Slot_0) == 0x000000, "Member 'WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_7_OnClickedBaseCampPal__DelegateSignature::Slot_0' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_7_OnClickedBaseCampPal__DelegateSignature, PressType) == 0x000008, "Member 'WBP_PalStorageMenu_C_BndEvt__WBP_PalStorageMenu_WBP_IngameMenu_PalBox_K2Node_ComponentBoundEvent_7_OnClickedBaseCampPal__DelegateSignature::PressType' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.CheckLoosePal
// 0x0100 (0x0100 - 0x0000)
struct WBP_PalStorageMenu_C_CheckLoosePal final
{
public:
	class UPalIndividualCharacterSlot*            Slot_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          CallFunc_GetHandle_ReturnValue;                    // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedText_ReturnValue;             // 0x0018(0x0018)()
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bResult)>                 K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetNickName_outName;                      // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0078(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00C8(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00D8(0x0018)()
	struct FGuid                                  CallFunc_Dialog_ReturnValue;                       // 0x00F0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_CheckLoosePal) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_CheckLoosePal");
static_assert(sizeof(WBP_PalStorageMenu_C_CheckLoosePal) == 0x000100, "Wrong size on WBP_PalStorageMenu_C_CheckLoosePal");
static_assert(offsetof(WBP_PalStorageMenu_C_CheckLoosePal, Slot_0) == 0x000000, "Member 'WBP_PalStorageMenu_C_CheckLoosePal::Slot_0' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_CheckLoosePal, CallFunc_GetHandle_ReturnValue) == 0x000008, "Member 'WBP_PalStorageMenu_C_CheckLoosePal::CallFunc_GetHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_CheckLoosePal, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_PalStorageMenu_C_CheckLoosePal::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_CheckLoosePal, CallFunc_GetLocalizedText_ReturnValue) == 0x000018, "Member 'WBP_PalStorageMenu_C_CheckLoosePal::CallFunc_GetLocalizedText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_CheckLoosePal, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000030, "Member 'WBP_PalStorageMenu_C_CheckLoosePal::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_CheckLoosePal, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_PalStorageMenu_C_CheckLoosePal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_CheckLoosePal, CallFunc_IsValid_ReturnValue_1) == 0x000048, "Member 'WBP_PalStorageMenu_C_CheckLoosePal::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_CheckLoosePal, CallFunc_GetNickName_outName) == 0x000050, "Member 'WBP_PalStorageMenu_C_CheckLoosePal::CallFunc_GetNickName_outName' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_CheckLoosePal, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'WBP_PalStorageMenu_C_CheckLoosePal::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_CheckLoosePal, K2Node_MakeStruct_FormatArgumentData) == 0x000078, "Member 'WBP_PalStorageMenu_C_CheckLoosePal::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_CheckLoosePal, K2Node_MakeArray_Array) == 0x0000C8, "Member 'WBP_PalStorageMenu_C_CheckLoosePal::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_CheckLoosePal, CallFunc_Format_ReturnValue) == 0x0000D8, "Member 'WBP_PalStorageMenu_C_CheckLoosePal::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_CheckLoosePal, CallFunc_Dialog_ReturnValue) == 0x0000F0, "Member 'WBP_PalStorageMenu_C_CheckLoosePal::CallFunc_Dialog_ReturnValue' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.ExecuteUbergraph_WBP_PalStorageMenu
// 0x0118 (0x0118 - 0x0000)
struct WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPalIndividualCharacterSlot*>    K2Node_Event_slotList_1;                           // 0x0008(0x0010)(ConstParm, ReferenceParm)
	int32                                         K2Node_Event_nowPage;                              // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1C[0x4];                                       // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPalIndividualCharacterSlot*>    K2Node_Event_slotList;                             // 0x0020(0x0010)(ConstParm, ReferenceParm)
	class UPalIndividualCharacterSlot*            K2Node_ComponentBoundEvent_Slot_7;                 // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         K2Node_ComponentBoundEvent_pressType_1;            // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterSlot*            K2Node_ComponentBoundEvent_targetSlot;             // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterSlot*            K2Node_ComponentBoundEvent_Slot_6;                 // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalItemSlotPressType                         K2Node_ComponentBoundEvent_pressType;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterSlot*            K2Node_ComponentBoundEvent_Slot_5;                 // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x7];                                       // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalUILiftSlotModel*                    CallFunc_GetLiftSlotModel_ReturnValue;             // 0x0070(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterSlot*            K2Node_ComponentBoundEvent_Slot_4;                 // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLift_ReturnValue;                       // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_81[0x7];                                       // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UPalIndividualCharacterSlot> CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue; // 0x0088(0x0030)(UObjectWrapper, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B9[0x7];                                       // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterSlot*            K2Node_ComponentBoundEvent_Slot_3;                 // 0x00C0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterSlot*            K2Node_ComponentBoundEvent_Slot_2;                 // 0x00C8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue_1;              // 0x00D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalUILiftSlotModel*                    CallFunc_GetLiftSlotModel_ReturnValue_1;           // 0x00D8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLift_ReturnValue_1;                     // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterSlot*            K2Node_ComponentBoundEvent_Slot_1;                 // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterSlot*            K2Node_ComponentBoundEvent_Slot;                   // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue_2;              // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalTutorialManager*                    CallFunc_GetTutorialManager_ReturnValue;           // 0x0100(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalUILiftSlotModel*                    CallFunc_GetLiftSlotModel_ReturnValue_2;           // 0x0108(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLift_ReturnValue_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu");
static_assert(sizeof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu) == 0x000118, "Wrong size on WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, EntryPoint) == 0x000000, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, K2Node_Event_slotList_1) == 0x000008, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::K2Node_Event_slotList_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, K2Node_Event_nowPage) == 0x000018, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::K2Node_Event_nowPage' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, K2Node_Event_slotList) == 0x000020, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::K2Node_Event_slotList' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, K2Node_ComponentBoundEvent_Slot_7) == 0x000030, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::K2Node_ComponentBoundEvent_Slot_7' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, K2Node_ComponentBoundEvent_pressType_1) == 0x000038, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::K2Node_ComponentBoundEvent_pressType_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, K2Node_ComponentBoundEvent_targetSlot) == 0x000040, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::K2Node_ComponentBoundEvent_targetSlot' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, K2Node_ComponentBoundEvent_Slot_6) == 0x000048, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::K2Node_ComponentBoundEvent_Slot_6' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, K2Node_ComponentBoundEvent_pressType) == 0x000050, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::K2Node_ComponentBoundEvent_pressType' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, K2Node_ComponentBoundEvent_Slot_5) == 0x000058, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::K2Node_ComponentBoundEvent_Slot_5' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, CallFunc_IsEmpty_ReturnValue) == 0x000060, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, CallFunc_GetHUDService_ReturnValue) == 0x000068, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, CallFunc_GetLiftSlotModel_ReturnValue) == 0x000070, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::CallFunc_GetLiftSlotModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, K2Node_ComponentBoundEvent_Slot_4) == 0x000078, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::K2Node_ComponentBoundEvent_Slot_4' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, CallFunc_IsLift_ReturnValue) == 0x000080, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::CallFunc_IsLift_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue) == 0x000088, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::CallFunc_Conv_ObjectToSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, CallFunc_IsValid_ReturnValue) == 0x0000B8, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, K2Node_ComponentBoundEvent_Slot_3) == 0x0000C0, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::K2Node_ComponentBoundEvent_Slot_3' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, K2Node_ComponentBoundEvent_Slot_2) == 0x0000C8, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::K2Node_ComponentBoundEvent_Slot_2' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, CallFunc_GetHUDService_ReturnValue_1) == 0x0000D0, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::CallFunc_GetHUDService_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, CallFunc_GetLiftSlotModel_ReturnValue_1) == 0x0000D8, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::CallFunc_GetLiftSlotModel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, CallFunc_IsLift_ReturnValue_1) == 0x0000E0, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::CallFunc_IsLift_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, CallFunc_IsValid_ReturnValue_1) == 0x0000E1, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, K2Node_ComponentBoundEvent_Slot_1) == 0x0000E8, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::K2Node_ComponentBoundEvent_Slot_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, K2Node_ComponentBoundEvent_Slot) == 0x0000F0, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::K2Node_ComponentBoundEvent_Slot' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, CallFunc_GetHUDService_ReturnValue_2) == 0x0000F8, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::CallFunc_GetHUDService_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, CallFunc_GetTutorialManager_ReturnValue) == 0x000100, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::CallFunc_GetTutorialManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, CallFunc_GetLiftSlotModel_ReturnValue_2) == 0x000108, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::CallFunc_GetLiftSlotModel_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu, CallFunc_IsLift_ReturnValue_2) == 0x000110, "Member 'WBP_PalStorageMenu_C_ExecuteUbergraph_WBP_PalStorageMenu::CallFunc_IsLift_ReturnValue_2' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.On Send Slot Input
// 0x0040 (0x0040 - 0x0000)
struct WBP_PalStorageMenu_C_On_Send_Slot_Input final
{
public:
	TDelegate<void(class UPalIndividualCharacterSlot* Slot, class UPalIndividualCharacterHandle* LastHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x3];                                       // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalUILiftSlotModel*                    CallFunc_GetLiftSlotModel_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLift_ReturnValue;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_On_Send_Slot_Input) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_On_Send_Slot_Input");
static_assert(sizeof(WBP_PalStorageMenu_C_On_Send_Slot_Input) == 0x000040, "Wrong size on WBP_PalStorageMenu_C_On_Send_Slot_Input");
static_assert(offsetof(WBP_PalStorageMenu_C_On_Send_Slot_Input, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_PalStorageMenu_C_On_Send_Slot_Input::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_On_Send_Slot_Input, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_PalStorageMenu_C_On_Send_Slot_Input::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_On_Send_Slot_Input, CallFunc_Array_Add_ReturnValue) == 0x000014, "Member 'WBP_PalStorageMenu_C_On_Send_Slot_Input::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_On_Send_Slot_Input, CallFunc_Array_Contains_ReturnValue) == 0x000018, "Member 'WBP_PalStorageMenu_C_On_Send_Slot_Input::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_On_Send_Slot_Input, CallFunc_IsEmpty_ReturnValue) == 0x000019, "Member 'WBP_PalStorageMenu_C_On_Send_Slot_Input::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_On_Send_Slot_Input, CallFunc_GetHUDService_ReturnValue) == 0x000020, "Member 'WBP_PalStorageMenu_C_On_Send_Slot_Input::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_On_Send_Slot_Input, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'WBP_PalStorageMenu_C_On_Send_Slot_Input::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_On_Send_Slot_Input, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'WBP_PalStorageMenu_C_On_Send_Slot_Input::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_On_Send_Slot_Input, CallFunc_GetLiftSlotModel_ReturnValue) == 0x000030, "Member 'WBP_PalStorageMenu_C_On_Send_Slot_Input::CallFunc_GetLiftSlotModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_On_Send_Slot_Input, CallFunc_IsLift_ReturnValue) == 0x000038, "Member 'WBP_PalStorageMenu_C_On_Send_Slot_Input::CallFunc_IsLift_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_On_Send_Slot_Input, CallFunc_IsValid_ReturnValue_2) == 0x000039, "Member 'WBP_PalStorageMenu_C_On_Send_Slot_Input::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.OnCursorShortcutNext
// 0x0001 (0x0001 - 0x0000)
struct WBP_PalStorageMenu_C_OnCursorShortcutNext final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_OnCursorShortcutNext) == 0x000001, "Wrong alignment on WBP_PalStorageMenu_C_OnCursorShortcutNext");
static_assert(sizeof(WBP_PalStorageMenu_C_OnCursorShortcutNext) == 0x000001, "Wrong size on WBP_PalStorageMenu_C_OnCursorShortcutNext");
static_assert(offsetof(WBP_PalStorageMenu_C_OnCursorShortcutNext, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WBP_PalStorageMenu_C_OnCursorShortcutNext::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.OnCursorShortcutPrev
// 0x0001 (0x0001 - 0x0000)
struct WBP_PalStorageMenu_C_OnCursorShortcutPrev final
{
public:
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_OnCursorShortcutPrev) == 0x000001, "Wrong alignment on WBP_PalStorageMenu_C_OnCursorShortcutPrev");
static_assert(sizeof(WBP_PalStorageMenu_C_OnCursorShortcutPrev) == 0x000001, "Wrong size on WBP_PalStorageMenu_C_OnCursorShortcutPrev");
static_assert(offsetof(WBP_PalStorageMenu_C_OnCursorShortcutPrev, K2Node_SwitchEnum_CmpSuccess) == 0x000000, "Member 'WBP_PalStorageMenu_C_OnCursorShortcutPrev::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.OnRecieveLostDialogResponse
// 0x0028 (0x0028 - 0x0000)
struct WBP_PalStorageMenu_C_OnRecieveLostDialogResponse final
{
public:
	bool                                          bResult;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterSlot*            K2Node_DynamicCast_AsPal_Individual_Character_Slot; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_OnRecieveLostDialogResponse) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_OnRecieveLostDialogResponse");
static_assert(sizeof(WBP_PalStorageMenu_C_OnRecieveLostDialogResponse) == 0x000028, "Wrong size on WBP_PalStorageMenu_C_OnRecieveLostDialogResponse");
static_assert(offsetof(WBP_PalStorageMenu_C_OnRecieveLostDialogResponse, bResult) == 0x000000, "Member 'WBP_PalStorageMenu_C_OnRecieveLostDialogResponse::bResult' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnRecieveLostDialogResponse, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000008, "Member 'WBP_PalStorageMenu_C_OnRecieveLostDialogResponse::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnRecieveLostDialogResponse, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000010, "Member 'WBP_PalStorageMenu_C_OnRecieveLostDialogResponse::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnRecieveLostDialogResponse, K2Node_DynamicCast_AsPal_Individual_Character_Slot) == 0x000018, "Member 'WBP_PalStorageMenu_C_OnRecieveLostDialogResponse::K2Node_DynamicCast_AsPal_Individual_Character_Slot' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnRecieveLostDialogResponse, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_PalStorageMenu_C_OnRecieveLostDialogResponse::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.OnUpdatePagePalBoxList
// 0x0018 (0x0018 - 0x0000)
struct WBP_PalStorageMenu_C_OnUpdatePagePalBoxList final
{
public:
	int32                                         NowPage;                                           // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPalIndividualCharacterSlot*>    SlotList;                                          // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PalStorageMenu_C_OnUpdatePagePalBoxList) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_OnUpdatePagePalBoxList");
static_assert(sizeof(WBP_PalStorageMenu_C_OnUpdatePagePalBoxList) == 0x000018, "Wrong size on WBP_PalStorageMenu_C_OnUpdatePagePalBoxList");
static_assert(offsetof(WBP_PalStorageMenu_C_OnUpdatePagePalBoxList, NowPage) == 0x000000, "Member 'WBP_PalStorageMenu_C_OnUpdatePagePalBoxList::NowPage' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnUpdatePagePalBoxList, SlotList) == 0x000008, "Member 'WBP_PalStorageMenu_C_OnUpdatePagePalBoxList::SlotList' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.OnUpdatePageWorkerList
// 0x0010 (0x0010 - 0x0000)
struct WBP_PalStorageMenu_C_OnUpdatePageWorkerList final
{
public:
	TArray<class UPalIndividualCharacterSlot*>    SlotList;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WBP_PalStorageMenu_C_OnUpdatePageWorkerList) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_OnUpdatePageWorkerList");
static_assert(sizeof(WBP_PalStorageMenu_C_OnUpdatePageWorkerList) == 0x000010, "Wrong size on WBP_PalStorageMenu_C_OnUpdatePageWorkerList");
static_assert(offsetof(WBP_PalStorageMenu_C_OnUpdatePageWorkerList, SlotList) == 0x000000, "Member 'WBP_PalStorageMenu_C_OnUpdatePageWorkerList::SlotList' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.OnUpdateSlotHandle
// 0x0028 (0x0028 - 0x0000)
struct WBP_PalStorageMenu_C_OnUpdateSlotHandle final
{
public:
	class UPalIndividualCharacterSlot*            Slot_0;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          LastHandle;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPalIndividualCharacterSlot* Slot, class UPalIndividualCharacterHandle* LastHandle)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_OnUpdateSlotHandle) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_OnUpdateSlotHandle");
static_assert(sizeof(WBP_PalStorageMenu_C_OnUpdateSlotHandle) == 0x000028, "Wrong size on WBP_PalStorageMenu_C_OnUpdateSlotHandle");
static_assert(offsetof(WBP_PalStorageMenu_C_OnUpdateSlotHandle, Slot_0) == 0x000000, "Member 'WBP_PalStorageMenu_C_OnUpdateSlotHandle::Slot_0' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnUpdateSlotHandle, LastHandle) == 0x000008, "Member 'WBP_PalStorageMenu_C_OnUpdateSlotHandle::LastHandle' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnUpdateSlotHandle, K2Node_CreateDelegate_OutputDelegate) == 0x000010, "Member 'WBP_PalStorageMenu_C_OnUpdateSlotHandle::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnUpdateSlotHandle, CallFunc_Array_RemoveItem_ReturnValue) == 0x000020, "Member 'WBP_PalStorageMenu_C_OnUpdateSlotHandle::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.OnViewDetailInput
// 0x0038 (0x0038 - 0x0000)
struct WBP_PalStorageMenu_C_OnViewDetailInput final
{
public:
	class UPalHUDDispatchParameter_MonsterDetail* CallFunc_CreateDispatchParameterForK2Node_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterHandle*          CallFunc_GetHandle_ReturnValue;                    // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsEmpty_ReturnValue;                      // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A[0x6];                                       // 0x001A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalUILiftSlotModel*                    CallFunc_GetLiftSlotModel_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLift_ReturnValue;                       // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageMenu_C_OnViewDetailInput) == 0x000008, "Wrong alignment on WBP_PalStorageMenu_C_OnViewDetailInput");
static_assert(sizeof(WBP_PalStorageMenu_C_OnViewDetailInput) == 0x000038, "Wrong size on WBP_PalStorageMenu_C_OnViewDetailInput");
static_assert(offsetof(WBP_PalStorageMenu_C_OnViewDetailInput, CallFunc_CreateDispatchParameterForK2Node_ReturnValue) == 0x000000, "Member 'WBP_PalStorageMenu_C_OnViewDetailInput::CallFunc_CreateDispatchParameterForK2Node_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnViewDetailInput, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_PalStorageMenu_C_OnViewDetailInput::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnViewDetailInput, CallFunc_GetHandle_ReturnValue) == 0x000010, "Member 'WBP_PalStorageMenu_C_OnViewDetailInput::CallFunc_GetHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnViewDetailInput, CallFunc_IsValid_ReturnValue_1) == 0x000018, "Member 'WBP_PalStorageMenu_C_OnViewDetailInput::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnViewDetailInput, CallFunc_IsEmpty_ReturnValue) == 0x000019, "Member 'WBP_PalStorageMenu_C_OnViewDetailInput::CallFunc_IsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnViewDetailInput, CallFunc_GetHUDService_ReturnValue) == 0x000020, "Member 'WBP_PalStorageMenu_C_OnViewDetailInput::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnViewDetailInput, CallFunc_GetLiftSlotModel_ReturnValue) == 0x000028, "Member 'WBP_PalStorageMenu_C_OnViewDetailInput::CallFunc_GetLiftSlotModel_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnViewDetailInput, CallFunc_IsValid_ReturnValue_2) == 0x000030, "Member 'WBP_PalStorageMenu_C_OnViewDetailInput::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnViewDetailInput, CallFunc_IsValid_ReturnValue_3) == 0x000031, "Member 'WBP_PalStorageMenu_C_OnViewDetailInput::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_OnViewDetailInput, CallFunc_IsLift_ReturnValue) == 0x000032, "Member 'WBP_PalStorageMenu_C_OnViewDetailInput::CallFunc_IsLift_ReturnValue' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.RegisterPalOperateInput
// 0x0028 (0x0028 - 0x0000)
struct WBP_PalStorageMenu_C_RegisterPalOperateInput final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue;        // 0x0010(0x0004)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_1;      // 0x0024(0x0004)(NoDestructor)
};
static_assert(alignof(WBP_PalStorageMenu_C_RegisterPalOperateInput) == 0x000004, "Wrong alignment on WBP_PalStorageMenu_C_RegisterPalOperateInput");
static_assert(sizeof(WBP_PalStorageMenu_C_RegisterPalOperateInput) == 0x000028, "Wrong size on WBP_PalStorageMenu_C_RegisterPalOperateInput");
static_assert(offsetof(WBP_PalStorageMenu_C_RegisterPalOperateInput, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_PalStorageMenu_C_RegisterPalOperateInput::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_RegisterPalOperateInput, CallFunc_RegisterActionBinding_ReturnValue) == 0x000010, "Member 'WBP_PalStorageMenu_C_RegisterPalOperateInput::CallFunc_RegisterActionBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_RegisterPalOperateInput, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'WBP_PalStorageMenu_C_RegisterPalOperateInput::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_RegisterPalOperateInput, CallFunc_RegisterActionBinding_ReturnValue_1) == 0x000024, "Member 'WBP_PalStorageMenu_C_RegisterPalOperateInput::CallFunc_RegisterActionBinding_ReturnValue_1' has a wrong offset!");

// Function WBP_PalStorageMenu.WBP_PalStorageMenu_C.RegisterStaticActionInput
// 0x0064 (0x0064 - 0x0000)
struct WBP_PalStorageMenu_C_RegisterStaticActionInput final
{
public:
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0000(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0010(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue;        // 0x0020(0x0004)(NoDestructor)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_1;      // 0x0024(0x0004)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_2;            // 0x0028(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_2;      // 0x0048(0x0004)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_4;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_3;      // 0x005C(0x0004)(NoDestructor)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_4;      // 0x0060(0x0004)(NoDestructor)
};
static_assert(alignof(WBP_PalStorageMenu_C_RegisterStaticActionInput) == 0x000004, "Wrong alignment on WBP_PalStorageMenu_C_RegisterStaticActionInput");
static_assert(sizeof(WBP_PalStorageMenu_C_RegisterStaticActionInput) == 0x000064, "Wrong size on WBP_PalStorageMenu_C_RegisterStaticActionInput");
static_assert(offsetof(WBP_PalStorageMenu_C_RegisterStaticActionInput, K2Node_CreateDelegate_OutputDelegate) == 0x000000, "Member 'WBP_PalStorageMenu_C_RegisterStaticActionInput::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_RegisterStaticActionInput, K2Node_CreateDelegate_OutputDelegate_1) == 0x000010, "Member 'WBP_PalStorageMenu_C_RegisterStaticActionInput::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_RegisterStaticActionInput, CallFunc_RegisterActionBinding_ReturnValue) == 0x000020, "Member 'WBP_PalStorageMenu_C_RegisterStaticActionInput::CallFunc_RegisterActionBinding_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_RegisterStaticActionInput, CallFunc_RegisterActionBinding_ReturnValue_1) == 0x000024, "Member 'WBP_PalStorageMenu_C_RegisterStaticActionInput::CallFunc_RegisterActionBinding_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_RegisterStaticActionInput, K2Node_CreateDelegate_OutputDelegate_2) == 0x000028, "Member 'WBP_PalStorageMenu_C_RegisterStaticActionInput::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageMenu_C_RegisterStaticActionInput, K2Node_CreateDelegate_OutputDelegate_3) == 0x000038, "Member 'WBP_PalStorageMenu_C_RegisterStaticActionInput::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
