#pragma once

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"


namespace PalSDK::Params
{

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.AnmEvent_ShowHideLeft
// 0x0001 (0x0001 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_AnmEvent_ShowHideLeft final
{
public:
	bool                                          Hide;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_AnmEvent_ShowHideLeft) == 0x000001, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_AnmEvent_ShowHideLeft");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_AnmEvent_ShowHideLeft) == 0x000001, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_AnmEvent_ShowHideLeft");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_AnmEvent_ShowHideLeft, Hide) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_AnmEvent_ShowHideLeft::Hide' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.AnmEvent_ShowHideRight
// 0x0001 (0x0001 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_AnmEvent_ShowHideRight final
{
public:
	bool                                          Hide;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_AnmEvent_ShowHideRight) == 0x000001, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_AnmEvent_ShowHideRight");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_AnmEvent_ShowHideRight) == 0x000001, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_AnmEvent_ShowHideRight");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_AnmEvent_ShowHideRight, Hide) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_AnmEvent_ShowHideRight::Hide' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.BindWeaponEvent
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent final
{
public:
	class APalWeaponBase*                         WeaponBase;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float RemainingTime, float CoolDownTime)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class ABP_GrapplingGun_C*                     K2Node_DynamicCast_AsBP_Grappling_Gun;             // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ThrowWeapon_GrenadeBase_C*          K2Node_DynamicCast_AsBP_Throw_Weapon_Grenade_Base; // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCoolDown_ReturnValue;                   // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_32[0x2];                                       // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetRemainingCoolDownTime_ReturnValue;     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsStart)>                 K2Node_CreateDelegate_OutputDelegate_1;            // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UPalItemSlot* Slot)>     K2Node_CreateDelegate_OutputDelegate_2;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalPlayerInventoryData*                CallFunc_GetLocalInventoryData_ReturnValue;        // 0x0060(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalItemContainer*                      CallFunc_TryGetContainerFromInventoryType_OutContainer; // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TryGetContainerFromInventoryType_ReturnValue; // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x3];                                       // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetNowSelectedIndex_ReturnValue;          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 RemainingBulletsNum)>    K2Node_CreateDelegate_OutputDelegate_3;            // 0x0078(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalItemSlot*                           CallFunc_Array_Get_Item;                           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 bulletsNum)>             K2Node_CreateDelegate_OutputDelegate_4;            // 0x0090(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(int32 RemainingBulletsNum)>    K2Node_CreateDelegate_OutputDelegate_5;            // 0x00A0(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OnGrapplingGunCoolTimerUpdate_Timer_ImplicitCast; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OnGrapplingGunCoolTimerUpdate_CoolTime_ImplicitCast; // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent) == 0x000008, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent) == 0x0000C0, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, WeaponBase) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::WeaponBase' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, K2Node_DynamicCast_AsBP_Grappling_Gun) == 0x000018, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::K2Node_DynamicCast_AsBP_Grappling_Gun' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, K2Node_DynamicCast_AsBP_Throw_Weapon_Grenade_Base) == 0x000028, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::K2Node_DynamicCast_AsBP_Throw_Weapon_Grenade_Base' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, CallFunc_IsCoolDown_ReturnValue) == 0x000031, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::CallFunc_IsCoolDown_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, CallFunc_GetRemainingCoolDownTime_ReturnValue) == 0x000034, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::CallFunc_GetRemainingCoolDownTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, K2Node_CreateDelegate_OutputDelegate_1) == 0x000038, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, K2Node_CreateDelegate_OutputDelegate_2) == 0x000048, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, CallFunc_GetPalmi_ReturnValue) == 0x000058, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, CallFunc_GetLocalInventoryData_ReturnValue) == 0x000060, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::CallFunc_GetLocalInventoryData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, CallFunc_TryGetContainerFromInventoryType_OutContainer) == 0x000068, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::CallFunc_TryGetContainerFromInventoryType_OutContainer' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, CallFunc_TryGetContainerFromInventoryType_ReturnValue) == 0x000070, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::CallFunc_TryGetContainerFromInventoryType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, CallFunc_GetNowSelectedIndex_ReturnValue) == 0x000074, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::CallFunc_GetNowSelectedIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, K2Node_CreateDelegate_OutputDelegate_3) == 0x000078, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, CallFunc_Array_Get_Item) == 0x000088, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, K2Node_CreateDelegate_OutputDelegate_4) == 0x000090, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, K2Node_CreateDelegate_OutputDelegate_5) == 0x0000A0, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, CallFunc_OnGrapplingGunCoolTimerUpdate_Timer_ImplicitCast) == 0x0000B0, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::CallFunc_OnGrapplingGunCoolTimerUpdate_Timer_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent, CallFunc_OnGrapplingGunCoolTimerUpdate_CoolTime_ImplicitCast) == 0x0000B8, "Member 'WBP_Ingame_PlayerGauge_Separated_C_BindWeaponEvent::CallFunc_OnGrapplingGunCoolTimerUpdate_CoolTime_ImplicitCast' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.CalcMaxBulletNum
// 0x0040 (0x0040 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum final
{
public:
	int32                                         MaxBulletNum;                                      // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalPlayerInventoryData*                CallFunc_GetLocalInventoryData_ReturnValue;        // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalWeaponBase*                         K2Node_DynamicCast_AsPal_Weapon_Base;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x3];                                       // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetRequiredBulletName_outName;            // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_36[0x2];                                       // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_CountItemNum_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum) == 0x000008, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum) == 0x000040, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum, MaxBulletNum) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum::MaxBulletNum' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum, CallFunc_GetLocalInventoryData_ReturnValue) == 0x000008, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum::CallFunc_GetLocalInventoryData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum, CallFunc_IsValidSoftObjectReference_ReturnValue) == 0x000010, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum::CallFunc_IsValidSoftObjectReference_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum, CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue) == 0x000018, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum::CallFunc_Conv_SoftObjectReferenceToObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum, K2Node_DynamicCast_AsPal_Weapon_Base) == 0x000020, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum::K2Node_DynamicCast_AsPal_Weapon_Base' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum, CallFunc_GetRequiredBulletName_outName) == 0x00002C, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum::CallFunc_GetRequiredBulletName_outName' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum, CallFunc_IsValid_ReturnValue) == 0x000034, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum, CallFunc_NotEqual_NameName_ReturnValue) == 0x000035, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum, CallFunc_CountItemNum_ReturnValue) == 0x000038, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CalcMaxBulletNum::CallFunc_CountItemNum_ReturnValue' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.Change Infinity Weapon Detail
// 0x0010 (0x0010 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_Change_Infinity_Weapon_Detail final
{
public:
	class APalWeaponBase*                         WeaponBase;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_Change_Infinity_Weapon_Detail) == 0x000008, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_Change_Infinity_Weapon_Detail");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_Change_Infinity_Weapon_Detail) == 0x000010, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_Change_Infinity_Weapon_Detail");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_Change_Infinity_Weapon_Detail, WeaponBase) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_Change_Infinity_Weapon_Detail::WeaponBase' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_Change_Infinity_Weapon_Detail, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000008, "Member 'WBP_Ingame_PlayerGauge_Separated_C_Change_Infinity_Weapon_Detail::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_Change_Infinity_Weapon_Detail, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000009, "Member 'WBP_Ingame_PlayerGauge_Separated_C_Change_Infinity_Weapon_Detail::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_Change_Infinity_Weapon_Detail, CallFunc_BooleanOR_ReturnValue) == 0x00000A, "Member 'WBP_Ingame_PlayerGauge_Separated_C_Change_Infinity_Weapon_Detail::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.Change Normal Weapon Detail
// 0x0005 (0x0005 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail final
{
public:
	bool                                          IsGrenade;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail) == 0x000001, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail) == 0x000005, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail, IsGrenade) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail::IsGrenade' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail, Temp_bool_Variable) == 0x000001, "Member 'WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail, Temp_byte_Variable) == 0x000002, "Member 'WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail, K2Node_Select_Default) == 0x000004, "Member 'WBP_Ingame_PlayerGauge_Separated_C_Change_Normal_Weapon_Detail::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.ChangePalThrowDetail
// 0x0018 (0x0018 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_ChangePalThrowDetail final
{
public:
	class UPalOtomoHolderComponentBase*           CallFunc_GetOtomoHolderComponent_ReturnValue;      // 0x0000(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetSelectedOtomoID_ReturnValue;           // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterSlot*            CallFunc_GetOtomoIndividualCharacterSlot_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_ChangePalThrowDetail) == 0x000008, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_ChangePalThrowDetail");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_ChangePalThrowDetail) == 0x000018, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_ChangePalThrowDetail");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ChangePalThrowDetail, CallFunc_GetOtomoHolderComponent_ReturnValue) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ChangePalThrowDetail::CallFunc_GetOtomoHolderComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ChangePalThrowDetail, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ChangePalThrowDetail::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ChangePalThrowDetail, CallFunc_GetSelectedOtomoID_ReturnValue) == 0x00000C, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ChangePalThrowDetail::CallFunc_GetSelectedOtomoID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ChangePalThrowDetail, CallFunc_GetOtomoIndividualCharacterSlot_ReturnValue) == 0x000010, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ChangePalThrowDetail::CallFunc_GetOtomoIndividualCharacterSlot_ReturnValue' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.ChangeRideMode
// 0x0008 (0x0008 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_ChangeRideMode final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_ChangeRideMode) == 0x000008, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_ChangeRideMode");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_ChangeRideMode) == 0x000008, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_ChangeRideMode");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ChangeRideMode, Actor) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ChangeRideMode::Actor' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x0018 (0x0018 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	float                                         RemainingTime;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CoolDownTime;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OnGrapplingGunCoolTimerUpdate_Timer_ImplicitCast; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OnGrapplingGunCoolTimerUpdate_CoolTime_ImplicitCast; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000018, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_0, RemainingTime) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_0::RemainingTime' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_0, CoolDownTime) == 0x000004, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_0::CoolDownTime' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_0, CallFunc_OnGrapplingGunCoolTimerUpdate_Timer_ImplicitCast) == 0x000008, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_0::CallFunc_OnGrapplingGunCoolTimerUpdate_Timer_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_0, CallFunc_OnGrapplingGunCoolTimerUpdate_CoolTime_ImplicitCast) == 0x000010, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_0::CallFunc_OnGrapplingGunCoolTimerUpdate_CoolTime_ImplicitCast' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.CREATEDELEGATE_PROXYFUNCTION_1
// 0x0018 (0x0018 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_1 final
{
public:
	float                                         RemainingTime;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CoolDownTime;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OnGrapplingGunCoolTimerUpdate_Timer_ImplicitCast; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_OnGrapplingGunCoolTimerUpdate_CoolTime_ImplicitCast; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_1) == 0x000008, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_1");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_1) == 0x000018, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_1");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_1, RemainingTime) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_1::RemainingTime' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_1, CoolDownTime) == 0x000004, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_1::CoolDownTime' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_1, CallFunc_OnGrapplingGunCoolTimerUpdate_Timer_ImplicitCast) == 0x000008, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_1::CallFunc_OnGrapplingGunCoolTimerUpdate_Timer_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_1, CallFunc_OnGrapplingGunCoolTimerUpdate_CoolTime_ImplicitCast) == 0x000010, "Member 'WBP_Ingame_PlayerGauge_Separated_C_CREATEDELEGATE_PROXYFUNCTION_1::CallFunc_OnGrapplingGunCoolTimerUpdate_CoolTime_ImplicitCast' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated
// 0x0088 (0x0088 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_1;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          Temp_byte_Variable_3;                              // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Hide_1;                         // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x6];                                        // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Hide;                           // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0020(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default;                             // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_65[0x3];                                       // 0x0065(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0068(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EUMGSequencePlayMode                          K2Node_Select_Default_1;                           // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_72[0x6];                                       // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated) == 0x000008, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated) == 0x000088, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, EntryPoint) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, Temp_byte_Variable) == 0x000004, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, Temp_byte_Variable_1) == 0x000005, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, Temp_bool_Variable) == 0x000006, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, Temp_byte_Variable_2) == 0x000007, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, Temp_byte_Variable_3) == 0x000008, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, K2Node_CustomEvent_Hide_1) == 0x000009, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::K2Node_CustomEvent_Hide_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, CallFunc_PlayAnimation_ReturnValue) == 0x000010, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, K2Node_CustomEvent_Hide) == 0x000018, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::K2Node_CustomEvent_Hide' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, K2Node_Event_MyGeometry) == 0x000020, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, K2Node_Event_InDeltaTime) == 0x000060, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, K2Node_Select_Default) == 0x000064, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, CallFunc_PlayAnimation_ReturnValue_1) == 0x000068, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, Temp_bool_Variable_1) == 0x000070, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, K2Node_Select_Default_1) == 0x000071, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, CallFunc_PlayAnimation_ReturnValue_2) == 0x000078, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated, CallFunc_PlayAnimation_ReturnValue_3) == 0x000080, "Member 'WBP_Ingame_PlayerGauge_Separated_C_ExecuteUbergraph_WBP_Ingame_PlayerGauge_Separated::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.Is Require Bullet
// 0x0018 (0x0018 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet final
{
public:
	class APalWeaponBase*                         WeaponActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsRequire;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A[0x2];                                        // 0x000A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetRequiredBulletName_outName;            // 0x000C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet) == 0x000008, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet) == 0x000018, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet, WeaponActor) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet::WeaponActor' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet, IsRequire) == 0x000008, "Member 'WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet::IsRequire' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet, CallFunc_GetRequiredBulletName_outName) == 0x00000C, "Member 'WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet::CallFunc_GetRequiredBulletName_outName' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet, CallFunc_NotEqual_NameName_ReturnValue) == 0x000014, "Member 'WBP_Ingame_PlayerGauge_Separated_C_Is_Require_Bullet::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.IsDummyWeapon
// 0x0020 (0x0020 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_IsDummyWeapon final
{
public:
	class APalWeaponBase*                         WeaponBase;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDummy;                                           // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ThrowWeapon_Dummy_C*                K2Node_DynamicCast_AsBP_Throw_Weapon_Dummy;        // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_IsDummyWeapon) == 0x000008, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_IsDummyWeapon");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_IsDummyWeapon) == 0x000020, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_IsDummyWeapon");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsDummyWeapon, WeaponBase) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsDummyWeapon::WeaponBase' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsDummyWeapon, IsDummy) == 0x000008, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsDummyWeapon::IsDummy' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsDummyWeapon, K2Node_DynamicCast_AsBP_Throw_Weapon_Dummy) == 0x000010, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsDummyWeapon::K2Node_DynamicCast_AsBP_Throw_Weapon_Dummy' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsDummyWeapon, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsDummyWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.IsInfinityWeapon
// 0x0038 (0x0038 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon final
{
public:
	class FName                                   WeaponName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsInfinity;                                        // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalItemIDManager*                      CallFunc_GetItemIDManager_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalStaticItemDataBase*                 CallFunc_GetStaticItemData_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalStaticWeaponItemData*               K2Node_DynamicCast_AsPal_Static_Weapon_Item_Data;  // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon) == 0x000008, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon) == 0x000038, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon, WeaponName) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon::WeaponName' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon, IsInfinity) == 0x000008, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon::IsInfinity' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon, CallFunc_GetItemIDManager_ReturnValue) == 0x000010, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon::CallFunc_GetItemIDManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon, CallFunc_GetStaticItemData_ReturnValue) == 0x000018, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon::CallFunc_GetStaticItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon, K2Node_DynamicCast_AsPal_Static_Weapon_Item_Data) == 0x000028, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon::K2Node_DynamicCast_AsPal_Static_Weapon_Item_Data' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon, CallFunc_IsValid_ReturnValue_1) == 0x000031, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000032, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsInfinityWeapon::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.IsPalThrowWeapon
// 0x0020 (0x0020 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_IsPalThrowWeapon final
{
public:
	class APalWeaponBase*                         WeaponBase;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPalThrowWeapon_0;                                // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_ThrowPalWeapon_C*                   K2Node_DynamicCast_AsBP_Throw_Pal_Weapon;          // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_IsPalThrowWeapon) == 0x000008, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_IsPalThrowWeapon");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_IsPalThrowWeapon) == 0x000020, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_IsPalThrowWeapon");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsPalThrowWeapon, WeaponBase) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsPalThrowWeapon::WeaponBase' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsPalThrowWeapon, IsPalThrowWeapon_0) == 0x000008, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsPalThrowWeapon::IsPalThrowWeapon_0' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsPalThrowWeapon, K2Node_DynamicCast_AsBP_Throw_Pal_Weapon) == 0x000010, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsPalThrowWeapon::K2Node_DynamicCast_AsBP_Throw_Pal_Weapon' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsPalThrowWeapon, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsPalThrowWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.IsSpecialWeapon
// 0x0060 (0x0060 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon final
{
public:
	class APalWeaponBase*                         WeaponBase;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          IsSpecial;                                         // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x3];                                        // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalItemId                             CallFunc_GetItemId_ReturnValue;                    // 0x000C(0x0028)(ConstParm, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_34[0x4];                                       // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalItemIDManager*                      CallFunc_GetItemIDManager_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalStaticItemDataBase*                 CallFunc_GetStaticItemData_ReturnValue;            // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalStaticWeaponItemData*               K2Node_DynamicCast_AsPal_Static_Weapon_Item_Data;  // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon) == 0x000008, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon) == 0x000060, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon, WeaponBase) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon::WeaponBase' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon, IsSpecial) == 0x000008, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon::IsSpecial' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon, CallFunc_GetItemId_ReturnValue) == 0x00000C, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon::CallFunc_GetItemId_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon, CallFunc_GetItemIDManager_ReturnValue) == 0x000038, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon::CallFunc_GetItemIDManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon, CallFunc_GetStaticItemData_ReturnValue) == 0x000048, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon::CallFunc_GetStaticItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon, K2Node_DynamicCast_AsPal_Static_Weapon_Item_Data) == 0x000050, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon::K2Node_DynamicCast_AsPal_Static_Weapon_Item_Data' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon, K2Node_DynamicCast_bSuccess) == 0x000058, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon, CallFunc_IsValid_ReturnValue_1) == 0x000059, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00005A, "Member 'WBP_Ingame_PlayerGauge_Separated_C_IsSpecialWeapon::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.OnEndHPGaugeDelay
// 0x0008 (0x0008 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_OnEndHPGaugeDelay final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Ingame_PlayerGauge_Separated_C_OnEndHPGaugeDelay) == 0x000008, "Wrong alignment on WBP_Ingame_PlayerGauge_Separated_C_OnEndHPGaugeDelay");
static_assert(sizeof(WBP_Ingame_PlayerGauge_Separated_C_OnEndHPGaugeDelay) == 0x000008, "Wrong size on WBP_Ingame_PlayerGauge_Separated_C_OnEndHPGaugeDelay");
static_assert(offsetof(WBP_Ingame_PlayerGauge_Separated_C_OnEndHPGaugeDelay, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'WBP_Ingame_PlayerGauge_Separated_C_OnEndHPGaugeDelay::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WBP_Ingame_PlayerGauge_Separated.WBP_Ingame_PlayerGauge_Separated_C.OnEndShieldGaugeDelay
// 0x0018 (0x0018 - 0x0000)
struct WBP_Ingame_PlayerGauge_Separated_C_OnEndShieldGaugeDelay final
{
public:
	int64                                         CallFunc_Convert_FixedPoint64ToInt64_ReturnValue;  // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
