#pragma once

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Pal_structs.hpp"


namespace PalSDK::Params
{

// Function WBP_Paldex_List.WBP_Paldex_List_C.BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Paldex_List.WBP_Paldex_List_C.BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Paldex_List.WBP_Paldex_List_C.BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Paldex_List_C_BndEvt__WBP_Paldex_List_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_3_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Paldex_List.WBP_Paldex_List_C.ExecuteUbergraph_WBP_Paldex_List
// 0x0038 (0x0038 - 0x0000)
struct WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List) == 0x000008, "Wrong alignment on WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List");
static_assert(sizeof(WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List) == 0x000038, "Wrong size on WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List");
static_assert(offsetof(WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List, EntryPoint) == 0x000000, "Member 'WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List, K2Node_ComponentBoundEvent_Button_2) == 0x000020, "Member 'WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List, K2Node_ComponentBoundEvent_Button_1) == 0x000028, "Member 'WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List, K2Node_ComponentBoundEvent_Button) == 0x000030, "Member 'WBP_Paldex_List_C_ExecuteUbergraph_WBP_Paldex_List::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_Paldex_List.WBP_Paldex_List_C.OnClicked__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Paldex_List_C_OnClicked__DelegateSignature final
{
public:
	class FName                                   CharacterID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Paldex_List_C*                     Widget;                                            // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_List_C_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Paldex_List_C_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_Paldex_List_C_OnClicked__DelegateSignature) == 0x000010, "Wrong size on WBP_Paldex_List_C_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_Paldex_List_C_OnClicked__DelegateSignature, CharacterID) == 0x000000, "Member 'WBP_Paldex_List_C_OnClicked__DelegateSignature::CharacterID' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_OnClicked__DelegateSignature, Widget) == 0x000008, "Member 'WBP_Paldex_List_C_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_Paldex_List.WBP_Paldex_List_C.OnHovered__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WBP_Paldex_List_C_OnHovered__DelegateSignature final
{
public:
	class FName                                   CharacterID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Paldex_List_C*                     SelfWidget;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_List_C_OnHovered__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Paldex_List_C_OnHovered__DelegateSignature");
static_assert(sizeof(WBP_Paldex_List_C_OnHovered__DelegateSignature) == 0x000010, "Wrong size on WBP_Paldex_List_C_OnHovered__DelegateSignature");
static_assert(offsetof(WBP_Paldex_List_C_OnHovered__DelegateSignature, CharacterID) == 0x000000, "Member 'WBP_Paldex_List_C_OnHovered__DelegateSignature::CharacterID' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_OnHovered__DelegateSignature, SelfWidget) == 0x000008, "Member 'WBP_Paldex_List_C_OnHovered__DelegateSignature::SelfWidget' has a wrong offset!");

// Function WBP_Paldex_List.WBP_Paldex_List_C.Setup
// 0x00B8 (0x00B8 - 0x0000)
struct WBP_Paldex_List_C_Setup final
{
public:
	struct FPalUIPaldex_DisplayInfo               DisplayInfo;                                       // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_3A[0x6];                                       // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0040(0x0018)()
	int32                                         CallFunc_Divide_IntInt_ReturnValue;                // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue;               // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_61[0x3];                                       // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Divide_IntInt_ReturnValue_1;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Percent_IntInt_ReturnValue_1;             // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C[0x4];                                       // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ConstParm, ReferenceParm)
	class APalPlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0080(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalPlayerLocalRecordData*              CallFunc_GetLocalRecordData_ReturnValue;           // 0x0088(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalTribeID                                   CallFunc_GetTribeIDFromCharacterID_ReturnValue;    // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_95[0x3];                                       // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UPalTextBlockBase*>              K2Node_MakeArray_Array_1;                          // 0x0098(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UPalDatabaseCharacterParameter*         CallFunc_GetDatabaseCharacterParameter_ReturnValue; // 0x00A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalElementType                               CallFunc_GetElementType_Element1;                  // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalElementType                               CallFunc_GetElementType_Element2;                  // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_List_C_Setup) == 0x000008, "Wrong alignment on WBP_Paldex_List_C_Setup");
static_assert(sizeof(WBP_Paldex_List_C_Setup) == 0x0000B8, "Wrong size on WBP_Paldex_List_C_Setup");
static_assert(offsetof(WBP_Paldex_List_C_Setup, DisplayInfo) == 0x000000, "Member 'WBP_Paldex_List_C_Setup::DisplayInfo' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, Temp_byte_Variable) == 0x000038, "Member 'WBP_Paldex_List_C_Setup::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, K2Node_SwitchEnum_CmpSuccess) == 0x000039, "Member 'WBP_Paldex_List_C_Setup::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, CallFunc_Conv_StringToText_ReturnValue) == 0x000040, "Member 'WBP_Paldex_List_C_Setup::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, CallFunc_Divide_IntInt_ReturnValue) == 0x000058, "Member 'WBP_Paldex_List_C_Setup::CallFunc_Divide_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, CallFunc_Percent_IntInt_ReturnValue) == 0x00005C, "Member 'WBP_Paldex_List_C_Setup::CallFunc_Percent_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, Temp_byte_Variable_1) == 0x000060, "Member 'WBP_Paldex_List_C_Setup::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, CallFunc_Divide_IntInt_ReturnValue_1) == 0x000064, "Member 'WBP_Paldex_List_C_Setup::CallFunc_Divide_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, CallFunc_Percent_IntInt_ReturnValue_1) == 0x000068, "Member 'WBP_Paldex_List_C_Setup::CallFunc_Percent_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, K2Node_MakeArray_Array) == 0x000070, "Member 'WBP_Paldex_List_C_Setup::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000080, "Member 'WBP_Paldex_List_C_Setup::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, CallFunc_GetLocalRecordData_ReturnValue) == 0x000088, "Member 'WBP_Paldex_List_C_Setup::CallFunc_GetLocalRecordData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, Temp_bool_Variable) == 0x000090, "Member 'WBP_Paldex_List_C_Setup::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, CallFunc_GetTribeIDFromCharacterID_ReturnValue) == 0x000091, "Member 'WBP_Paldex_List_C_Setup::CallFunc_GetTribeIDFromCharacterID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, CallFunc_Map_Find_Value) == 0x000092, "Member 'WBP_Paldex_List_C_Setup::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, CallFunc_Map_Find_ReturnValue) == 0x000093, "Member 'WBP_Paldex_List_C_Setup::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, K2Node_Select_Default) == 0x000094, "Member 'WBP_Paldex_List_C_Setup::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, K2Node_MakeArray_Array_1) == 0x000098, "Member 'WBP_Paldex_List_C_Setup::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, CallFunc_GetDatabaseCharacterParameter_ReturnValue) == 0x0000A8, "Member 'WBP_Paldex_List_C_Setup::CallFunc_GetDatabaseCharacterParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, CallFunc_GetElementType_Element1) == 0x0000B0, "Member 'WBP_Paldex_List_C_Setup::CallFunc_GetElementType_Element1' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup, CallFunc_GetElementType_Element2) == 0x0000B1, "Member 'WBP_Paldex_List_C_Setup::CallFunc_GetElementType_Element2' has a wrong offset!");

// Function WBP_Paldex_List.WBP_Paldex_List_C.Setup_Captured
// 0x0058 (0x0058 - 0x0000)
struct WBP_Paldex_List_C_Setup_Captured final
{
public:
	struct FPalUIPaldex_DisplayInfo               DisplayInfo;                                       // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UPalDatabaseCharacterParameter*         CallFunc_GetDatabaseCharacterParameter_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedCharacterName_OutText;        // 0x0040(0x0018)()
};
static_assert(alignof(WBP_Paldex_List_C_Setup_Captured) == 0x000008, "Wrong alignment on WBP_Paldex_List_C_Setup_Captured");
static_assert(sizeof(WBP_Paldex_List_C_Setup_Captured) == 0x000058, "Wrong size on WBP_Paldex_List_C_Setup_Captured");
static_assert(offsetof(WBP_Paldex_List_C_Setup_Captured, DisplayInfo) == 0x000000, "Member 'WBP_Paldex_List_C_Setup_Captured::DisplayInfo' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup_Captured, CallFunc_GetDatabaseCharacterParameter_ReturnValue) == 0x000038, "Member 'WBP_Paldex_List_C_Setup_Captured::CallFunc_GetDatabaseCharacterParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup_Captured, CallFunc_GetLocalizedCharacterName_OutText) == 0x000040, "Member 'WBP_Paldex_List_C_Setup_Captured::CallFunc_GetLocalizedCharacterName_OutText' has a wrong offset!");

// Function WBP_Paldex_List.WBP_Paldex_List_C.Setup_Encounted
// 0x0058 (0x0058 - 0x0000)
struct WBP_Paldex_List_C_Setup_Encounted final
{
public:
	struct FPalUIPaldex_DisplayInfo               DisplayInfo;                                       // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UPalDatabaseCharacterParameter*         CallFunc_GetDatabaseCharacterParameter_ReturnValue; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedCharacterName_OutText;        // 0x0040(0x0018)()
};
static_assert(alignof(WBP_Paldex_List_C_Setup_Encounted) == 0x000008, "Wrong alignment on WBP_Paldex_List_C_Setup_Encounted");
static_assert(sizeof(WBP_Paldex_List_C_Setup_Encounted) == 0x000058, "Wrong size on WBP_Paldex_List_C_Setup_Encounted");
static_assert(offsetof(WBP_Paldex_List_C_Setup_Encounted, DisplayInfo) == 0x000000, "Member 'WBP_Paldex_List_C_Setup_Encounted::DisplayInfo' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup_Encounted, CallFunc_GetDatabaseCharacterParameter_ReturnValue) == 0x000038, "Member 'WBP_Paldex_List_C_Setup_Encounted::CallFunc_GetDatabaseCharacterParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_Setup_Encounted, CallFunc_GetLocalizedCharacterName_OutText) == 0x000040, "Member 'WBP_Paldex_List_C_Setup_Encounted::CallFunc_GetLocalizedCharacterName_OutText' has a wrong offset!");

// Function WBP_Paldex_List.WBP_Paldex_List_C.Setup_NotEncounted
// 0x0038 (0x0038 - 0x0000)
struct WBP_Paldex_List_C_Setup_NotEncounted final
{
public:
	struct FPalUIPaldex_DisplayInfo               DisplayInfo;                                       // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Paldex_List_C_Setup_NotEncounted) == 0x000008, "Wrong alignment on WBP_Paldex_List_C_Setup_NotEncounted");
static_assert(sizeof(WBP_Paldex_List_C_Setup_NotEncounted) == 0x000038, "Wrong size on WBP_Paldex_List_C_Setup_NotEncounted");
static_assert(offsetof(WBP_Paldex_List_C_Setup_NotEncounted, DisplayInfo) == 0x000000, "Member 'WBP_Paldex_List_C_Setup_NotEncounted::DisplayInfo' has a wrong offset!");

// Function WBP_Paldex_List.WBP_Paldex_List_C.SetupByCharacterID
// 0x0028 (0x0028 - 0x0000)
struct WBP_Paldex_List_C_SetupByCharacterID final
{
public:
	class FName                                   CharacterID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalDatabaseCharacterParameter*         CallFunc_GetDatabaseCharacterParameter_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizedCharacterName_OutText;        // 0x0010(0x0018)()
};
static_assert(alignof(WBP_Paldex_List_C_SetupByCharacterID) == 0x000008, "Wrong alignment on WBP_Paldex_List_C_SetupByCharacterID");
static_assert(sizeof(WBP_Paldex_List_C_SetupByCharacterID) == 0x000028, "Wrong size on WBP_Paldex_List_C_SetupByCharacterID");
static_assert(offsetof(WBP_Paldex_List_C_SetupByCharacterID, CharacterID) == 0x000000, "Member 'WBP_Paldex_List_C_SetupByCharacterID::CharacterID' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_SetupByCharacterID, CallFunc_GetDatabaseCharacterParameter_ReturnValue) == 0x000008, "Member 'WBP_Paldex_List_C_SetupByCharacterID::CallFunc_GetDatabaseCharacterParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_SetupByCharacterID, CallFunc_GetLocalizedCharacterName_OutText) == 0x000010, "Member 'WBP_Paldex_List_C_SetupByCharacterID::CallFunc_GetLocalizedCharacterName_OutText' has a wrong offset!");

// Function WBP_Paldex_List.WBP_Paldex_List_C.SetupBySimpleText
// 0x0018 (0x0018 - 0x0000)
struct WBP_Paldex_List_C_SetupBySimpleText final
{
public:
	class FText                                   InText;                                            // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(WBP_Paldex_List_C_SetupBySimpleText) == 0x000008, "Wrong alignment on WBP_Paldex_List_C_SetupBySimpleText");
static_assert(sizeof(WBP_Paldex_List_C_SetupBySimpleText) == 0x000018, "Wrong size on WBP_Paldex_List_C_SetupBySimpleText");
static_assert(offsetof(WBP_Paldex_List_C_SetupBySimpleText, InText) == 0x000000, "Member 'WBP_Paldex_List_C_SetupBySimpleText::InText' has a wrong offset!");

// Function WBP_Paldex_List.WBP_Paldex_List_C.SetupForSkinData
// 0x0088 (0x0088 - 0x0000)
struct WBP_Paldex_List_C_SetupForSkinData final
{
public:
	class FName                                   SkinName;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              Texture;                                           // 0x0008(0x0030)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FText                                   LocalizedSkinNameText;                             // 0x0038(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UPalDatabaseCharacterParameter*         CallFunc_GetDatabaseCharacterParameter_ReturnValue; // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetCharacterIconTextureBySkinName_ReturnValue; // 0x0058(0x0030)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_List_C_SetupForSkinData) == 0x000008, "Wrong alignment on WBP_Paldex_List_C_SetupForSkinData");
static_assert(sizeof(WBP_Paldex_List_C_SetupForSkinData) == 0x000088, "Wrong size on WBP_Paldex_List_C_SetupForSkinData");
static_assert(offsetof(WBP_Paldex_List_C_SetupForSkinData, SkinName) == 0x000000, "Member 'WBP_Paldex_List_C_SetupForSkinData::SkinName' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_SetupForSkinData, Texture) == 0x000008, "Member 'WBP_Paldex_List_C_SetupForSkinData::Texture' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_SetupForSkinData, LocalizedSkinNameText) == 0x000038, "Member 'WBP_Paldex_List_C_SetupForSkinData::LocalizedSkinNameText' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_SetupForSkinData, CallFunc_GetDatabaseCharacterParameter_ReturnValue) == 0x000050, "Member 'WBP_Paldex_List_C_SetupForSkinData::CallFunc_GetDatabaseCharacterParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Paldex_List_C_SetupForSkinData, CallFunc_GetCharacterIconTextureBySkinName_ReturnValue) == 0x000058, "Member 'WBP_Paldex_List_C_SetupForSkinData::CallFunc_GetCharacterIconTextureBySkinName_ReturnValue' has a wrong offset!");

// Function WBP_Paldex_List.WBP_Paldex_List_C.SetVisibilityNewMark
// 0x0001 (0x0001 - 0x0000)
struct WBP_Paldex_List_C_SetVisibilityNewMark final
{
public:
	ESlateVisibility                              NewVisibility;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Paldex_List_C_SetVisibilityNewMark) == 0x000001, "Wrong alignment on WBP_Paldex_List_C_SetVisibilityNewMark");
static_assert(sizeof(WBP_Paldex_List_C_SetVisibilityNewMark) == 0x000001, "Wrong size on WBP_Paldex_List_C_SetVisibilityNewMark");
static_assert(offsetof(WBP_Paldex_List_C_SetVisibilityNewMark, NewVisibility) == 0x000000, "Member 'WBP_Paldex_List_C_SetVisibilityNewMark::NewVisibility' has a wrong offset!");

}

