#pragma once

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "Engine_structs.hpp"


namespace PalSDK::Params
{

// Function WBP_PalStorageSortTypeButton.WBP_PalStorageSortTypeButton_C.BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PalStorageSortTypeButton.WBP_PalStorageSortTypeButton_C.BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PalStorageSortTypeButton.WBP_PalStorageSortTypeButton_C.BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PalStorageSortTypeButton_C_BndEvt__WBP_PalStorageSortTypeButton_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PalStorageSortTypeButton.WBP_PalStorageSortTypeButton_C.ExecuteUbergraph_WBP_PalStorageSortTypeButton
// 0x0128 (0x0128 - 0x0000)
struct WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_3;              // 0x0020(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_4;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_5;              // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_39[0x7];                                       // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetEnumeratorUserFriendlyName_ReturnValue; // 0x0048(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0058(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0060(0x0018)()
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0080(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x00D0(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x00E0(0x0018)()
	struct FDataTableRowHandle                    CallFunc_Map_Find_Value;                           // 0x00F8(0x0010)(NoDestructor)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x0110(0x0018)()
};
static_assert(alignof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton) == 0x000008, "Wrong alignment on WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton");
static_assert(sizeof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton) == 0x000128, "Wrong size on WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, EntryPoint) == 0x000000, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, CallFunc_PlayAnimation_ReturnValue_1) == 0x000010, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, CallFunc_PlayAnimation_ReturnValue_2) == 0x000018, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, CallFunc_PlayAnimation_ReturnValue_3) == 0x000020, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::CallFunc_PlayAnimation_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, CallFunc_PlayAnimation_ReturnValue_4) == 0x000028, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::CallFunc_PlayAnimation_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, CallFunc_PlayAnimation_ReturnValue_5) == 0x000030, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::CallFunc_PlayAnimation_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, K2Node_Event_IsDesignTime) == 0x000038, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, K2Node_ComponentBoundEvent_Button_2) == 0x000040, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, CallFunc_GetEnumeratorUserFriendlyName_ReturnValue) == 0x000048, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::CallFunc_GetEnumeratorUserFriendlyName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, K2Node_ComponentBoundEvent_Button_1) == 0x000058, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, CallFunc_Conv_StringToText_ReturnValue) == 0x000060, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, K2Node_ComponentBoundEvent_Button) == 0x000078, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, K2Node_MakeStruct_FormatArgumentData) == 0x000080, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, K2Node_MakeArray_Array) == 0x0000D0, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, CallFunc_Format_ReturnValue) == 0x0000E0, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::CallFunc_Format_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, CallFunc_Map_Find_Value) == 0x0000F8, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, CallFunc_Map_Find_ReturnValue) == 0x000108, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton, CallFunc_GetLocalizedTextFromHandle_Text) == 0x000110, "Member 'WBP_PalStorageSortTypeButton_C_ExecuteUbergraph_WBP_PalStorageSortTypeButton::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");

// Function WBP_PalStorageSortTypeButton.WBP_PalStorageSortTypeButton_C.GetBindedSortType
// 0x0001 (0x0001 - 0x0000)
struct WBP_PalStorageSortTypeButton_C_GetBindedSortType final
{
public:
	EPalCharacterContainerSortType                SortType;                                          // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortTypeButton_C_GetBindedSortType) == 0x000001, "Wrong alignment on WBP_PalStorageSortTypeButton_C_GetBindedSortType");
static_assert(sizeof(WBP_PalStorageSortTypeButton_C_GetBindedSortType) == 0x000001, "Wrong size on WBP_PalStorageSortTypeButton_C_GetBindedSortType");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_GetBindedSortType, SortType) == 0x000000, "Member 'WBP_PalStorageSortTypeButton_C_GetBindedSortType::SortType' has a wrong offset!");

// Function WBP_PalStorageSortTypeButton.WBP_PalStorageSortTypeButton_C.OnClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStorageSortTypeButton_C_OnClicked__DelegateSignature final
{
public:
	class UWBP_PalStorageSortTypeButton_C*        Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortTypeButton_C_OnClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageSortTypeButton_C_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_PalStorageSortTypeButton_C_OnClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStorageSortTypeButton_C_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_OnClicked__DelegateSignature, Widget) == 0x000000, "Member 'WBP_PalStorageSortTypeButton_C_OnClicked__DelegateSignature::Widget' has a wrong offset!");

// Function WBP_PalStorageSortTypeButton.WBP_PalStorageSortTypeButton_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct WBP_PalStorageSortTypeButton_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortTypeButton_C_PreConstruct) == 0x000001, "Wrong alignment on WBP_PalStorageSortTypeButton_C_PreConstruct");
static_assert(sizeof(WBP_PalStorageSortTypeButton_C_PreConstruct) == 0x000001, "Wrong size on WBP_PalStorageSortTypeButton_C_PreConstruct");
static_assert(offsetof(WBP_PalStorageSortTypeButton_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'WBP_PalStorageSortTypeButton_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

