#pragma once

#include "Basic.hpp"


namespace PalSDK::Params
{

// Function WBP_RepairAllWindow.WBP_RepairAllWindow_C.BndEvt__WBP_RepairAllWindow_WBP_IngameMenu_RepairAll_K2Node_ComponentBoundEvent_0_OnClickedButton__DelegateSignature
// 0x0001 (0x0001 - 0x0000)
struct WBP_RepairAllWindow_C_BndEvt__WBP_RepairAllWindow_WBP_IngameMenu_RepairAll_K2Node_ComponentBoundEvent_0_OnClickedButton__DelegateSignature final
{
public:
	bool                                          IsYes;                                             // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairAllWindow_C_BndEvt__WBP_RepairAllWindow_WBP_IngameMenu_RepairAll_K2Node_ComponentBoundEvent_0_OnClickedButton__DelegateSignature) == 0x000001, "Wrong alignment on WBP_RepairAllWindow_C_BndEvt__WBP_RepairAllWindow_WBP_IngameMenu_RepairAll_K2Node_ComponentBoundEvent_0_OnClickedButton__DelegateSignature");
static_assert(sizeof(WBP_RepairAllWindow_C_BndEvt__WBP_RepairAllWindow_WBP_IngameMenu_RepairAll_K2Node_ComponentBoundEvent_0_OnClickedButton__DelegateSignature) == 0x000001, "Wrong size on WBP_RepairAllWindow_C_BndEvt__WBP_RepairAllWindow_WBP_IngameMenu_RepairAll_K2Node_ComponentBoundEvent_0_OnClickedButton__DelegateSignature");
static_assert(offsetof(WBP_RepairAllWindow_C_BndEvt__WBP_RepairAllWindow_WBP_IngameMenu_RepairAll_K2Node_ComponentBoundEvent_0_OnClickedButton__DelegateSignature, IsYes) == 0x000000, "Member 'WBP_RepairAllWindow_C_BndEvt__WBP_RepairAllWindow_WBP_IngameMenu_RepairAll_K2Node_ComponentBoundEvent_0_OnClickedButton__DelegateSignature::IsYes' has a wrong offset!");

// Function WBP_RepairAllWindow.WBP_RepairAllWindow_C.ExecuteUbergraph_WBP_RepairAllWindow
// 0x0040 (0x0040 - 0x0000)
struct WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_IsYes;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_12[0x6];                                       // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_RepairAllWindowDispatchParameter_C* K2Node_DynamicCast_AsBP_Repair_All_Window_Dispatch_Parameter; // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue_1;                   // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UBP_RepairAllWindowDispatchParameter_C* K2Node_DynamicCast_AsBP_Repair_All_Window_Dispatch_Parameter_1; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow) == 0x000008, "Wrong alignment on WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow");
static_assert(sizeof(WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow) == 0x000040, "Wrong size on WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow");
static_assert(offsetof(WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow, EntryPoint) == 0x000000, "Member 'WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow, CallFunc_GetParam_ReturnValue) == 0x000008, "Member 'WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow::CallFunc_GetParam_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow, K2Node_ComponentBoundEvent_IsYes) == 0x000010, "Member 'WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow::K2Node_ComponentBoundEvent_IsYes' has a wrong offset!");
static_assert(offsetof(WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow, K2Node_DynamicCast_AsBP_Repair_All_Window_Dispatch_Parameter) == 0x000018, "Member 'WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow::K2Node_DynamicCast_AsBP_Repair_All_Window_Dispatch_Parameter' has a wrong offset!");
static_assert(offsetof(WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow, CallFunc_GetParam_ReturnValue_1) == 0x000028, "Member 'WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow::CallFunc_GetParam_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow, K2Node_DynamicCast_AsBP_Repair_All_Window_Dispatch_Parameter_1) == 0x000030, "Member 'WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow::K2Node_DynamicCast_AsBP_Repair_All_Window_Dispatch_Parameter_1' has a wrong offset!");
static_assert(offsetof(WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'WBP_RepairAllWindow_C_ExecuteUbergraph_WBP_RepairAllWindow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

// Function WBP_RepairAllWindow.WBP_RepairAllWindow_C.BP_GetDesiredFocusTarget
// 0x0010 (0x0010 - 0x0000)
struct WBP_RepairAllWindow_C_BP_GetDesiredFocusTarget final
{
public:
	class UWidget*                                ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetFocusTarget_FocusTarget;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_RepairAllWindow_C_BP_GetDesiredFocusTarget) == 0x000008, "Wrong alignment on WBP_RepairAllWindow_C_BP_GetDesiredFocusTarget");
static_assert(sizeof(WBP_RepairAllWindow_C_BP_GetDesiredFocusTarget) == 0x000010, "Wrong size on WBP_RepairAllWindow_C_BP_GetDesiredFocusTarget");
static_assert(offsetof(WBP_RepairAllWindow_C_BP_GetDesiredFocusTarget, ReturnValue) == 0x000000, "Member 'WBP_RepairAllWindow_C_BP_GetDesiredFocusTarget::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_RepairAllWindow_C_BP_GetDesiredFocusTarget, CallFunc_GetFocusTarget_FocusTarget) == 0x000008, "Member 'WBP_RepairAllWindow_C_BP_GetDesiredFocusTarget::CallFunc_GetFocusTarget_FocusTarget' has a wrong offset!");

}

