#pragma once

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Pal_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"


namespace PalSDK::Params
{

// Function WBP_Map_Base.WBP_Map_Base_C.AddBossIcon
// 0x0060 (0x0060 - 0x0000)
struct WBP_Map_Base_C_AddBossIcon final
{
public:
	struct FPalUIBossSpawnerLoactionData          SpawnerData;                                       // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_41[0x7];                                       // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Map_IconBoss_C*                    CallFunc_Create_ReturnValue;                       // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Add_Icon_By_Location_Added;               // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x3];                                       // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Base_C_AddBossIcon) == 0x000008, "Wrong alignment on WBP_Map_Base_C_AddBossIcon");
static_assert(sizeof(WBP_Map_Base_C_AddBossIcon) == 0x000060, "Wrong size on WBP_Map_Base_C_AddBossIcon");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, SpawnerData) == 0x000000, "Member 'WBP_Map_Base_C_AddBossIcon::SpawnerData' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_GetHUDService_ReturnValue) == 0x000038, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_Array_Contains_ReturnValue) == 0x000040, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000048, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_Create_ReturnValue) == 0x000050, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_Add_Icon_By_Location_Added) == 0x000058, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_Add_Icon_By_Location_Added' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddBossIcon, CallFunc_Array_Add_ReturnValue) == 0x00005C, "Member 'WBP_Map_Base_C_AddBossIcon::CallFunc_Array_Add_ReturnValue' has a wrong offset!");

// Function WBP_Map_Base.WBP_Map_Base_C.AddCustomIcon
// 0x0050 (0x0050 - 0x0000)
struct WBP_Map_Base_C_AddCustomIcon final
{
public:
	struct FGuid                                  LocationId;                                        // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPalCustomMarkerSaveData               MarkerData;                                        // 0x0010(0x0020)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_Map_IconCustom_C*                  CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Add_Icon_By_Location_Added;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Base_C_AddCustomIcon) == 0x000008, "Wrong alignment on WBP_Map_Base_C_AddCustomIcon");
static_assert(sizeof(WBP_Map_Base_C_AddCustomIcon) == 0x000050, "Wrong size on WBP_Map_Base_C_AddCustomIcon");
static_assert(offsetof(WBP_Map_Base_C_AddCustomIcon, LocationId) == 0x000000, "Member 'WBP_Map_Base_C_AddCustomIcon::LocationId' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddCustomIcon, MarkerData) == 0x000010, "Member 'WBP_Map_Base_C_AddCustomIcon::MarkerData' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddCustomIcon, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000030, "Member 'WBP_Map_Base_C_AddCustomIcon::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddCustomIcon, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_Map_Base_C_AddCustomIcon::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddCustomIcon, CallFunc_Array_Get_Item) == 0x000040, "Member 'WBP_Map_Base_C_AddCustomIcon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_AddCustomIcon, CallFunc_Add_Icon_By_Location_Added) == 0x000048, "Member 'WBP_Map_Base_C_AddCustomIcon::CallFunc_Add_Icon_By_Location_Added' has a wrong offset!");

// Function WBP_Map_Base.WBP_Map_Base_C.ChangeCustomIcon
// 0x0040 (0x0040 - 0x0000)
struct WBP_Map_Base_C_ChangeCustomIcon final
{
public:
	class UWBP_Map_IconCustom_C*                  Icon;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         Index_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  RemoveId;                                          // 0x000C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Map_IconCustom_C*                  K2Node_DynamicCast_AsWBP_Map_Icon_Custom;          // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_29[0x7];                                       // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             CallFunc_Array_Get_Item;                           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalLocationManager*                    CallFunc_GetLocationManager_ReturnValue;           // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Base_C_ChangeCustomIcon) == 0x000008, "Wrong alignment on WBP_Map_Base_C_ChangeCustomIcon");
static_assert(sizeof(WBP_Map_Base_C_ChangeCustomIcon) == 0x000040, "Wrong size on WBP_Map_Base_C_ChangeCustomIcon");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, Icon) == 0x000000, "Member 'WBP_Map_Base_C_ChangeCustomIcon::Icon' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, Index_0) == 0x000008, "Member 'WBP_Map_Base_C_ChangeCustomIcon::Index_0' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, RemoveId) == 0x00000C, "Member 'WBP_Map_Base_C_ChangeCustomIcon::RemoveId' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, CallFunc_IsValid_ReturnValue) == 0x00001C, "Member 'WBP_Map_Base_C_ChangeCustomIcon::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, K2Node_DynamicCast_AsWBP_Map_Icon_Custom) == 0x000020, "Member 'WBP_Map_Base_C_ChangeCustomIcon::K2Node_DynamicCast_AsWBP_Map_Icon_Custom' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'WBP_Map_Base_C_ChangeCustomIcon::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, CallFunc_Array_Get_Item) == 0x000030, "Member 'WBP_Map_Base_C_ChangeCustomIcon::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeCustomIcon, CallFunc_GetLocationManager_ReturnValue) == 0x000038, "Member 'WBP_Map_Base_C_ChangeCustomIcon::CallFunc_GetLocationManager_ReturnValue' has a wrong offset!");

// Function WBP_Map_Base.WBP_Map_Base_C.ChangeFilter
// 0x01E8 (0x01E8 - 0x0000)
struct WBP_Map_Base_C_ChangeFilter final
{
public:
	EPalLocationType                              FilterMap;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnable;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<EPalLocationType>                        TempFilter;                                        // 0x0008(0x0050)(Edit, BlueprintVisible)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalLocationType                              Temp_byte_Variable_1;                              // 0x005A(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalLocationType                              Temp_byte_Variable_4;                              // 0x005E(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalLocationType                              Temp_byte_Variable_5;                              // 0x005F(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_6;                              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_7;                              // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_2;                              // 0x0063(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_8;                              // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_9;                              // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_3;                              // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_10;                             // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_11;                             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_69[0x7];                                       // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<EPalLocationType>                        K2Node_MakeVariable_MakeVariableOutput;            // 0x0070(0x0050)()
	int32                                         Temp_int_Array_Index_Variable;                     // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable;                    // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_1;                   // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_12;                             // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_D1[0x3];                                       // 0x00D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Loop_Counter_Variable_1;                  // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_2;                  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_2;                 // 0x00E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_2;                   // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_3;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_3;                 // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_4;                              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x3];                                       // 0x00F1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Temp_int_Array_Index_Variable_3;                   // 0x00F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Loop_Counter_Variable_4;                  // 0x00F8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue_4;                 // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Temp_int_Array_Index_Variable_4;                   // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Map_IconCustom_C*>          CallFunc_Map_Values_Values;                        // 0x0108(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_Map_IconBoss_C*                    CallFunc_Array_Get_Item;                           // 0x0118(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UWBP_Map_IconCustom_C*                  CallFunc_Array_Get_Item_1;                         // 0x0120(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsHiding_Hiding;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x012C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalLocationType                              Temp_byte_Variable_13;                             // 0x0137(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue_1;               // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_13C[0x4];                                      // 0x013C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<EPalLocationType>                        K2Node_MakeSet_Set;                                // 0x0140(0x0050)()
	bool                                          CallFunc_Set_Contains_ReturnValue_2;               // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue_3;               // 0x0191(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_2;                           // 0x0192(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_3;                           // 0x0193(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Remove_ReturnValue;                   // 0x0194(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_195[0x3];                                      // 0x0195(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Map_IconPlayer_C*                  CallFunc_Array_Get_Item_2;                         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_2;                // 0x01A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A5[0x3];                                      // 0x01A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Map_IconDeath_C*                   CallFunc_Array_Get_Item_3;                         // 0x01A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UWBP_WorldMap_IconBase_NoDesign_C*> CallFunc_Map_Values_Values_1;                      // 0x01B0(0x0010)(ReferenceParm, ContainsInstancedReference)
	class UWBP_WorldMap_IconBase_NoDesign_C*      CallFunc_Array_Get_Item_4;                         // 0x01C0(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsHiding_Hiding_1;                     // 0x01CC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_3;                // 0x01CD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1CE[0x2];                                      // 0x01CE(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalLocationPoint*                      CallFunc_GetLocationPoint_LocationPoint;           // 0x01D0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalLocationType                              CallFunc_GetType_ReturnValue;                      // 0x01D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D9[0x3];                                      // 0x01D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_4;               // 0x01DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue_4;               // 0x01E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_4;                // 0x01E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x01E2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_4;                           // 0x01E3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Base_C_ChangeFilter) == 0x000008, "Wrong alignment on WBP_Map_Base_C_ChangeFilter");
static_assert(sizeof(WBP_Map_Base_C_ChangeFilter) == 0x0001E8, "Wrong size on WBP_Map_Base_C_ChangeFilter");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, FilterMap) == 0x000000, "Member 'WBP_Map_Base_C_ChangeFilter::FilterMap' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, IsEnable) == 0x000001, "Member 'WBP_Map_Base_C_ChangeFilter::IsEnable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, TempFilter) == 0x000008, "Member 'WBP_Map_Base_C_ChangeFilter::TempFilter' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable) == 0x000058, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000059, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_1) == 0x00005A, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_bool_Variable) == 0x00005B, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_2) == 0x00005C, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_3) == 0x00005D, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_4) == 0x00005E, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_5) == 0x00005F, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_5' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_bool_Variable_1) == 0x000060, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_6) == 0x000061, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_6' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_7) == 0x000062, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_7' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_bool_Variable_2) == 0x000063, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_bool_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_8) == 0x000064, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_8' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_9) == 0x000065, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_9' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_bool_Variable_3) == 0x000066, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_bool_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_10) == 0x000067, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_10' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_11) == 0x000068, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_11' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, K2Node_MakeVariable_MakeVariableOutput) == 0x000070, "Member 'WBP_Map_Base_C_ChangeFilter::K2Node_MakeVariable_MakeVariableOutput' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Array_Index_Variable) == 0x0000C0, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Loop_Counter_Variable) == 0x0000C4, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Add_IntInt_ReturnValue) == 0x0000C8, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Array_Index_Variable_1) == 0x0000CC, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_12) == 0x0000D0, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_12' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Loop_Counter_Variable_1) == 0x0000D4, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Add_IntInt_ReturnValue_1) == 0x0000D8, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Loop_Counter_Variable_2) == 0x0000DC, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Loop_Counter_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Add_IntInt_ReturnValue_2) == 0x0000E0, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Add_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Array_Index_Variable_2) == 0x0000E4, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Array_Index_Variable_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Loop_Counter_Variable_3) == 0x0000E8, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Loop_Counter_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Add_IntInt_ReturnValue_3) == 0x0000EC, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Add_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_bool_Variable_4) == 0x0000F0, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_bool_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Array_Index_Variable_3) == 0x0000F4, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Array_Index_Variable_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Loop_Counter_Variable_4) == 0x0000F8, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Loop_Counter_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Add_IntInt_ReturnValue_4) == 0x0000FC, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Add_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_int_Array_Index_Variable_4) == 0x000100, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_int_Array_Index_Variable_4' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Map_Values_Values) == 0x000108, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Map_Values_Values' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Get_Item) == 0x000118, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Get_Item_1) == 0x000120, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_GetIsHiding_Hiding) == 0x000128, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_GetIsHiding_Hiding' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Length_ReturnValue) == 0x00012C, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Length_ReturnValue_1) == 0x000130, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Less_IntInt_ReturnValue) == 0x000134, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Less_IntInt_ReturnValue_1) == 0x000135, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Set_Contains_ReturnValue) == 0x000136, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, Temp_byte_Variable_13) == 0x000137, "Member 'WBP_Map_Base_C_ChangeFilter::Temp_byte_Variable_13' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_BooleanOR_ReturnValue) == 0x000138, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Set_Contains_ReturnValue_1) == 0x000139, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Set_Contains_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, K2Node_Select_Default) == 0x00013A, "Member 'WBP_Map_Base_C_ChangeFilter::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, K2Node_Select_Default_1) == 0x00013B, "Member 'WBP_Map_Base_C_ChangeFilter::K2Node_Select_Default_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, K2Node_MakeSet_Set) == 0x000140, "Member 'WBP_Map_Base_C_ChangeFilter::K2Node_MakeSet_Set' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Set_Contains_ReturnValue_2) == 0x000190, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Set_Contains_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Set_Contains_ReturnValue_3) == 0x000191, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Set_Contains_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, K2Node_Select_Default_2) == 0x000192, "Member 'WBP_Map_Base_C_ChangeFilter::K2Node_Select_Default_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, K2Node_Select_Default_3) == 0x000193, "Member 'WBP_Map_Base_C_ChangeFilter::K2Node_Select_Default_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Set_Remove_ReturnValue) == 0x000194, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Set_Remove_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Get_Item_2) == 0x000198, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Length_ReturnValue_2) == 0x0001A0, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Less_IntInt_ReturnValue_2) == 0x0001A4, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Less_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Get_Item_3) == 0x0001A8, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Map_Values_Values_1) == 0x0001B0, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Map_Values_Values_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Get_Item_4) == 0x0001C0, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Length_ReturnValue_3) == 0x0001C8, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_GetIsHiding_Hiding_1) == 0x0001CC, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_GetIsHiding_Hiding_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Less_IntInt_ReturnValue_3) == 0x0001CD, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Less_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_GetLocationPoint_LocationPoint) == 0x0001D0, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_GetLocationPoint_LocationPoint' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_GetType_ReturnValue) == 0x0001D8, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_GetType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Array_Length_ReturnValue_4) == 0x0001DC, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Array_Length_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Set_Contains_ReturnValue_4) == 0x0001E0, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Set_Contains_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_Less_IntInt_ReturnValue_4) == 0x0001E1, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_Less_IntInt_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, CallFunc_BooleanOR_ReturnValue_1) == 0x0001E2, "Member 'WBP_Map_Base_C_ChangeFilter::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ChangeFilter, K2Node_Select_Default_4) == 0x0001E3, "Member 'WBP_Map_Base_C_ChangeFilter::K2Node_Select_Default_4' has a wrong offset!");

// Function WBP_Map_Base.WBP_Map_Base_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x0010 (0x0010 - 0x0000)
struct WBP_Map_Base_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	struct FGuid                                  MarkerId;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Base_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000004, "Wrong alignment on WBP_Map_Base_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(WBP_Map_Base_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000010, "Wrong size on WBP_Map_Base_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(WBP_Map_Base_C_CREATEDELEGATE_PROXYFUNCTION_0, MarkerId) == 0x000000, "Member 'WBP_Map_Base_C_CREATEDELEGATE_PROXYFUNCTION_0::MarkerId' has a wrong offset!");

// Function WBP_Map_Base.WBP_Map_Base_C.Enable Custom Mark
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_Map_Base_C_Enable_Custom_Mark final
{
public:
	class UPalLocationManager*                    CallFunc_GetLocationManager_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<struct FGuid, struct FPalCustomMarkerSaveData> CallFunc_GetCustomMarkers_ReturnValue;             // 0x0008(0x0050)()
	class UPalGameSetting*                        CallFunc_GetGameSetting_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_66[0x2];                                       // 0x0066(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_79[0x7];                                       // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Map_IconCustom_C*                  K2Node_DynamicCast_AsWBP_Map_Icon_Custom;          // 0x0080(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_89[0x7];                                       // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalLocationManager*                    CallFunc_GetLocationManager_ReturnValue_1;         // 0x0090(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0098(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Project_Icon_Position_to_World_Postion_WorldPosition; // 0x00A8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                  CallFunc_AddLocalCustomLocation_ReturnValue;       // 0x00C0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Base_C_Enable_Custom_Mark) == 0x000008, "Wrong alignment on WBP_Map_Base_C_Enable_Custom_Mark");
static_assert(sizeof(WBP_Map_Base_C_Enable_Custom_Mark) == 0x0000D0, "Wrong size on WBP_Map_Base_C_Enable_Custom_Mark");
static_assert(offsetof(WBP_Map_Base_C_Enable_Custom_Mark, CallFunc_GetLocationManager_ReturnValue) == 0x000000, "Member 'WBP_Map_Base_C_Enable_Custom_Mark::CallFunc_GetLocationManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Enable_Custom_Mark, CallFunc_GetCustomMarkers_ReturnValue) == 0x000008, "Member 'WBP_Map_Base_C_Enable_Custom_Mark::CallFunc_GetCustomMarkers_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Enable_Custom_Mark, CallFunc_GetGameSetting_ReturnValue) == 0x000058, "Member 'WBP_Map_Base_C_Enable_Custom_Mark::CallFunc_GetGameSetting_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Enable_Custom_Mark, CallFunc_Map_Length_ReturnValue) == 0x000060, "Member 'WBP_Map_Base_C_Enable_Custom_Mark::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Enable_Custom_Mark, CallFunc_Less_IntInt_ReturnValue) == 0x000064, "Member 'WBP_Map_Base_C_Enable_Custom_Mark::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Enable_Custom_Mark, CallFunc_BooleanAND_ReturnValue) == 0x000065, "Member 'WBP_Map_Base_C_Enable_Custom_Mark::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Enable_Custom_Mark, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x000068, "Member 'WBP_Map_Base_C_Enable_Custom_Mark::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Enable_Custom_Mark, CallFunc_IsValid_ReturnValue) == 0x000078, "Member 'WBP_Map_Base_C_Enable_Custom_Mark::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Enable_Custom_Mark, K2Node_DynamicCast_AsWBP_Map_Icon_Custom) == 0x000080, "Member 'WBP_Map_Base_C_Enable_Custom_Mark::K2Node_DynamicCast_AsWBP_Map_Icon_Custom' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Enable_Custom_Mark, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'WBP_Map_Base_C_Enable_Custom_Mark::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Enable_Custom_Mark, CallFunc_GetLocationManager_ReturnValue_1) == 0x000090, "Member 'WBP_Map_Base_C_Enable_Custom_Mark::CallFunc_GetLocationManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Enable_Custom_Mark, CallFunc_Conv_VectorToVector2D_ReturnValue_1) == 0x000098, "Member 'WBP_Map_Base_C_Enable_Custom_Mark::CallFunc_Conv_VectorToVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Enable_Custom_Mark, CallFunc_Project_Icon_Position_to_World_Postion_WorldPosition) == 0x0000A8, "Member 'WBP_Map_Base_C_Enable_Custom_Mark::CallFunc_Project_Icon_Position_to_World_Postion_WorldPosition' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_Enable_Custom_Mark, CallFunc_AddLocalCustomLocation_ReturnValue) == 0x0000C0, "Member 'WBP_Map_Base_C_Enable_Custom_Mark::CallFunc_AddLocalCustomLocation_ReturnValue' has a wrong offset!");

// Function WBP_Map_Base.WBP_Map_Base_C.ExecuteUbergraph_WBP_Map_Base
// 0x0408 (0x0408 - 0x0000)
struct WBP_Map_Base_C_ExecuteUbergraph_WBP_Map_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_2;                              // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPalWorldMapUIDataTableRow             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x00D8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E1[0x7];                                       // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalDebugSetting*                       CallFunc_GetPalDebugSetting_ReturnValue;           // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_F1[0x7];                                       // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UWBP_Map_IconPlayer_C*>          CallFunc_Setup_Player_Icon_PlayerIcons;            // 0x00F8(0x0010)(ReferenceParm, ContainsInstancedReference)
	ESlateVisibility                              Temp_byte_Variable_3;                              // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_109[0x7];                                      // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameterBase*           CallFunc_GetParam_ReturnValue;                     // 0x0110(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDDispatchParameter_WorldMap*      K2Node_DynamicCast_AsPal_HUDDispatch_Parameter_World_Map; // 0x0120(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_129[0x3];                                      // 0x0129(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x012C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue;        // 0x013C(0x0004)(NoDestructor)
	TDelegate<void(class UWBP_Map_IconCustom_C* Icon)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0140(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_Map_IconCustom_C* Icon, int32 Index)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0150(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_3;            // 0x0160(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_1;      // 0x0170(0x0004)(NoDestructor)
	TDelegate<void(EPalLocationType FilterMap, bool IsEnable)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0174(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0184(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0185(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_186[0x2];                                      // 0x0186(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_WorldMap_IconBase_NoDesign_C* IconWidget)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0198(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_7;            // 0x01A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_2;      // 0x01B8(0x0004)(NoDestructor)
	uint8                                         Pad_1BC[0x4];                                      // 0x01BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x01C0(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0200(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_204[0x4];                                      // 0x0204(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x0208(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_1;                          // 0x0220(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_1;                          // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_1;                          // 0x0230(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x0238(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue_1;      // 0x0248(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Project_Icon_Position_to_World_Postion_WorldPosition; // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_X_2;                          // 0x0278(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y_2;                          // 0x0280(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z_2;                          // 0x0288(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default_1;                           // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_291[0x7];                                      // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_MapRangeUnclamped_ReturnValue;            // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_MapRangeUnclamped_ReturnValue_1;          // 0x02A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue;            // 0x02A8(0x0018)()
	class FText                                   CallFunc_Conv_DoubleToText_ReturnValue_1;          // 0x02C0(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x02D8(0x0050)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x0328(0x0050)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0378(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0388(0x0018)()
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x03A0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_8;            // 0x03A8(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_3;      // 0x03B8(0x0004)(NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_9;            // 0x03BC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_10;           // 0x03CC(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_4;      // 0x03DC(0x0004)(NoDestructor)
	class UPalWorldMapUIData*                     CallFunc_GetLocalWorldMapData_ReturnValue;         // 0x03E0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalUIActionBindData                   CallFunc_RegisterActionBinding_ReturnValue_5;      // 0x03E8(0x0004)(NoDestructor)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x03EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetLocalPlayerID_ReturnValue;             // 0x03F4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x03F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_UnlockMap_ReturnValue;                    // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Base_C_ExecuteUbergraph_WBP_Map_Base) == 0x000008, "Wrong alignment on WBP_Map_Base_C_ExecuteUbergraph_WBP_Map_Base");
static_assert(sizeof(WBP_Map_Base_C_ExecuteUbergraph_WBP_Map_Base) == 0x000408, "Wrong size on WBP_Map_Base_C_ExecuteUbergraph_WBP_Map_Base");
static_assert(offsetof(WBP_Map_Base_C_ExecuteUbergraph_WBP_Map_Base, EntryPoint) == 0x000000, "Member 'WBP_Map_Base_C_ExecuteUbergraph_WBP_Map_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ExecuteUbergraph_WBP_Map_Base, Temp_byte_Variable) == 0x000004, "Member 'WBP_Map_Base_C_ExecuteUbergraph_WBP_Map_Base::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Base_C_ExecuteUbergraph_WBP_Map_Base, Temp_bool_Variable) == 0x000005, "Member 'WBP_Map_Base_C_ExecuteUbergraph_WBP_Map_Base::Temp_bool_Variable' has a wrong offset!");
