#pragma once

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace PalSDK::Params
{

// Function WBP_Map_IconPlayer.WBP_Map_IconPlayer_C.BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_IconPlayer_C_BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconPlayer_C_BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Map_IconPlayer_C_BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Map_IconPlayer_C_BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Map_IconPlayer_C_BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Map_IconPlayer_C_BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Map_IconPlayer_C_BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Map_IconPlayer.WBP_Map_IconPlayer_C.BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_IconPlayer_C_BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconPlayer_C_BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Map_IconPlayer_C_BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Map_IconPlayer_C_BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Map_IconPlayer_C_BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Map_IconPlayer_C_BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Map_IconPlayer_C_BndEvt__WBP_Map_IconPlayer_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Map_IconPlayer.WBP_Map_IconPlayer_C.ExecuteUbergraph_WBP_Map_IconPlayer
// 0x0018 (0x0018 - 0x0000)
struct WBP_Map_IconPlayer_C_ExecuteUbergraph_WBP_Map_IconPlayer final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconPlayer_C_ExecuteUbergraph_WBP_Map_IconPlayer) == 0x000008, "Wrong alignment on WBP_Map_IconPlayer_C_ExecuteUbergraph_WBP_Map_IconPlayer");
static_assert(sizeof(WBP_Map_IconPlayer_C_ExecuteUbergraph_WBP_Map_IconPlayer) == 0x000018, "Wrong size on WBP_Map_IconPlayer_C_ExecuteUbergraph_WBP_Map_IconPlayer");
static_assert(offsetof(WBP_Map_IconPlayer_C_ExecuteUbergraph_WBP_Map_IconPlayer, EntryPoint) == 0x000000, "Member 'WBP_Map_IconPlayer_C_ExecuteUbergraph_WBP_Map_IconPlayer::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_ExecuteUbergraph_WBP_Map_IconPlayer, K2Node_ComponentBoundEvent_Button_1) == 0x000008, "Member 'WBP_Map_IconPlayer_C_ExecuteUbergraph_WBP_Map_IconPlayer::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_ExecuteUbergraph_WBP_Map_IconPlayer, K2Node_ComponentBoundEvent_Button) == 0x000010, "Member 'WBP_Map_IconPlayer_C_ExecuteUbergraph_WBP_Map_IconPlayer::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_Map_IconPlayer.WBP_Map_IconPlayer_C.GetLocationPosition
// 0x0060 (0x0060 - 0x0000)
struct WBP_Map_IconPlayer_C_GetLocationPosition final
{
public:
	struct FVector                                LocationPosition;                                  // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0030(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0048(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconPlayer_C_GetLocationPosition) == 0x000008, "Wrong alignment on WBP_Map_IconPlayer_C_GetLocationPosition");
static_assert(sizeof(WBP_Map_IconPlayer_C_GetLocationPosition) == 0x000060, "Wrong size on WBP_Map_IconPlayer_C_GetLocationPosition");
static_assert(offsetof(WBP_Map_IconPlayer_C_GetLocationPosition, LocationPosition) == 0x000000, "Member 'WBP_Map_IconPlayer_C_GetLocationPosition::LocationPosition' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_GetLocationPosition, CallFunc_BreakTransform_Location) == 0x000018, "Member 'WBP_Map_IconPlayer_C_GetLocationPosition::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_GetLocationPosition, CallFunc_BreakTransform_Rotation) == 0x000030, "Member 'WBP_Map_IconPlayer_C_GetLocationPosition::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_GetLocationPosition, CallFunc_BreakTransform_Scale) == 0x000048, "Member 'WBP_Map_IconPlayer_C_GetLocationPosition::CallFunc_BreakTransform_Scale' has a wrong offset!");

// Function WBP_Map_IconPlayer.WBP_Map_IconPlayer_C.SetIsLocalPlayer
// 0x0020 (0x0020 - 0x0000)
struct WBP_Map_IconPlayer_C_SetIsLocalPlayer final
{
public:
	bool                                          IsLocal;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6[0x2];                                        // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             Temp_object_Variable;                              // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             Temp_object_Variable_1;                            // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_Select_Default_1;                           // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconPlayer_C_SetIsLocalPlayer) == 0x000008, "Wrong alignment on WBP_Map_IconPlayer_C_SetIsLocalPlayer");
static_assert(sizeof(WBP_Map_IconPlayer_C_SetIsLocalPlayer) == 0x000020, "Wrong size on WBP_Map_IconPlayer_C_SetIsLocalPlayer");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetIsLocalPlayer, IsLocal) == 0x000000, "Member 'WBP_Map_IconPlayer_C_SetIsLocalPlayer::IsLocal' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetIsLocalPlayer, Temp_bool_Variable) == 0x000001, "Member 'WBP_Map_IconPlayer_C_SetIsLocalPlayer::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetIsLocalPlayer, Temp_byte_Variable) == 0x000002, "Member 'WBP_Map_IconPlayer_C_SetIsLocalPlayer::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetIsLocalPlayer, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_Map_IconPlayer_C_SetIsLocalPlayer::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetIsLocalPlayer, Temp_bool_Variable_1) == 0x000004, "Member 'WBP_Map_IconPlayer_C_SetIsLocalPlayer::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetIsLocalPlayer, K2Node_Select_Default) == 0x000005, "Member 'WBP_Map_IconPlayer_C_SetIsLocalPlayer::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetIsLocalPlayer, Temp_object_Variable) == 0x000008, "Member 'WBP_Map_IconPlayer_C_SetIsLocalPlayer::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetIsLocalPlayer, Temp_object_Variable_1) == 0x000010, "Member 'WBP_Map_IconPlayer_C_SetIsLocalPlayer::Temp_object_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetIsLocalPlayer, K2Node_Select_Default_1) == 0x000018, "Member 'WBP_Map_IconPlayer_C_SetIsLocalPlayer::K2Node_Select_Default_1' has a wrong offset!");

// Function WBP_Map_IconPlayer.WBP_Map_IconPlayer_C.SetPlayerStateMapInfo
// 0x00E0 (0x00E0 - 0x0000)
struct WBP_Map_IconPlayer_C_SetPlayerStateMapInfo final
{
public:
	struct FPalPlayerInfoForMap                   MapInfo;                                           // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00B8(0x0018)()
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconPlayer_C_SetPlayerStateMapInfo) == 0x000010, "Wrong alignment on WBP_Map_IconPlayer_C_SetPlayerStateMapInfo");
static_assert(sizeof(WBP_Map_IconPlayer_C_SetPlayerStateMapInfo) == 0x0000E0, "Wrong size on WBP_Map_IconPlayer_C_SetPlayerStateMapInfo");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetPlayerStateMapInfo, MapInfo) == 0x000000, "Member 'WBP_Map_IconPlayer_C_SetPlayerStateMapInfo::MapInfo' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetPlayerStateMapInfo, CallFunc_BreakTransform_Location) == 0x000070, "Member 'WBP_Map_IconPlayer_C_SetPlayerStateMapInfo::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetPlayerStateMapInfo, CallFunc_BreakTransform_Rotation) == 0x000088, "Member 'WBP_Map_IconPlayer_C_SetPlayerStateMapInfo::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetPlayerStateMapInfo, CallFunc_BreakTransform_Scale) == 0x0000A0, "Member 'WBP_Map_IconPlayer_C_SetPlayerStateMapInfo::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetPlayerStateMapInfo, CallFunc_Conv_StringToText_ReturnValue) == 0x0000B8, "Member 'WBP_Map_IconPlayer_C_SetPlayerStateMapInfo::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetPlayerStateMapInfo, CallFunc_BreakRotator_Roll) == 0x0000D0, "Member 'WBP_Map_IconPlayer_C_SetPlayerStateMapInfo::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetPlayerStateMapInfo, CallFunc_BreakRotator_Pitch) == 0x0000D4, "Member 'WBP_Map_IconPlayer_C_SetPlayerStateMapInfo::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_SetPlayerStateMapInfo, CallFunc_BreakRotator_Yaw) == 0x0000D8, "Member 'WBP_Map_IconPlayer_C_SetPlayerStateMapInfo::CallFunc_BreakRotator_Yaw' has a wrong offset!");

// Function WBP_Map_IconPlayer.WBP_Map_IconPlayer_C.UpdateMapInfo
// 0x00D0 (0x00D0 - 0x0000)
struct WBP_Map_IconPlayer_C_UpdateMapInfo final
{
public:
	struct FPalPlayerInfoForMap                   MapInfo;                                           // 0x0000(0x0070)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0070(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x0088(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00A0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconPlayer_C_UpdateMapInfo) == 0x000010, "Wrong alignment on WBP_Map_IconPlayer_C_UpdateMapInfo");
static_assert(sizeof(WBP_Map_IconPlayer_C_UpdateMapInfo) == 0x0000D0, "Wrong size on WBP_Map_IconPlayer_C_UpdateMapInfo");
static_assert(offsetof(WBP_Map_IconPlayer_C_UpdateMapInfo, MapInfo) == 0x000000, "Member 'WBP_Map_IconPlayer_C_UpdateMapInfo::MapInfo' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_UpdateMapInfo, CallFunc_BreakTransform_Location) == 0x000070, "Member 'WBP_Map_IconPlayer_C_UpdateMapInfo::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_UpdateMapInfo, CallFunc_BreakTransform_Rotation) == 0x000088, "Member 'WBP_Map_IconPlayer_C_UpdateMapInfo::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_UpdateMapInfo, CallFunc_BreakTransform_Scale) == 0x0000A0, "Member 'WBP_Map_IconPlayer_C_UpdateMapInfo::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_UpdateMapInfo, CallFunc_BreakRotator_Roll) == 0x0000B8, "Member 'WBP_Map_IconPlayer_C_UpdateMapInfo::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_UpdateMapInfo, CallFunc_BreakRotator_Pitch) == 0x0000BC, "Member 'WBP_Map_IconPlayer_C_UpdateMapInfo::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconPlayer_C_UpdateMapInfo, CallFunc_BreakRotator_Yaw) == 0x0000C0, "Member 'WBP_Map_IconPlayer_C_UpdateMapInfo::CallFunc_BreakRotator_Yaw' has a wrong offset!");

}

