#pragma once

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Pal_structs.hpp"
#include "SlateCore_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace PalSDK::Params
{

// Function WBP_MapFilter_Content.WBP_MapFilter_Content_C.BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MapFilter_Content.WBP_MapFilter_Content_C.BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MapFilter_Content.WBP_MapFilter_Content_C.BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_MapFilter_Content_C_BndEvt__WBP_MapFilter_Content_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_MapFilter_Content.WBP_MapFilter_Content_C.ChangeFilter__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct WBP_MapFilter_Content_C_ChangeFilter__DelegateSignature final
{
public:
	EPalLocationType                              LocationType;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsEnable;                                          // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapFilter_Content_C_ChangeFilter__DelegateSignature) == 0x000001, "Wrong alignment on WBP_MapFilter_Content_C_ChangeFilter__DelegateSignature");
static_assert(sizeof(WBP_MapFilter_Content_C_ChangeFilter__DelegateSignature) == 0x000002, "Wrong size on WBP_MapFilter_Content_C_ChangeFilter__DelegateSignature");
static_assert(offsetof(WBP_MapFilter_Content_C_ChangeFilter__DelegateSignature, LocationType) == 0x000000, "Member 'WBP_MapFilter_Content_C_ChangeFilter__DelegateSignature::LocationType' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_ChangeFilter__DelegateSignature, IsEnable) == 0x000001, "Member 'WBP_MapFilter_Content_C_ChangeFilter__DelegateSignature::IsEnable' has a wrong offset!");

// Function WBP_MapFilter_Content.WBP_MapFilter_Content_C.ExecuteUbergraph_WBP_MapFilter_Content
// 0x0230 (0x0230 - 0x0000)
struct WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0xC];                                        // 0x0004(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            CallFunc_MakeBrushFromTexture_ReturnValue;         // 0x0010(0x00D0)()
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x00E0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x00F0(0x0014)()
	uint8                                         Pad_104[0x4];                                      // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDataTableRowHandle                    K2Node_CustomEvent_MsgId;                          // 0x0108(0x0010)(NoDestructor)
	EPalLocationType                              K2Node_CustomEvent_LocationType;                   // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_119[0x7];                                      // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            K2Node_SetFieldsInStruct_StructOut;                // 0x0120(0x00D0)()
	class FText                                   CallFunc_GetLocalizedTextFromHandle_Text;          // 0x01F0(0x0018)()
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0208(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0210(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0218(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_Set;                            // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0222(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content) == 0x000010, "Wrong alignment on WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content");
static_assert(sizeof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content) == 0x000230, "Wrong size on WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content");
static_assert(offsetof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content, EntryPoint) == 0x000000, "Member 'WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content, CallFunc_MakeBrushFromTexture_ReturnValue) == 0x000010, "Member 'WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content::CallFunc_MakeBrushFromTexture_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content, CallFunc_SelectColor_ReturnValue) == 0x0000E0, "Member 'WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content::CallFunc_SelectColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content, K2Node_MakeStruct_SlateColor) == 0x0000F0, "Member 'WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content::K2Node_MakeStruct_SlateColor' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content, K2Node_CustomEvent_MsgId) == 0x000108, "Member 'WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content::K2Node_CustomEvent_MsgId' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content, K2Node_CustomEvent_LocationType) == 0x000118, "Member 'WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content::K2Node_CustomEvent_LocationType' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content, K2Node_SetFieldsInStruct_StructOut) == 0x000120, "Member 'WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content::K2Node_SetFieldsInStruct_StructOut' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content, CallFunc_GetLocalizedTextFromHandle_Text) == 0x0001F0, "Member 'WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content::CallFunc_GetLocalizedTextFromHandle_Text' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content, K2Node_ComponentBoundEvent_Button_2) == 0x000208, "Member 'WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content, K2Node_ComponentBoundEvent_Button_1) == 0x000210, "Member 'WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content, K2Node_ComponentBoundEvent_Button) == 0x000218, "Member 'WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content, CallFunc_IsChecked_ReturnValue) == 0x000220, "Member 'WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content::CallFunc_IsChecked_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content, K2Node_CustomEvent_Set) == 0x000221, "Member 'WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content::K2Node_CustomEvent_Set' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content, CallFunc_Not_PreBool_ReturnValue) == 0x000222, "Member 'WBP_MapFilter_Content_C_ExecuteUbergraph_WBP_MapFilter_Content::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function WBP_MapFilter_Content.WBP_MapFilter_Content_C.SetFilter
// 0x0018 (0x0018 - 0x0000)
struct WBP_MapFilter_Content_C_SetFilter final
{
public:
	struct FDataTableRowHandle                    MsgId;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	EPalLocationType                              LocationType;                                      // 0x0010(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapFilter_Content_C_SetFilter) == 0x000008, "Wrong alignment on WBP_MapFilter_Content_C_SetFilter");
static_assert(sizeof(WBP_MapFilter_Content_C_SetFilter) == 0x000018, "Wrong size on WBP_MapFilter_Content_C_SetFilter");
static_assert(offsetof(WBP_MapFilter_Content_C_SetFilter, MsgId) == 0x000000, "Member 'WBP_MapFilter_Content_C_SetFilter::MsgId' has a wrong offset!");
static_assert(offsetof(WBP_MapFilter_Content_C_SetFilter, LocationType) == 0x000010, "Member 'WBP_MapFilter_Content_C_SetFilter::LocationType' has a wrong offset!");

// Function WBP_MapFilter_Content.WBP_MapFilter_Content_C.SetForceEnable
// 0x0001 (0x0001 - 0x0000)
struct WBP_MapFilter_Content_C_SetForceEnable final
{
public:
	bool                                          Set;                                               // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_MapFilter_Content_C_SetForceEnable) == 0x000001, "Wrong alignment on WBP_MapFilter_Content_C_SetForceEnable");
static_assert(sizeof(WBP_MapFilter_Content_C_SetForceEnable) == 0x000001, "Wrong size on WBP_MapFilter_Content_C_SetForceEnable");
static_assert(offsetof(WBP_MapFilter_Content_C_SetForceEnable, Set) == 0x000000, "Member 'WBP_MapFilter_Content_C_SetForceEnable::Set' has a wrong offset!");

}

