#pragma once

#include "Basic.hpp"

#include "CommonInput_structs.hpp"
#include "UMG_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "Pal_structs.hpp"
#include "SlateCore_structs.hpp"
#include "InputCore_structs.hpp"
#include "Engine_structs.hpp"
#include "Slate_structs.hpp"


namespace PalSDK::Params
{

// Function WBP_Map_Body.WBP_Map_Body_C.Add Icon
// 0x0070 (0x0070 - 0x0000)
struct WBP_Map_Body_C_Add_Icon final
{
public:
	class UWBP_WorldMap_IconBase_NoDesign_C*      IconWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Added;                                             // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalHUDService*                         CallFunc_GetHUDService_ReturnValue;                // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsIgnoreMask_IsIgnore;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetLocationPosition_LocationPosition;     // 0x0020(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_WorldMap_IconBase_NoDesign_C* IconWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0038(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4A[0x2];                                       // 0x004A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_WorldMap_IconBase_NoDesign_C* IconWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x004C(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Add_Icon_By_Location_Added;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5D[0x3];                                       // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UWBP_WorldMap_IconBase_NoDesign_C* IconWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0060(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Body_C_Add_Icon) == 0x000008, "Wrong alignment on WBP_Map_Body_C_Add_Icon");
static_assert(sizeof(WBP_Map_Body_C_Add_Icon) == 0x000070, "Wrong size on WBP_Map_Body_C_Add_Icon");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon, IconWidget) == 0x000000, "Member 'WBP_Map_Body_C_Add_Icon::IconWidget' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon, Added) == 0x000008, "Member 'WBP_Map_Body_C_Add_Icon::Added' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon, CallFunc_GetHUDService_ReturnValue) == 0x000010, "Member 'WBP_Map_Body_C_Add_Icon::CallFunc_GetHUDService_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon, CallFunc_IsIgnoreMask_IsIgnore) == 0x000018, "Member 'WBP_Map_Body_C_Add_Icon::CallFunc_IsIgnoreMask_IsIgnore' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon, CallFunc_GetLocationPosition_LocationPosition) == 0x000020, "Member 'WBP_Map_Body_C_Add_Icon::CallFunc_GetLocationPosition_LocationPosition' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon, K2Node_CreateDelegate_OutputDelegate) == 0x000038, "Member 'WBP_Map_Body_C_Add_Icon::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon, CallFunc_Array_Contains_ReturnValue) == 0x000048, "Member 'WBP_Map_Body_C_Add_Icon::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon, CallFunc_BooleanOR_ReturnValue) == 0x000049, "Member 'WBP_Map_Body_C_Add_Icon::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon, K2Node_CreateDelegate_OutputDelegate_1) == 0x00004C, "Member 'WBP_Map_Body_C_Add_Icon::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon, CallFunc_Add_Icon_By_Location_Added) == 0x00005C, "Member 'WBP_Map_Body_C_Add_Icon::CallFunc_Add_Icon_By_Location_Added' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon, K2Node_CreateDelegate_OutputDelegate_2) == 0x000060, "Member 'WBP_Map_Body_C_Add_Icon::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");

// Function WBP_Map_Body.WBP_Map_Body_C.Add Icon By Location
// 0x0070 (0x0070 - 0x0000)
struct WBP_Map_Body_C_Add_Icon_By_Location final
{
public:
	class UWBP_WorldMap_IconBase_NoDesign_C*      Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                WorldLocation;                                     // 0x0008(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IgnoreMask;                                        // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Added;                                             // 0x0021(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_22[0x6];                                       // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_WorldMap_IconBase_NoDesign_C* IconWidget)> K2Node_CreateDelegate_OutputDelegate;              // 0x0030(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_WorldMap_IconBase_NoDesign_C* IconWidget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWBP_WorldMap_IconBase_NoDesign_C* IconWidget)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0050(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Update_Icon_Visibility_Visible;           // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_62[0x6];                                       // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanel*                           K2Node_Select_Default;                             // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Body_C_Add_Icon_By_Location) == 0x000008, "Wrong alignment on WBP_Map_Body_C_Add_Icon_By_Location");
static_assert(sizeof(WBP_Map_Body_C_Add_Icon_By_Location) == 0x000070, "Wrong size on WBP_Map_Body_C_Add_Icon_By_Location");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon_By_Location, Widget) == 0x000000, "Member 'WBP_Map_Body_C_Add_Icon_By_Location::Widget' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon_By_Location, WorldLocation) == 0x000008, "Member 'WBP_Map_Body_C_Add_Icon_By_Location::WorldLocation' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon_By_Location, IgnoreMask) == 0x000020, "Member 'WBP_Map_Body_C_Add_Icon_By_Location::IgnoreMask' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon_By_Location, Added) == 0x000021, "Member 'WBP_Map_Body_C_Add_Icon_By_Location::Added' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon_By_Location, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000028, "Member 'WBP_Map_Body_C_Add_Icon_By_Location::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon_By_Location, K2Node_CreateDelegate_OutputDelegate) == 0x000030, "Member 'WBP_Map_Body_C_Add_Icon_By_Location::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon_By_Location, K2Node_CreateDelegate_OutputDelegate_1) == 0x000040, "Member 'WBP_Map_Body_C_Add_Icon_By_Location::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon_By_Location, K2Node_CreateDelegate_OutputDelegate_2) == 0x000050, "Member 'WBP_Map_Body_C_Add_Icon_By_Location::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon_By_Location, Temp_bool_Variable) == 0x000060, "Member 'WBP_Map_Body_C_Add_Icon_By_Location::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon_By_Location, CallFunc_Update_Icon_Visibility_Visible) == 0x000061, "Member 'WBP_Map_Body_C_Add_Icon_By_Location::CallFunc_Update_Icon_Visibility_Visible' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Add_Icon_By_Location, K2Node_Select_Default) == 0x000068, "Member 'WBP_Map_Body_C_Add_Icon_By_Location::K2Node_Select_Default' has a wrong offset!");

// Function WBP_Map_Body.WBP_Map_Body_C.Adjust Scroll Local Player Position
// 0x0170 (0x0170 - 0x0000)
struct WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position final
{
public:
	class APalPlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_28[0x8];                                       // 0x0028(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalPlayerInfoForMap                   CallFunc_GetPlayerInfoForMap_ReturnValue;          // 0x0030(0x0070)()
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x00B0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x00C8(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x00E0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_WorldLocationToWidgetOffset_offset;       // 0x00F8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0138(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue_1;  // 0x0148(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position) == 0x000010, "Wrong alignment on WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position");
static_assert(sizeof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position) == 0x000170, "Wrong size on WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000000, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_GetSize_ReturnValue) == 0x000018, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_GetPlayerInfoForMap_ReturnValue) == 0x000030, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_GetPlayerInfoForMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x0000A0, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_BreakTransform_Location) == 0x0000B0, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_BreakTransform_Rotation) == 0x0000C8, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_BreakTransform_Scale) == 0x0000E0, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_WorldLocationToWidgetOffset_offset) == 0x0000F8, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_WorldLocationToWidgetOffset_offset' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_BreakVector2D_X) == 0x000108, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_BreakVector2D_Y) == 0x000110, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_FMin_ReturnValue) == 0x000118, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_FMin_ReturnValue_1) == 0x000120, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_FMax_ReturnValue) == 0x000128, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_FMax_ReturnValue_1) == 0x000130, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_MakeVector2D_ReturnValue) == 0x000138, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_Multiply_Vector2DVector2D_ReturnValue_1) == 0x000148, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_Multiply_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000158, "Member 'WBP_Map_Body_C_Adjust_Scroll_Local_Player_Position::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Map_Body.WBP_Map_Body_C.AdjustScrollForRespawn
// 0x0088 (0x0088 - 0x0000)
struct WBP_Map_Body_C_AdjustScrollForRespawn final
{
public:
	double                                        CallFunc_BreakVector2D_X;                          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0040(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue_1;  // 0x0068(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0078(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Body_C_AdjustScrollForRespawn) == 0x000008, "Wrong alignment on WBP_Map_Body_C_AdjustScrollForRespawn");
static_assert(sizeof(WBP_Map_Body_C_AdjustScrollForRespawn) == 0x000088, "Wrong size on WBP_Map_Body_C_AdjustScrollForRespawn");
static_assert(offsetof(WBP_Map_Body_C_AdjustScrollForRespawn, CallFunc_BreakVector2D_X) == 0x000000, "Member 'WBP_Map_Body_C_AdjustScrollForRespawn::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_AdjustScrollForRespawn, CallFunc_BreakVector2D_Y) == 0x000008, "Member 'WBP_Map_Body_C_AdjustScrollForRespawn::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_AdjustScrollForRespawn, CallFunc_FMin_ReturnValue) == 0x000010, "Member 'WBP_Map_Body_C_AdjustScrollForRespawn::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_AdjustScrollForRespawn, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000018, "Member 'WBP_Map_Body_C_AdjustScrollForRespawn::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_AdjustScrollForRespawn, CallFunc_FMax_ReturnValue) == 0x000020, "Member 'WBP_Map_Body_C_AdjustScrollForRespawn::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_AdjustScrollForRespawn, CallFunc_GetSize_ReturnValue) == 0x000028, "Member 'WBP_Map_Body_C_AdjustScrollForRespawn::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_AdjustScrollForRespawn, CallFunc_FMin_ReturnValue_1) == 0x000038, "Member 'WBP_Map_Body_C_AdjustScrollForRespawn::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_AdjustScrollForRespawn, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000040, "Member 'WBP_Map_Body_C_AdjustScrollForRespawn::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_AdjustScrollForRespawn, CallFunc_FMax_ReturnValue_1) == 0x000050, "Member 'WBP_Map_Body_C_AdjustScrollForRespawn::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_AdjustScrollForRespawn, CallFunc_MakeVector2D_ReturnValue) == 0x000058, "Member 'WBP_Map_Body_C_AdjustScrollForRespawn::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_AdjustScrollForRespawn, CallFunc_Multiply_Vector2DVector2D_ReturnValue_1) == 0x000068, "Member 'WBP_Map_Body_C_AdjustScrollForRespawn::CallFunc_Multiply_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_AdjustScrollForRespawn, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000078, "Member 'WBP_Map_Body_C_AdjustScrollForRespawn::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Map_Body.WBP_Map_Body_C.CalcMapImagePosition
// 0x00C8 (0x00C8 - 0x0000)
struct WBP_Map_Body_C_CalcMapImagePosition final
{
public:
	struct FVector2D                              AddOffset;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              Position;                                          // 0x0010(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Add_Vector2DVector2D_ReturnValue;         // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue_1;                       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue_1;      // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue;                         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMax_ReturnValue_1;                       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x00B8(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Body_C_CalcMapImagePosition) == 0x000008, "Wrong alignment on WBP_Map_Body_C_CalcMapImagePosition");
static_assert(sizeof(WBP_Map_Body_C_CalcMapImagePosition) == 0x0000C8, "Wrong size on WBP_Map_Body_C_CalcMapImagePosition");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, AddOffset) == 0x000000, "Member 'WBP_Map_Body_C_CalcMapImagePosition::AddOffset' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, Position) == 0x000010, "Member 'WBP_Map_Body_C_CalcMapImagePosition::Position' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000020, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_GetPosition_ReturnValue) == 0x000028, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_GetSize_ReturnValue) == 0x000038, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_Add_Vector2DVector2D_ReturnValue) == 0x000048, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_Add_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000058, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_BreakVector2D_X) == 0x000068, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_BreakVector2D_Y) == 0x000070, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_BreakVector2D_X_1) == 0x000078, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_BreakVector2D_Y_1) == 0x000080, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_FMin_ReturnValue) == 0x000088, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x000090, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_FMin_ReturnValue_1) == 0x000098, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_FMin_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_Multiply_DoubleDouble_ReturnValue_1) == 0x0000A0, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_Multiply_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_FMax_ReturnValue) == 0x0000A8, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_FMax_ReturnValue_1) == 0x0000B0, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_FMax_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_CalcMapImagePosition, CallFunc_MakeVector2D_ReturnValue) == 0x0000B8, "Member 'WBP_Map_Body_C_CalcMapImagePosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");

// Function WBP_Map_Body.WBP_Map_Body_C.ExecuteUbergraph_WBP_Map_Body
// 0x04D0 (0x04D0 - 0x0000)
struct WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPalWorldMapUIDataTableRow             CallFunc_GetDataTableRowFromName_OutRow;           // 0x0008(0x00D8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_E2[0x6];                                       // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00E8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UObject*                                Temp_object_Variable;                              // 0x00F0(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_DynamicCast_AsTexture_2D;                   // 0x00F8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_101[0x7];                                      // 0x0101(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry_1;                         // 0x0108(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_14C[0x4];                                      // 0x014C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0150(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0158(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(ECommonInputType bNewInputType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0168(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0178(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0188(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UPalWorldMapUIData*                     CallFunc_GetLocalWorldMapData_ReturnValue;         // 0x0190(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0198(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x01A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_X;                          // 0x01B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y;                          // 0x01B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Conv_IntToDouble_ReturnValue;             // 0x01C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPalWorldMapUIDataTableRow             CallFunc_GetDataTableRowFromName_OutRow_1;         // 0x01C8(0x00D8)()
	bool                                          CallFunc_GetDataTableRowFromName_ReturnValue_1;    // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Divide_DoubleDouble_ReturnValue;          // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPointerEvent                          K2Node_Event_MouseEvent_1;                         // 0x02B0(0x0098)(ConstParm)
	TArray<class FName>                           CallFunc_Map_Keys_Keys;                            // 0x0348(0x0010)(ReferenceParm)
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0358(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0360(0x0040)(IsPlainOldData, NoDestructor)
	struct FPointerEvent                          K2Node_Event_MouseEvent;                           // 0x03A0(0x0098)(ConstParm)
	struct FPalWorldMapUIRegionData               CallFunc_Map_Find_Value;                           // 0x0438(0x0058)()
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0490(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_491[0x7];                                      // 0x0491(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector2D_X_1;                        // 0x0498(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector2D_Y_1;                        // 0x04A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCommonInputSubsystem*                  CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x04A8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	ECommonInputType                              CallFunc_GetCurrentInputType_ReturnValue;          // 0x04B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4B1[0x3];                                      // 0x04B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x04B4(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C4[0x4];                                      // 0x04C4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_UpdateMapTransform_DeltaTime_ImplicitCast; // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body) == 0x000008, "Wrong alignment on WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body");
static_assert(sizeof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body) == 0x0004D0, "Wrong size on WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, EntryPoint) == 0x000000, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_GetDataTableRowFromName_OutRow) == 0x000008, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_GetDataTableRowFromName_OutRow' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_GetDataTableRowFromName_ReturnValue) == 0x0000E0, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_GetDataTableRowFromName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_IsValid_ReturnValue) == 0x0000E1, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, K2Node_CustomEvent_Loaded) == 0x0000E8, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, Temp_object_Variable) == 0x0000F0, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, K2Node_DynamicCast_AsTexture_2D) == 0x0000F8, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::K2Node_DynamicCast_AsTexture_2D' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, K2Node_DynamicCast_bSuccess) == 0x000100, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, K2Node_Event_MyGeometry_1) == 0x000108, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::K2Node_Event_MyGeometry_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, K2Node_Event_InDeltaTime) == 0x000148, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000150, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_GetPosition_ReturnValue) == 0x000158, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, K2Node_CreateDelegate_OutputDelegate) == 0x000168, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, K2Node_CreateDelegate_OutputDelegate_1) == 0x000178, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000188, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_GetLocalWorldMapData_ReturnValue) == 0x000190, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_GetLocalWorldMapData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000198, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_GetSize_ReturnValue) == 0x0001A0, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_BreakVector2D_X) == 0x0001B0, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_BreakVector2D_Y) == 0x0001B8, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_Conv_IntToDouble_ReturnValue) == 0x0001C0, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_Conv_IntToDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_GetDataTableRowFromName_OutRow_1) == 0x0001C8, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_GetDataTableRowFromName_OutRow_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_GetDataTableRowFromName_ReturnValue_1) == 0x0002A0, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_GetDataTableRowFromName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_Divide_DoubleDouble_ReturnValue) == 0x0002A8, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_Divide_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, K2Node_Event_MouseEvent_1) == 0x0002B0, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::K2Node_Event_MouseEvent_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_Map_Keys_Keys) == 0x000348, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_Map_Keys_Keys' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_Array_Get_Item) == 0x000358, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, K2Node_Event_MyGeometry) == 0x000360, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, K2Node_Event_MouseEvent) == 0x0003A0, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::K2Node_Event_MouseEvent' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_Map_Find_Value) == 0x000438, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_Map_Find_ReturnValue) == 0x000490, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_BreakVector2D_X_1) == 0x000498, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_BreakVector2D_Y_1) == 0x0004A0, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_GetLocalPlayerSubsystem_ReturnValue) == 0x0004A8, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_GetLocalPlayerSubsystem_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_GetCurrentInputType_ReturnValue) == 0x0004B0, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_GetCurrentInputType_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, K2Node_CreateDelegate_OutputDelegate_2) == 0x0004B4, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body, CallFunc_UpdateMapTransform_DeltaTime_ImplicitCast) == 0x0004C8, "Member 'WBP_Map_Body_C_ExecuteUbergraph_WBP_Map_Body::CallFunc_UpdateMapTransform_DeltaTime_ImplicitCast' has a wrong offset!");

// Function WBP_Map_Body.WBP_Map_Body_C.GetCursorScrollOffset
// 0x00A0 (0x00A0 - 0x0000)
struct WBP_Map_Body_C_GetCursorScrollOffset final
{
public:
	struct FVector2D                              Offset;                                            // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0018(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0048(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Divide_Vector2DVector2D_ReturnValue;      // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Project_Icon_Position_to_World_Postion_WorldPosition; // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_WorldLocationToWidgetOffset_offset;       // 0x0080(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Body_C_GetCursorScrollOffset) == 0x000008, "Wrong alignment on WBP_Map_Body_C_GetCursorScrollOffset");
static_assert(sizeof(WBP_Map_Body_C_GetCursorScrollOffset) == 0x0000A0, "Wrong size on WBP_Map_Body_C_GetCursorScrollOffset");
static_assert(offsetof(WBP_Map_Body_C_GetCursorScrollOffset, Offset) == 0x000000, "Member 'WBP_Map_Body_C_GetCursorScrollOffset::Offset' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_GetCursorScrollOffset, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000010, "Member 'WBP_Map_Body_C_GetCursorScrollOffset::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_GetCursorScrollOffset, CallFunc_GetPosition_ReturnValue) == 0x000018, "Member 'WBP_Map_Body_C_GetCursorScrollOffset::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_GetCursorScrollOffset, CallFunc_GetSize_ReturnValue) == 0x000028, "Member 'WBP_Map_Body_C_GetCursorScrollOffset::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_GetCursorScrollOffset, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000038, "Member 'WBP_Map_Body_C_GetCursorScrollOffset::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_GetCursorScrollOffset, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000048, "Member 'WBP_Map_Body_C_GetCursorScrollOffset::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_GetCursorScrollOffset, CallFunc_Divide_Vector2DVector2D_ReturnValue) == 0x000058, "Member 'WBP_Map_Body_C_GetCursorScrollOffset::CallFunc_Divide_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_GetCursorScrollOffset, CallFunc_Project_Icon_Position_to_World_Postion_WorldPosition) == 0x000068, "Member 'WBP_Map_Body_C_GetCursorScrollOffset::CallFunc_Project_Icon_Position_to_World_Postion_WorldPosition' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_GetCursorScrollOffset, CallFunc_WorldLocationToWidgetOffset_offset) == 0x000080, "Member 'WBP_Map_Body_C_GetCursorScrollOffset::CallFunc_WorldLocationToWidgetOffset_offset' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_GetCursorScrollOffset, CallFunc_Subtract_Vector2DVector2D_ReturnValue_1) == 0x000090, "Member 'WBP_Map_Body_C_GetCursorScrollOffset::CallFunc_Subtract_Vector2DVector2D_ReturnValue_1' has a wrong offset!");

// Function WBP_Map_Body.WBP_Map_Body_C.On Hovered Any Icon Internal
// 0x00C0 (0x00C0 - 0x0000)
struct WBP_Map_Body_C_On_Hovered_Any_Icon_Internal final
{
public:
	class UWBP_WorldMap_IconBase_NoDesign_C*      IconWidget;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              CallFunc_GetCachedGeometry_ReturnValue;            // 0x0010(0x0040)(ConstParm, IsPlainOldData, NoDestructor)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0050(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0058(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWBP_Map_IconFTTower_C*                 K2Node_DynamicCast_AsWBP_Map_Icon_FTTower;         // 0x0068(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_71[0x7];                                       // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_WorldMap_Icon_Respawn_C*           K2Node_DynamicCast_AsWBP_World_Map_Icon_Respawn;   // 0x0078(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_82[0x6];                                       // 0x0082(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Map_IconCamp_C*                    K2Node_DynamicCast_AsWBP_Map_Icon_Camp;            // 0x0088(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_91[0x7];                                       // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Map_IconTower_C*                   K2Node_DynamicCast_AsWBP_Map_Icon_Tower;           // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A3[0x5];                                       // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UWBP_Map_IconBoss_C*                    K2Node_DynamicCast_AsWBP_Map_Icon_Boss;            // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_B1[0x7];                                       // 0x00B1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_Body_C_On_Hovered_Any_Icon_Internal) == 0x000008, "Wrong alignment on WBP_Map_Body_C_On_Hovered_Any_Icon_Internal");
static_assert(sizeof(WBP_Map_Body_C_On_Hovered_Any_Icon_Internal) == 0x0000C0, "Wrong size on WBP_Map_Body_C_On_Hovered_Any_Icon_Internal");
static_assert(offsetof(WBP_Map_Body_C_On_Hovered_Any_Icon_Internal, IconWidget) == 0x000000, "Member 'WBP_Map_Body_C_On_Hovered_Any_Icon_Internal::IconWidget' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_On_Hovered_Any_Icon_Internal, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000008, "Member 'WBP_Map_Body_C_On_Hovered_Any_Icon_Internal::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_On_Hovered_Any_Icon_Internal, CallFunc_GetCachedGeometry_ReturnValue) == 0x000010, "Member 'WBP_Map_Body_C_On_Hovered_Any_Icon_Internal::CallFunc_GetCachedGeometry_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_On_Hovered_Any_Icon_Internal, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000050, "Member 'WBP_Map_Body_C_On_Hovered_Any_Icon_Internal::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_On_Hovered_Any_Icon_Internal, CallFunc_GetPosition_ReturnValue) == 0x000058, "Member 'WBP_Map_Body_C_On_Hovered_Any_Icon_Internal::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_On_Hovered_Any_Icon_Internal, K2Node_DynamicCast_AsWBP_Map_Icon_FTTower) == 0x000068, "Member 'WBP_Map_Body_C_On_Hovered_Any_Icon_Internal::K2Node_DynamicCast_AsWBP_Map_Icon_FTTower' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_On_Hovered_Any_Icon_Internal, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'WBP_Map_Body_C_On_Hovered_Any_Icon_Internal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_On_Hovered_Any_Icon_Internal, K2Node_DynamicCast_AsWBP_World_Map_Icon_Respawn) == 0x000078, "Member 'WBP_Map_Body_C_On_Hovered_Any_Icon_Internal::K2Node_DynamicCast_AsWBP_World_Map_Icon_Respawn' has a wrong offset!");
static_assert(offsetof(WBP_Map_Body_C_On_Hovered_Any_Icon_Internal, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'WBP_Map_Body_C_On_Hovered_Any_Icon_Internal::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
