#pragma once

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace PalSDK::Params
{

// Function WBP_Map_IconCamp.WBP_Map_IconCamp_C.BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Map_IconCamp.WBP_Map_IconCamp_C.BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Map_IconCamp.WBP_Map_IconCamp_C.BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Map_IconCamp_C_BndEvt__WBP_Map_IconCamp_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Map_IconCamp.WBP_Map_IconCamp_C.ExecuteUbergraph_WBP_Map_IconCamp
// 0x0020 (0x0020 - 0x0000)
struct WBP_Map_IconCamp_C_ExecuteUbergraph_WBP_Map_IconCamp final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconCamp_C_ExecuteUbergraph_WBP_Map_IconCamp) == 0x000008, "Wrong alignment on WBP_Map_IconCamp_C_ExecuteUbergraph_WBP_Map_IconCamp");
static_assert(sizeof(WBP_Map_IconCamp_C_ExecuteUbergraph_WBP_Map_IconCamp) == 0x000020, "Wrong size on WBP_Map_IconCamp_C_ExecuteUbergraph_WBP_Map_IconCamp");
static_assert(offsetof(WBP_Map_IconCamp_C_ExecuteUbergraph_WBP_Map_IconCamp, EntryPoint) == 0x000000, "Member 'WBP_Map_IconCamp_C_ExecuteUbergraph_WBP_Map_IconCamp::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconCamp_C_ExecuteUbergraph_WBP_Map_IconCamp, K2Node_ComponentBoundEvent_Button_2) == 0x000008, "Member 'WBP_Map_IconCamp_C_ExecuteUbergraph_WBP_Map_IconCamp::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconCamp_C_ExecuteUbergraph_WBP_Map_IconCamp, K2Node_ComponentBoundEvent_Button_1) == 0x000010, "Member 'WBP_Map_IconCamp_C_ExecuteUbergraph_WBP_Map_IconCamp::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconCamp_C_ExecuteUbergraph_WBP_Map_IconCamp, K2Node_ComponentBoundEvent_Button) == 0x000018, "Member 'WBP_Map_IconCamp_C_ExecuteUbergraph_WBP_Map_IconCamp::K2Node_ComponentBoundEvent_Button' has a wrong offset!");

// Function WBP_Map_IconCamp.WBP_Map_IconCamp_C.SetEnable
// 0x0014 (0x0014 - 0x0000)
struct WBP_Map_IconCamp_C_SetEnable final
{
public:
	bool                                          Enable;                                            // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x3];                                        // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_SelectColor_ReturnValue;                  // 0x0004(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconCamp_C_SetEnable) == 0x000004, "Wrong alignment on WBP_Map_IconCamp_C_SetEnable");
static_assert(sizeof(WBP_Map_IconCamp_C_SetEnable) == 0x000014, "Wrong size on WBP_Map_IconCamp_C_SetEnable");
static_assert(offsetof(WBP_Map_IconCamp_C_SetEnable, Enable) == 0x000000, "Member 'WBP_Map_IconCamp_C_SetEnable::Enable' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconCamp_C_SetEnable, CallFunc_SelectColor_ReturnValue) == 0x000004, "Member 'WBP_Map_IconCamp_C_SetEnable::CallFunc_SelectColor_ReturnValue' has a wrong offset!");

}

