#pragma once

#include "Basic.hpp"

#include "Pal_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "SlateCore_structs.hpp"


namespace PalSDK::Params
{

// Function WBP_PalNPCHPGaugeCanvas.WBP_PalNPCHPGaugeCanvas_C.Add Boss Gauge
// 0x0048 (0x0048 - 0x0000)
struct WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge final
{
public:
	class APalCharacter*                          TargetCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Actor, EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class APalCharacter* TargetCharacter)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterParameter*       CallFunc_GetIndividualCharacterParameterByActor_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_BossEnemyHPGauge_C*                CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge) == 0x000008, "Wrong alignment on WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge");
static_assert(sizeof(WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge) == 0x000048, "Wrong size on WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge, TargetCharacter) == 0x000000, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge::TargetCharacter' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge, CallFunc_GetOwningPlayer_ReturnValue) == 0x000028, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge, CallFunc_GetIndividualCharacterParameterByActor_ReturnValue) == 0x000030, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge::CallFunc_GetIndividualCharacterParameterByActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge, CallFunc_AddChild_ReturnValue) == 0x000040, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_Boss_Gauge::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_PalNPCHPGaugeCanvas.WBP_PalNPCHPGaugeCanvas_C.Add New Gauge UI
// 0x0350 (0x0350 - 0x0000)
struct WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI final
{
public:
	class APalCharacter*                          TargetCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalDatabaseCharacterParameter*         CallFunc_GetDatabaseCharacterParameter_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalGroupManager*                       CallFunc_GetGroupManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APalPlayerState*                        CallFunc_GetLocalPlayerState_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalPlayerLocalRecordData*              CallFunc_GetLocalRecordData_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInGuild_ReturnValue;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalDatabaseCharacterParameter*         CallFunc_GetDatabaseCharacterParameter_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterParameterComponent*        CallFunc_GetCharacterParameterComponent_ReturnValue; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0048(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_49[0x7];                                       // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0050(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FPalIndividualCharacterSaveParameter   CallFunc_GetSaveParameter_ReturnValue;             // 0x0058(0x02A8)(ConstParm)
	bool                                          CallFunc_GetSaveParameterValue_IsPlayer_ReturnValue; // 0x0300(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_301[0x7];                                      // 0x0301(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalCharacterParameterComponent*        CallFunc_GetCharacterParameterComponent_ReturnValue_1; // 0x0308(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetCharacterIDFromCharacter_ReturnValue;  // 0x0310(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetUseBossHPGauge_ReturnValue;            // 0x0318(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_319[0x7];                                      // 0x0319(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue_1;  // 0x0320(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	EPalTribeID                                   CallFunc_GetTribeID_ReturnValue;                   // 0x0328(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_329[0x3];                                      // 0x0329(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetCharacterID_ReturnValue;               // 0x032C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetIsPal_ReturnValue;                     // 0x0334(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_Value;                           // 0x0335(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Map_Find_ReturnValue;                     // 0x0336(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRarePal_ReturnValue;                    // 0x0337(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0338(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable_1;                              // 0x0339(0x0001)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_33A[0x6];                                      // 0x033A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0340(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0348(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFriend_ReturnValue;                     // 0x0349(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI) == 0x000008, "Wrong alignment on WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI");
static_assert(sizeof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI) == 0x000350, "Wrong size on WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, TargetCharacter) == 0x000000, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::TargetCharacter' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetDatabaseCharacterParameter_ReturnValue) == 0x000008, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetDatabaseCharacterParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetGroupManager_ReturnValue) == 0x000010, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetGroupManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetLocalPlayerState_ReturnValue) == 0x000018, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetLocalPlayerState_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetLocalRecordData_ReturnValue) == 0x000028, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetLocalRecordData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_IsInGuild_ReturnValue) == 0x000030, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_IsInGuild_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetDatabaseCharacterParameter_ReturnValue_1) == 0x000038, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetDatabaseCharacterParameter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetCharacterParameterComponent_ReturnValue) == 0x000040, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetCharacterParameterComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, Temp_bool_Variable) == 0x000048, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000050, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetSaveParameter_ReturnValue) == 0x000058, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetSaveParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetSaveParameterValue_IsPlayer_ReturnValue) == 0x000300, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetSaveParameterValue_IsPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetCharacterParameterComponent_ReturnValue_1) == 0x000308, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetCharacterParameterComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetCharacterIDFromCharacter_ReturnValue) == 0x000310, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetCharacterIDFromCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetUseBossHPGauge_ReturnValue) == 0x000318, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetUseBossHPGauge_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_TryGetIndividualParameter_ReturnValue_1) == 0x000320, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_TryGetIndividualParameter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetTribeID_ReturnValue) == 0x000328, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetTribeID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetCharacterID_ReturnValue) == 0x00032C, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetCharacterID_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetIsPal_ReturnValue) == 0x000334, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetIsPal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_Map_Find_Value) == 0x000335, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_Map_Find_Value' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_Map_Find_ReturnValue) == 0x000336, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_Map_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_IsRarePal_ReturnValue) == 0x000337, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_IsRarePal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_IsValid_ReturnValue_1) == 0x000338, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, Temp_bool_Variable_1) == 0x000339, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::Temp_bool_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_GetPalmi_ReturnValue) == 0x000340, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_IsValid_ReturnValue_2) == 0x000348, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI, CallFunc_IsFriend_ReturnValue) == 0x000349, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_New_Gauge_UI::CallFunc_IsFriend_ReturnValue' has a wrong offset!");

// Function WBP_PalNPCHPGaugeCanvas.WBP_PalNPCHPGaugeCanvas_C.Add Player Gauge
// 0x0048 (0x0048 - 0x0000)
struct WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge final
{
public:
	class APalCharacter*                          TargetCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Actor, EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWidget* Widget)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterHandle*          CallFunc_GetIndividualCharacterHandleByActor_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PlayerHPGauge_C*                   CallFunc_Create_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_AddChildToCanvas_ReturnValue;             // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge) == 0x000008, "Wrong alignment on WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge");
static_assert(sizeof(WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge) == 0x000048, "Wrong size on WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge, TargetCharacter) == 0x000000, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge::TargetCharacter' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000028, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge, CallFunc_GetIndividualCharacterHandleByActor_ReturnValue) == 0x000030, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge::CallFunc_GetIndividualCharacterHandleByActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge, CallFunc_Create_ReturnValue) == 0x000038, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge, CallFunc_AddChildToCanvas_ReturnValue) == 0x000040, "Member 'WBP_PalNPCHPGaugeCanvas_C_Add_Player_Gauge::CallFunc_AddChildToCanvas_ReturnValue' has a wrong offset!");

// Function WBP_PalNPCHPGaugeCanvas.WBP_PalNPCHPGaugeCanvas_C.AddNormalPalGauge
// 0x0050 (0x0050 - 0x0000)
struct WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge final
{
public:
	class APalCharacter*                          TargetCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Actor, EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UWidget* Widget)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UPalCharacterParameterComponent*        CallFunc_GetCharacterParameterComponent_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalIndividualCharacterParameter*       CallFunc_TryGetIndividualParameter_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetOwningPlayer_ReturnValue;              // 0x0038(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UWBP_PalNPCHPGauge_C*                   CallFunc_Create_ReturnValue;                       // 0x0040(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0048(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge) == 0x000008, "Wrong alignment on WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge");
static_assert(sizeof(WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge) == 0x000050, "Wrong size on WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge, TargetCharacter) == 0x000000, "Member 'WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge::TargetCharacter' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge, CallFunc_GetCharacterParameterComponent_ReturnValue) == 0x000028, "Member 'WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge::CallFunc_GetCharacterParameterComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge, CallFunc_TryGetIndividualParameter_ReturnValue) == 0x000030, "Member 'WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge::CallFunc_TryGetIndividualParameter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge, CallFunc_GetOwningPlayer_ReturnValue) == 0x000038, "Member 'WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge::CallFunc_GetOwningPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge, CallFunc_Create_ReturnValue) == 0x000040, "Member 'WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge, CallFunc_AddChild_ReturnValue) == 0x000048, "Member 'WBP_PalNPCHPGaugeCanvas_C_AddNormalPalGauge::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WBP_PalNPCHPGaugeCanvas.WBP_PalNPCHPGaugeCanvas_C.CloseDelayGauges
// 0x0010 (0x0010 - 0x0000)
struct WBP_PalNPCHPGaugeCanvas_C_CloseDelayGauges final
{
public:
	class UWidget*                                Widget;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_RemoveItem_ReturnValue;             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalNPCHPGaugeCanvas_C_CloseDelayGauges) == 0x000008, "Wrong alignment on WBP_PalNPCHPGaugeCanvas_C_CloseDelayGauges");
static_assert(sizeof(WBP_PalNPCHPGaugeCanvas_C_CloseDelayGauges) == 0x000010, "Wrong size on WBP_PalNPCHPGaugeCanvas_C_CloseDelayGauges");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_CloseDelayGauges, Widget) == 0x000000, "Member 'WBP_PalNPCHPGaugeCanvas_C_CloseDelayGauges::Widget' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_CloseDelayGauges, CallFunc_Array_RemoveItem_ReturnValue) == 0x000008, "Member 'WBP_PalNPCHPGaugeCanvas_C_CloseDelayGauges::CallFunc_Array_RemoveItem_ReturnValue' has a wrong offset!");

// Function WBP_PalNPCHPGaugeCanvas.WBP_PalNPCHPGaugeCanvas_C.CREATEDELEGATE_PROXYFUNCTION_0
// 0x00D8 (0x00D8 - 0x0000)
struct WBP_PalNPCHPGaugeCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0 final
{
public:
	struct FPalDamageInfo                         DamageInfo;                                        // 0x0000(0x00D0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AActor*                                 Defender;                                          // 0x00D0(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalNPCHPGaugeCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x000008, "Wrong alignment on WBP_PalNPCHPGaugeCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(sizeof(WBP_PalNPCHPGaugeCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0) == 0x0000D8, "Wrong size on WBP_PalNPCHPGaugeCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0, DamageInfo) == 0x000000, "Member 'WBP_PalNPCHPGaugeCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0::DamageInfo' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0, Defender) == 0x0000D0, "Member 'WBP_PalNPCHPGaugeCanvas_C_CREATEDELEGATE_PROXYFUNCTION_0::Defender' has a wrong offset!");

// Function WBP_PalNPCHPGaugeCanvas.WBP_PalNPCHPGaugeCanvas_C.ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas
// 0x0070 (0x0070 - 0x0000)
struct WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsConflict_isConflict;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5[0x3];                                        // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0008(0x0040)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4C[0x4];                                       // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_ReturnValue;             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_DoubleDouble_ReturnValue;    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAiming_IsAiming;                        // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5A[0x6];                                       // 0x005A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Add_DoubleDouble_B_ImplicitCast;          // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_UpdateChildren_ForTick_deltaTime_ImplicitCast; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas) == 0x000008, "Wrong alignment on WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas");
static_assert(sizeof(WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas) == 0x000070, "Wrong size on WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas, EntryPoint) == 0x000000, "Member 'WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas, CallFunc_IsConflict_isConflict) == 0x000004, "Member 'WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas::CallFunc_IsConflict_isConflict' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas, K2Node_Event_MyGeometry) == 0x000008, "Member 'WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas, K2Node_Event_InDeltaTime) == 0x000048, "Member 'WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas, CallFunc_Add_DoubleDouble_ReturnValue) == 0x000050, "Member 'WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas::CallFunc_Add_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas, CallFunc_GreaterEqual_DoubleDouble_ReturnValue) == 0x000058, "Member 'WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas::CallFunc_GreaterEqual_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas, CallFunc_IsAiming_IsAiming) == 0x000059, "Member 'WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas::CallFunc_IsAiming_IsAiming' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas, CallFunc_Add_DoubleDouble_B_ImplicitCast) == 0x000060, "Member 'WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas::CallFunc_Add_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas, CallFunc_UpdateChildren_ForTick_deltaTime_ImplicitCast) == 0x000068, "Member 'WBP_PalNPCHPGaugeCanvas_C_ExecuteUbergraph_WBP_PalNPCHPGaugeCanvas::CallFunc_UpdateChildren_ForTick_deltaTime_ImplicitCast' has a wrong offset!");

// Function WBP_PalNPCHPGaugeCanvas.WBP_PalNPCHPGaugeCanvas_C.GetCameraLocationAndForwardVector
// 0x0098 (0x0098 - 0x0000)
struct WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ForwardVector;                                     // 0x0018(0x0018)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetLocalPlayerController_ReturnValue;     // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_GetCameraRotation_ReturnValue;            // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_GetCameraLocation_ReturnValue;            // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0068(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0080(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector) == 0x000008, "Wrong alignment on WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector");
static_assert(sizeof(WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector) == 0x000098, "Wrong size on WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector, Location) == 0x000000, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector::Location' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector, ForwardVector) == 0x000018, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector::ForwardVector' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector, CallFunc_GetLocalPlayerController_ReturnValue) == 0x000030, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector::CallFunc_GetLocalPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector, CallFunc_GetCameraRotation_ReturnValue) == 0x000038, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector::CallFunc_GetCameraRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector, CallFunc_GetCameraLocation_ReturnValue) == 0x000050, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector::CallFunc_GetCameraLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector, CallFunc_GetForwardVector_ReturnValue) == 0x000068, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector, CallFunc_Normal_ReturnValue) == 0x000080, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetCameraLocationAndForwardVector::CallFunc_Normal_ReturnValue' has a wrong offset!");

// Function WBP_PalNPCHPGaugeCanvas.WBP_PalNPCHPGaugeCanvas_C.GetDistanceByPlayer
// 0x0070 (0x0070 - 0x0000)
struct WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer final
{
public:
	class AActor*                                 TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                        ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0010(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_31[0x7];                                       // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0050(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_VSize_ReturnValue;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer) == 0x000008, "Wrong alignment on WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer");
static_assert(sizeof(WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer) == 0x000070, "Wrong size on WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer, TargetActor) == 0x000000, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer::TargetActor' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer, ReturnValue) == 0x000008, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer::ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer, CallFunc_GetPalmi_ReturnValue) == 0x000010, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000038, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000050, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer, CallFunc_VSize_ReturnValue) == 0x000068, "Member 'WBP_PalNPCHPGaugeCanvas_C_GetDistanceByPlayer::CallFunc_VSize_ReturnValue' has a wrong offset!");

// Function WBP_PalNPCHPGaugeCanvas.WBP_PalNPCHPGaugeCanvas_C.Is Sight Display
// 0x02B8 (0x02B8 - 0x0000)
struct WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display final
{
public:
	class APalCharacter*                          Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          Return;                                            // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                TmpLocation;                                       // 0x0010(0x0018)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        DotST;                                             // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalFlyMeshHeightCtrlComponent*         CallFunc_GetComponentByClass_ReturnValue;          // 0x0030(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0038(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_51[0x3];                                       // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetDefaultMeshLocationZ_ReturnValue;      // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFlying_ReturnValue;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59[0x7];                                       // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCameraLocationAndForwardVector_location; // 0x0060(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocationAndForwardVector_forwardVector; // 0x0078(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPalSkeletalMeshComponent*              CallFunc_GetMainMesh_ReturnValue;                  // 0x0090(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalInteractableSphereComponentNative*  CallFunc_GetComponentByClass_ReturnValue_1;        // 0x0098(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_A1[0x7];                                       // 0x00A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_BreakVector_X;                            // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Y;                            // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_BreakVector_Z;                            // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue;        // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScaledSphereRadius_ReturnValue;        // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_CC[0x4];                                       // 0x00CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x00D0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_ReturnValue;        // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00F0(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Subtract_DoubleDouble_ReturnValue_1;      // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_FMin_ReturnValue;                         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0118(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         Temp_object_Variable;                              // 0x0130(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_GetCameraLocationAndForwardVector_location_1; // 0x0140(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetCameraLocationAndForwardVector_forwardVector_1; // 0x0158(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0170(0x00E8)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_259[0x7];                                      // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0260(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_279[0x7];                                      // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0280(0x0018)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Dot_VectorVector_ReturnValue;             // 0x0298(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_DoubleDouble_ReturnValue;         // 0x02A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_2A1[0x7];                                      // 0x02A1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	double                                        CallFunc_Subtract_DoubleDouble_B_ImplicitCast;     // 0x02A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                        CallFunc_Multiply_DoubleDouble_A_ImplicitCast;     // 0x02B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display) == 0x000008, "Wrong alignment on WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display");
static_assert(sizeof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display) == 0x0002B8, "Wrong size on WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, Actor) == 0x000000, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::Actor' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, Return) == 0x000008, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::Return' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, TmpLocation) == 0x000010, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::TmpLocation' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, DotST) == 0x000028, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::DotST' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_GetComponentByClass_ReturnValue) == 0x000030, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000038, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_GetDefaultMeshLocationZ_ReturnValue) == 0x000054, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_GetDefaultMeshLocationZ_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_IsFlying_ReturnValue) == 0x000058, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_IsFlying_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_GetCameraLocationAndForwardVector_location) == 0x000060, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_GetCameraLocationAndForwardVector_location' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_GetCameraLocationAndForwardVector_forwardVector) == 0x000078, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_GetCameraLocationAndForwardVector_forwardVector' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_GetMainMesh_ReturnValue) == 0x000090, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_GetMainMesh_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_GetComponentByClass_ReturnValue_1) == 0x000098, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_GetComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_IsValid_ReturnValue_1) == 0x0000A0, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_BreakVector_X) == 0x0000A8, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_BreakVector_Y) == 0x0000B0, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_BreakVector_Z) == 0x0000B8, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_Subtract_DoubleDouble_ReturnValue) == 0x0000C0, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_Subtract_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_GetScaledSphereRadius_ReturnValue) == 0x0000C8, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_GetScaledSphereRadius_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_MakeVector_ReturnValue) == 0x0000D0, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_Multiply_DoubleDouble_ReturnValue) == 0x0000E8, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_Multiply_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_Add_VectorVector_ReturnValue) == 0x0000F0, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_Subtract_DoubleDouble_ReturnValue_1) == 0x000108, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_Subtract_DoubleDouble_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_FMin_ReturnValue) == 0x000110, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_FMin_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000118, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, Temp_object_Variable) == 0x000130, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::Temp_object_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_GetCameraLocationAndForwardVector_location_1) == 0x000140, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_GetCameraLocationAndForwardVector_location_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_GetCameraLocationAndForwardVector_forwardVector_1) == 0x000158, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_GetCameraLocationAndForwardVector_forwardVector_1' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_LineTraceSingle_OutHit) == 0x000170, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_LineTraceSingle_ReturnValue) == 0x000258, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000260, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_Not_PreBool_ReturnValue) == 0x000278, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_Normal_ReturnValue) == 0x000280, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_Dot_VectorVector_ReturnValue) == 0x000298, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_Greater_DoubleDouble_ReturnValue) == 0x0002A0, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_Greater_DoubleDouble_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_Subtract_DoubleDouble_B_ImplicitCast) == 0x0002A8, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_Subtract_DoubleDouble_B_ImplicitCast' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display, CallFunc_Multiply_DoubleDouble_A_ImplicitCast) == 0x0002B0, "Member 'WBP_PalNPCHPGaugeCanvas_C_Is_Sight_Display::CallFunc_Multiply_DoubleDouble_A_ImplicitCast' has a wrong offset!");

// Function WBP_PalNPCHPGaugeCanvas.WBP_PalNPCHPGaugeCanvas_C.IsAiming
// 0x0018 (0x0018 - 0x0000)
struct WBP_PalNPCHPGaugeCanvas_C_IsAiming final
{
public:
	bool                                          IsAiming_0;                                        // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsAiming_ReturnValue;                     // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalNPCHPGaugeCanvas_C_IsAiming) == 0x000008, "Wrong alignment on WBP_PalNPCHPGaugeCanvas_C_IsAiming");
static_assert(sizeof(WBP_PalNPCHPGaugeCanvas_C_IsAiming) == 0x000018, "Wrong size on WBP_PalNPCHPGaugeCanvas_C_IsAiming");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_IsAiming, IsAiming_0) == 0x000000, "Member 'WBP_PalNPCHPGaugeCanvas_C_IsAiming::IsAiming_0' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_IsAiming, CallFunc_GetPalmi_ReturnValue) == 0x000008, "Member 'WBP_PalNPCHPGaugeCanvas_C_IsAiming::CallFunc_GetPalmi_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_IsAiming, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WBP_PalNPCHPGaugeCanvas_C_IsAiming::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_IsAiming, CallFunc_IsAiming_ReturnValue) == 0x000011, "Member 'WBP_PalNPCHPGaugeCanvas_C_IsAiming::CallFunc_IsAiming_ReturnValue' has a wrong offset!");

// Function WBP_PalNPCHPGaugeCanvas.WBP_PalNPCHPGaugeCanvas_C.isConflict
// 0x0018 (0x0018 - 0x0000)
struct WBP_PalNPCHPGaugeCanvas_C_IsConflict final
{
public:
	bool                                          IsConflict_0;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class APalPlayerCharacter*                    CallFunc_GetPalmi_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetBattleMode_ReturnValue;                // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalNPCHPGaugeCanvas_C_IsConflict) == 0x000008, "Wrong alignment on WBP_PalNPCHPGaugeCanvas_C_IsConflict");
static_assert(sizeof(WBP_PalNPCHPGaugeCanvas_C_IsConflict) == 0x000018, "Wrong size on WBP_PalNPCHPGaugeCanvas_C_IsConflict");
static_assert(offsetof(WBP_PalNPCHPGaugeCanvas_C_IsConflict, IsConflict_0) == 0x000000, "Member 'WBP_PalNPCHPGaugeCanvas_C_IsConflict::IsConflict_0' has a wrong offset!");
