#pragma once

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace PalSDK::Params
{

// Function WBP_Map_IconBoss.WBP_Map_IconBoss_C.BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_IconBoss_C_BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconBoss_C_BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Map_IconBoss_C_BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Map_IconBoss_C_BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Map_IconBoss_C_BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Map_IconBoss_C_BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Map_IconBoss_C_BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Map_IconBoss.WBP_Map_IconBoss_C.BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_IconBoss_C_BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconBoss_C_BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Map_IconBoss_C_BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Map_IconBoss_C_BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Map_IconBoss_C_BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Map_IconBoss_C_BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Map_IconBoss_C_BndEvt__WBP_Map_IconTower_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Map_IconBoss.WBP_Map_IconBoss_C.ExecuteUbergraph_WBP_Map_IconBoss
// 0x0040 (0x0040 - 0x0000)
struct WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              Temp_byte_Variable_1;                              // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_7[0x1];                                        // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_CustomEvent_characterId;                    // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Level;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_Spawner_Id;                     // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1D[0x3];                                       // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0028(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UPalPlayerRecordData*                   CallFunc_GetLocalRecordData_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetRecordData_Bool_ReturnValue;           // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss) == 0x000008, "Wrong alignment on WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss");
static_assert(sizeof(WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss) == 0x000040, "Wrong size on WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss");
static_assert(offsetof(WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss, EntryPoint) == 0x000000, "Member 'WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss, Temp_bool_Variable) == 0x000004, "Member 'WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss, Temp_byte_Variable) == 0x000005, "Member 'WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss, Temp_byte_Variable_1) == 0x000006, "Member 'WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss, K2Node_CustomEvent_characterId) == 0x000008, "Member 'WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss::K2Node_CustomEvent_characterId' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss, K2Node_CustomEvent_Level) == 0x000010, "Member 'WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss::K2Node_CustomEvent_Level' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss, K2Node_CustomEvent_Spawner_Id) == 0x000014, "Member 'WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss::K2Node_CustomEvent_Spawner_Id' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss, K2Node_Select_Default) == 0x00001C, "Member 'WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss, K2Node_ComponentBoundEvent_Button_1) == 0x000020, "Member 'WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss, K2Node_ComponentBoundEvent_Button) == 0x000028, "Member 'WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss, CallFunc_GetLocalRecordData_ReturnValue) == 0x000030, "Member 'WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss::CallFunc_GetLocalRecordData_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss, CallFunc_GetRecordData_Bool_ReturnValue) == 0x000038, "Member 'WBP_Map_IconBoss_C_ExecuteUbergraph_WBP_Map_IconBoss::CallFunc_GetRecordData_Bool_ReturnValue' has a wrong offset!");

// Function WBP_Map_IconBoss.WBP_Map_IconBoss_C.SetBoss
// 0x0014 (0x0014 - 0x0000)
struct WBP_Map_IconBoss_C_SetBoss final
{
public:
	class FName                                   CharacterID;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Level_0;                                           // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Spawner_Id_0;                                      // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconBoss_C_SetBoss) == 0x000004, "Wrong alignment on WBP_Map_IconBoss_C_SetBoss");
static_assert(sizeof(WBP_Map_IconBoss_C_SetBoss) == 0x000014, "Wrong size on WBP_Map_IconBoss_C_SetBoss");
static_assert(offsetof(WBP_Map_IconBoss_C_SetBoss, CharacterID) == 0x000000, "Member 'WBP_Map_IconBoss_C_SetBoss::CharacterID' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconBoss_C_SetBoss, Level_0) == 0x000008, "Member 'WBP_Map_IconBoss_C_SetBoss::Level_0' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconBoss_C_SetBoss, Spawner_Id_0) == 0x00000C, "Member 'WBP_Map_IconBoss_C_SetBoss::Spawner_Id_0' has a wrong offset!");

}

