#pragma once

#include "Basic.hpp"


namespace PalSDK::Params
{

// Function WBP_Map_IconCustom.WBP_Map_IconCustom_C.BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_0_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Map_IconCustom.WBP_Map_IconCustom_C.BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Map_IconCustom.WBP_Map_IconCustom_C.BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_Map_IconCustom_C_BndEvt__WBP_Map_IconCustom_WBP_PalCommonButton_K2Node_ComponentBoundEvent_2_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_Map_IconCustom.WBP_Map_IconCustom_C.ExecuteUbergraph_WBP_Map_IconCustom
// 0x0030 (0x0030 - 0x0000)
struct WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_GetDynamicMaterial_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_2;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button_1;               // 0x0018(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0020(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             K2Node_CustomEvent_Texture;                        // 0x0028(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom) == 0x000008, "Wrong alignment on WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom");
static_assert(sizeof(WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom) == 0x000030, "Wrong size on WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom");
static_assert(offsetof(WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom, EntryPoint) == 0x000000, "Member 'WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom, CallFunc_GetDynamicMaterial_ReturnValue) == 0x000008, "Member 'WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom::CallFunc_GetDynamicMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom, K2Node_ComponentBoundEvent_Button_2) == 0x000010, "Member 'WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom::K2Node_ComponentBoundEvent_Button_2' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom, K2Node_ComponentBoundEvent_Button_1) == 0x000018, "Member 'WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom::K2Node_ComponentBoundEvent_Button_1' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom, K2Node_ComponentBoundEvent_Button) == 0x000020, "Member 'WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom, K2Node_CustomEvent_Texture) == 0x000028, "Member 'WBP_Map_IconCustom_C_ExecuteUbergraph_WBP_Map_IconCustom::K2Node_CustomEvent_Texture' has a wrong offset!");

// Function WBP_Map_IconCustom.WBP_Map_IconCustom_C.SetTexture
// 0x0008 (0x0008 - 0x0000)
struct WBP_Map_IconCustom_C_SetTexture final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_Map_IconCustom_C_SetTexture) == 0x000008, "Wrong alignment on WBP_Map_IconCustom_C_SetTexture");
static_assert(sizeof(WBP_Map_IconCustom_C_SetTexture) == 0x000008, "Wrong size on WBP_Map_IconCustom_C_SetTexture");
static_assert(offsetof(WBP_Map_IconCustom_C_SetTexture, Texture) == 0x000000, "Member 'WBP_Map_IconCustom_C_SetTexture::Texture' has a wrong offset!");

}

