#pragma once

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "Pal_structs.hpp"


namespace PalSDK::Params
{

// Function WBP_PalStorageSortElementFilterCheckBox.WBP_PalStorageSortElementFilterCheckBox_C.BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct WBP_PalStorageSortElementFilterCheckBox_C_BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature final
{
public:
	class UCommonButtonBase*                      Button;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortElementFilterCheckBox_C_BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong alignment on WBP_PalStorageSortElementFilterCheckBox_C_BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(sizeof(WBP_PalStorageSortElementFilterCheckBox_C_BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature) == 0x000008, "Wrong size on WBP_PalStorageSortElementFilterCheckBox_C_BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature");
static_assert(offsetof(WBP_PalStorageSortElementFilterCheckBox_C_BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature, Button) == 0x000000, "Member 'WBP_PalStorageSortElementFilterCheckBox_C_BndEvt__WBP_PalStorageSortElementFilterCheckBox_WBP_PalInvisibleButton_K2Node_ComponentBoundEvent_1_CommonButtonBaseClicked__DelegateSignature::Button' has a wrong offset!");

// Function WBP_PalStorageSortElementFilterCheckBox.WBP_PalStorageSortElementFilterCheckBox_C.ExecuteUbergraph_WBP_PalStorageSortElementFilterCheckBox
// 0x0018 (0x0018 - 0x0000)
struct WBP_PalStorageSortElementFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortElementFilterCheckBox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCommonButtonBase*                      K2Node_ComponentBoundEvent_Button;                 // 0x0008(0x0008)(ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsChecked_ReturnValue;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortElementFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortElementFilterCheckBox) == 0x000008, "Wrong alignment on WBP_PalStorageSortElementFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortElementFilterCheckBox");
static_assert(sizeof(WBP_PalStorageSortElementFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortElementFilterCheckBox) == 0x000018, "Wrong size on WBP_PalStorageSortElementFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortElementFilterCheckBox");
static_assert(offsetof(WBP_PalStorageSortElementFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortElementFilterCheckBox, EntryPoint) == 0x000000, "Member 'WBP_PalStorageSortElementFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortElementFilterCheckBox::EntryPoint' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortElementFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortElementFilterCheckBox, K2Node_ComponentBoundEvent_Button) == 0x000008, "Member 'WBP_PalStorageSortElementFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortElementFilterCheckBox::K2Node_ComponentBoundEvent_Button' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortElementFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortElementFilterCheckBox, CallFunc_IsChecked_ReturnValue) == 0x000010, "Member 'WBP_PalStorageSortElementFilterCheckBox_C_ExecuteUbergraph_WBP_PalStorageSortElementFilterCheckBox::CallFunc_IsChecked_ReturnValue' has a wrong offset!");

// Function WBP_PalStorageSortElementFilterCheckBox.WBP_PalStorageSortElementFilterCheckBox_C.OnChangedStateInternal
// 0x0001 (0x0001 - 0x0000)
struct WBP_PalStorageSortElementFilterCheckBox_C_OnChangedStateInternal final
{
public:
	bool                                          IsChecked;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortElementFilterCheckBox_C_OnChangedStateInternal) == 0x000001, "Wrong alignment on WBP_PalStorageSortElementFilterCheckBox_C_OnChangedStateInternal");
static_assert(sizeof(WBP_PalStorageSortElementFilterCheckBox_C_OnChangedStateInternal) == 0x000001, "Wrong size on WBP_PalStorageSortElementFilterCheckBox_C_OnChangedStateInternal");
static_assert(offsetof(WBP_PalStorageSortElementFilterCheckBox_C_OnChangedStateInternal, IsChecked) == 0x000000, "Member 'WBP_PalStorageSortElementFilterCheckBox_C_OnChangedStateInternal::IsChecked' has a wrong offset!");

// Function WBP_PalStorageSortElementFilterCheckBox.WBP_PalStorageSortElementFilterCheckBox_C.OnClicked__DelegateSignature
// 0x0002 (0x0002 - 0x0000)
struct WBP_PalStorageSortElementFilterCheckBox_C_OnClicked__DelegateSignature final
{
public:
	bool                                          bChecked;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EPalElementType                               ElementType;                                       // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortElementFilterCheckBox_C_OnClicked__DelegateSignature) == 0x000001, "Wrong alignment on WBP_PalStorageSortElementFilterCheckBox_C_OnClicked__DelegateSignature");
static_assert(sizeof(WBP_PalStorageSortElementFilterCheckBox_C_OnClicked__DelegateSignature) == 0x000002, "Wrong size on WBP_PalStorageSortElementFilterCheckBox_C_OnClicked__DelegateSignature");
static_assert(offsetof(WBP_PalStorageSortElementFilterCheckBox_C_OnClicked__DelegateSignature, bChecked) == 0x000000, "Member 'WBP_PalStorageSortElementFilterCheckBox_C_OnClicked__DelegateSignature::bChecked' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortElementFilterCheckBox_C_OnClicked__DelegateSignature, ElementType) == 0x000001, "Member 'WBP_PalStorageSortElementFilterCheckBox_C_OnClicked__DelegateSignature::ElementType' has a wrong offset!");

// Function WBP_PalStorageSortElementFilterCheckBox.WBP_PalStorageSortElementFilterCheckBox_C.SetCheckedState
// 0x0005 (0x0005 - 0x0000)
struct WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState final
{
public:
	bool                                          bChecked;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ECheckBoxState                                K2Node_Select_Default;                             // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState) == 0x000001, "Wrong alignment on WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState");
static_assert(sizeof(WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState) == 0x000005, "Wrong size on WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState");
static_assert(offsetof(WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState, bChecked) == 0x000000, "Member 'WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState::bChecked' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState, Temp_bool_Variable) == 0x000001, "Member 'WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState::Temp_bool_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState, Temp_byte_Variable) == 0x000002, "Member 'WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState::Temp_byte_Variable' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState, Temp_byte_Variable_1) == 0x000003, "Member 'WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState::Temp_byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState, K2Node_Select_Default) == 0x000004, "Member 'WBP_PalStorageSortElementFilterCheckBox_C_SetCheckedState::K2Node_Select_Default' has a wrong offset!");

// Function WBP_PalStorageSortElementFilterCheckBox.WBP_PalStorageSortElementFilterCheckBox_C.SetElementType
// 0x0020 (0x0020 - 0x0000)
struct WBP_PalStorageSortElementFilterCheckBox_C_SetElementType final
{
public:
	EPalElementType                               ElenemtType;                                       // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetPalElementTypeName_outName;            // 0x0008(0x0018)()
};
static_assert(alignof(WBP_PalStorageSortElementFilterCheckBox_C_SetElementType) == 0x000008, "Wrong alignment on WBP_PalStorageSortElementFilterCheckBox_C_SetElementType");
static_assert(sizeof(WBP_PalStorageSortElementFilterCheckBox_C_SetElementType) == 0x000020, "Wrong size on WBP_PalStorageSortElementFilterCheckBox_C_SetElementType");
static_assert(offsetof(WBP_PalStorageSortElementFilterCheckBox_C_SetElementType, ElenemtType) == 0x000000, "Member 'WBP_PalStorageSortElementFilterCheckBox_C_SetElementType::ElenemtType' has a wrong offset!");
static_assert(offsetof(WBP_PalStorageSortElementFilterCheckBox_C_SetElementType, CallFunc_GetPalElementTypeName_outName) == 0x000008, "Member 'WBP_PalStorageSortElementFilterCheckBox_C_SetElementType::CallFunc_GetPalElementTypeName_outName' has a wrong offset!");

}

